/* automatically generated by rust-bindgen 0.57.0 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const PJLIB_UTIL_EHTTPLOST: u32 = 320155;
pub const PJ_CLI_EEXIT: u32 = 320201;
pub const PJ_CLI_EMISSINGARG: u32 = 320202;
pub const PJ_CLI_ETOOMANYARGS: u32 = 320203;
pub const PJ_CLI_EINVARG: u32 = 320204;
pub const PJ_CLI_EBADNAME: u32 = 320205;
pub const PJ_CLI_EBADID: u32 = 320206;
pub const PJ_CLI_EBADXML: u32 = 320207;
pub const PJ_CLI_EAMBIGUOUS: u32 = 320208;
pub const PJ_CLI_ETELNETLOST: u32 = 320211;
pub const PJ_SHA1_DIGEST_SIZE: u32 = 20;
pub const PJ_HTTP_HEADER_SIZE: u32 = 32;
pub const PJ_CLI_CONSOLE_LOG_LEVEL: u32 = 5;
pub const PJ_CLI_TELNET_LOG_LEVEL: u32 = 4;
pub const PJ_CLI_TELNET_PORT: u32 = 0;
pub const pj_hex_digits: &'static [u8; 17usize] = b"0123456789abcdef\0";
pub const PJ_GUID_MAX_LENGTH: u32 = 36;
pub const PJSUA_POOL_LEN: u32 = 1000;
pub const PJSUA_POOL_INC: u32 = 1000;
pub const PJSUA_POOL_LEN_ACC: u32 = 512;
pub const PJSUA_POOL_INC_ACC: u32 = 256;
pub const PJSUA_ACC_MAX_PROXIES: u32 = 8;
pub const PJSUA_DEFAULT_SRTP_SECURE_SIGNALING: u32 = 1;
pub const PJSUA_ADD_ICE_TAGS: u32 = 1;
pub const PJSUA_ACQUIRE_CALL_TIMEOUT: u32 = 2000;
pub const PJSUA_HAS_VIDEO: u32 = 0;
pub const PJSUA_VID_REQ_KEYFRAME_INTERVAL: u32 = 3000;
pub const PJSUA_SEPARATE_WORKER_FOR_TIMER: u32 = 0;
pub const PJSUA_ICE_TRANSPORT_OPTION: u32 = 0;
pub const PJSUA_TRICKLE_ICE_NEW_CAND_CHECK_INTERVAL: u32 = 100;
pub const PJSUA_MAX_ACC: u32 = 8;
pub const PJSUA_REG_INTERVAL: u32 = 300;
pub const PJSUA_UNREG_TIMEOUT: u32 = 4000;
pub const PJSUA_DEFAULT_ACC_PRIORITY: u32 = 0;
pub const PJSUA_UNPUBLISH_MAX_WAIT_TIME_MSEC: u32 = 2000;
pub const PJSUA_REG_RETRY_INTERVAL: u32 = 300;
pub const PJSUA_REG_USE_OUTBOUND_PROXY: u32 = 1;
pub const PJSUA_REG_USE_ACC_PROXY: u32 = 2;
pub const PJSUA_MAX_CALLS: u32 = 32;
pub const PJSUA_MAX_VID_WINS: u32 = 16;
pub const PJSUA_CALL_SEND_DTMF_DURATION_DEFAULT: u32 = 160;
pub const PJSUA_XFER_NO_REQUIRE_REPLACES: u32 = 1;
pub const PJSUA_MAX_BUDDIES: u32 = 256;
pub const PJSUA_PRES_TIMER: u32 = 300;
pub const PJSUA_MEDIA_HAS_PJMEDIA: u32 = 1;
pub const PJSUA_THIRD_PARTY_STREAM_HAS_GET_INFO: u32 = 0;
pub const PJSUA_THIRD_PARTY_STREAM_HAS_GET_STAT: u32 = 0;
pub const PJSUA_MAX_CONF_PORTS: u32 = 254;
pub const PJSUA_DEFAULT_CLOCK_RATE: u32 = 16000;
pub const PJSUA_DEFAULT_AUDIO_FRAME_PTIME: u32 = 20;
pub const PJSUA_DEFAULT_CODEC_QUALITY: u32 = 8;
pub const PJSUA_DEFAULT_ILBC_MODE: u32 = 30;
pub const PJSUA_DEFAULT_EC_TAIL_LEN: u32 = 200;
pub const PJSUA_MAX_PLAYERS: u32 = 32;
pub const PJSUA_MAX_RECORDERS: u32 = 32;
pub const PJSUA_SDP_SESS_HAS_CONN: u32 = 0;
pub const PJSUA_TRANSPORT_RESTART_DELAY_TIME: u32 = 10;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type size_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    assert_eq!(
        ::std::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sigset_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sigset_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type pj_int64_t = ::std::os::raw::c_longlong;
pub type pj_uint64_t = ::std::os::raw::c_ulonglong;
pub type wchar_t = ::std::os::raw::c_int;
extern "C" {
    pub static mut PJ_VERSION: *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn pj_get_version() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn pj_dump_config();
}
pub type pj_int32_t = ::std::os::raw::c_int;
pub type pj_uint32_t = ::std::os::raw::c_uint;
pub type pj_int16_t = ::std::os::raw::c_short;
pub type pj_uint16_t = ::std::os::raw::c_ushort;
pub type pj_int8_t = ::std::os::raw::c_schar;
pub type pj_uint8_t = ::std::os::raw::c_uchar;
pub type pj_size_t = size_t;
pub type pj_ssize_t = ::std::os::raw::c_long;
pub type pj_status_t = ::std::os::raw::c_int;
pub type pj_bool_t = ::std::os::raw::c_int;
pub type pj_char_t = ::std::os::raw::c_char;
pub const pj_constants__PJ_SUCCESS: pj_constants_ = 0;
pub const pj_constants__PJ_TRUE: pj_constants_ = 1;
pub const pj_constants__PJ_FALSE: pj_constants_ = 0;
pub type pj_constants_ = ::std::os::raw::c_uint;
pub type pj_off_t = pj_int64_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_str_t {
    pub ptr: *mut ::std::os::raw::c_char,
    pub slen: pj_ssize_t,
}
#[test]
fn bindgen_test_layout_pj_str_t() {
    assert_eq!(
        ::std::mem::size_of::<pj_str_t>(),
        16usize,
        concat!("Size of: ", stringify!(pj_str_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_str_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pj_str_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_str_t>())).ptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_str_t),
            "::",
            stringify!(ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_str_t>())).slen as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_str_t),
            "::",
            stringify!(slen)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pj_timestamp {
    pub u32_: pj_timestamp__bindgen_ty_1,
    pub u64_: pj_uint64_t,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_timestamp__bindgen_ty_1 {
    pub lo: pj_uint32_t,
    pub hi: pj_uint32_t,
}
#[test]
fn bindgen_test_layout_pj_timestamp__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<pj_timestamp__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(pj_timestamp__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_timestamp__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(pj_timestamp__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_timestamp__bindgen_ty_1>())).lo as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_timestamp__bindgen_ty_1),
            "::",
            stringify!(lo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_timestamp__bindgen_ty_1>())).hi as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_timestamp__bindgen_ty_1),
            "::",
            stringify!(hi)
        )
    );
}
#[test]
fn bindgen_test_layout_pj_timestamp() {
    assert_eq!(
        ::std::mem::size_of::<pj_timestamp>(),
        8usize,
        concat!("Size of: ", stringify!(pj_timestamp))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_timestamp>(),
        8usize,
        concat!("Alignment of ", stringify!(pj_timestamp))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_timestamp>())).u32_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_timestamp),
            "::",
            stringify!(u32_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_timestamp>())).u64_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_timestamp),
            "::",
            stringify!(u64_)
        )
    );
}
pub type pj_list_type = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_hash_table_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_hash_entry {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_hash_iterator_t {
    pub index: pj_uint32_t,
    pub entry: *mut pj_hash_entry,
}
#[test]
fn bindgen_test_layout_pj_hash_iterator_t() {
    assert_eq!(
        ::std::mem::size_of::<pj_hash_iterator_t>(),
        16usize,
        concat!("Size of: ", stringify!(pj_hash_iterator_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_hash_iterator_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pj_hash_iterator_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_hash_iterator_t>())).index as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_hash_iterator_t),
            "::",
            stringify!(index)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_hash_iterator_t>())).entry as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_hash_iterator_t),
            "::",
            stringify!(entry)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_ioqueue_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_ioqueue_key_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_timer_heap_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_atomic_t {
    _unused: [u8; 0],
}
pub type pj_atomic_value_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_thread_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_lock_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_grp_lock_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_mutex_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_sem_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_event_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_pipe_t {
    _unused: [u8; 0],
}
pub type pj_oshandle_t = *mut ::std::os::raw::c_void;
pub type pj_sock_t = ::std::os::raw::c_long;
pub type pj_sockaddr_t = ::std::os::raw::c_void;
pub type pj_color_t = ::std::os::raw::c_uint;
pub type pj_exception_id_t = ::std::os::raw::c_int;
extern "C" {
    pub fn pj_init() -> pj_status_t;
}
extern "C" {
    pub fn pj_shutdown();
}
pub type pj_exit_callback = ::std::option::Option<unsafe extern "C" fn()>;
extern "C" {
    pub fn pj_atexit(func: pj_exit_callback) -> pj_status_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_time_val {
    pub sec: ::std::os::raw::c_long,
    pub msec: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pj_time_val() {
    assert_eq!(
        ::std::mem::size_of::<pj_time_val>(),
        16usize,
        concat!("Size of: ", stringify!(pj_time_val))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_time_val>(),
        8usize,
        concat!("Alignment of ", stringify!(pj_time_val))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_time_val>())).sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_time_val),
            "::",
            stringify!(sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_time_val>())).msec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_time_val),
            "::",
            stringify!(msec)
        )
    );
}
extern "C" {
    pub fn pj_time_val_normalize(t: *mut pj_time_val);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_parsed_time {
    pub wday: ::std::os::raw::c_int,
    pub day: ::std::os::raw::c_int,
    pub mon: ::std::os::raw::c_int,
    pub year: ::std::os::raw::c_int,
    pub sec: ::std::os::raw::c_int,
    pub min: ::std::os::raw::c_int,
    pub hour: ::std::os::raw::c_int,
    pub msec: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pj_parsed_time() {
    assert_eq!(
        ::std::mem::size_of::<pj_parsed_time>(),
        32usize,
        concat!("Size of: ", stringify!(pj_parsed_time))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_parsed_time>(),
        4usize,
        concat!("Alignment of ", stringify!(pj_parsed_time))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_parsed_time>())).wday as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_parsed_time),
            "::",
            stringify!(wday)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_parsed_time>())).day as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_parsed_time),
            "::",
            stringify!(day)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_parsed_time>())).mon as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_parsed_time),
            "::",
            stringify!(mon)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_parsed_time>())).year as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_parsed_time),
            "::",
            stringify!(year)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_parsed_time>())).sec as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_parsed_time),
            "::",
            stringify!(sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_parsed_time>())).min as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_parsed_time),
            "::",
            stringify!(min)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_parsed_time>())).hour as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_parsed_time),
            "::",
            stringify!(hour)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_parsed_time>())).msec as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_parsed_time),
            "::",
            stringify!(msec)
        )
    );
}
pub const PJ_TERM_COLOR_R: ::std::os::raw::c_uint = 2;
pub const PJ_TERM_COLOR_G: ::std::os::raw::c_uint = 4;
pub const PJ_TERM_COLOR_B: ::std::os::raw::c_uint = 1;
pub const PJ_TERM_COLOR_BRIGHT: ::std::os::raw::c_uint = 8;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_cfg_t {
    pub endpt: pjsip_cfg_t__bindgen_ty_1,
    pub tsx: pjsip_cfg_t__bindgen_ty_2,
    pub regc: pjsip_cfg_t__bindgen_ty_3,
    pub tcp: pjsip_cfg_t__bindgen_ty_4,
    pub tls: pjsip_cfg_t__bindgen_ty_5,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_cfg_t__bindgen_ty_1 {
    pub allow_port_in_fromto_hdr: pj_bool_t,
    pub accept_replace_in_early_state: pj_bool_t,
    pub allow_tx_hash_in_uri: pj_bool_t,
    pub disable_rport: pj_bool_t,
    pub disable_tcp_switch: pj_bool_t,
    pub disable_tls_switch: pj_bool_t,
    pub follow_early_media_fork: pj_bool_t,
    pub req_has_via_alias: pj_bool_t,
    pub resolve_hostname_to_get_interface: pj_bool_t,
    pub disable_secure_dlg_check: pj_bool_t,
    pub use_compact_form: pj_bool_t,
    pub accept_multiple_sdp_answers: pj_bool_t,
}
#[test]
fn bindgen_test_layout_pjsip_cfg_t__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_cfg_t__bindgen_ty_1>(),
        48usize,
        concat!("Size of: ", stringify!(pjsip_cfg_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_cfg_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(pjsip_cfg_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_cfg_t__bindgen_ty_1>())).allow_port_in_fromto_hdr
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cfg_t__bindgen_ty_1),
            "::",
            stringify!(allow_port_in_fromto_hdr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_cfg_t__bindgen_ty_1>())).accept_replace_in_early_state
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cfg_t__bindgen_ty_1),
            "::",
            stringify!(accept_replace_in_early_state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_cfg_t__bindgen_ty_1>())).allow_tx_hash_in_uri as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cfg_t__bindgen_ty_1),
            "::",
            stringify!(allow_tx_hash_in_uri)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_cfg_t__bindgen_ty_1>())).disable_rport as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cfg_t__bindgen_ty_1),
            "::",
            stringify!(disable_rport)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_cfg_t__bindgen_ty_1>())).disable_tcp_switch as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cfg_t__bindgen_ty_1),
            "::",
            stringify!(disable_tcp_switch)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_cfg_t__bindgen_ty_1>())).disable_tls_switch as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cfg_t__bindgen_ty_1),
            "::",
            stringify!(disable_tls_switch)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_cfg_t__bindgen_ty_1>())).follow_early_media_fork
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cfg_t__bindgen_ty_1),
            "::",
            stringify!(follow_early_media_fork)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_cfg_t__bindgen_ty_1>())).req_has_via_alias as *const _
                as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cfg_t__bindgen_ty_1),
            "::",
            stringify!(req_has_via_alias)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_cfg_t__bindgen_ty_1>())).resolve_hostname_to_get_interface
                as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cfg_t__bindgen_ty_1),
            "::",
            stringify!(resolve_hostname_to_get_interface)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_cfg_t__bindgen_ty_1>())).disable_secure_dlg_check
                as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cfg_t__bindgen_ty_1),
            "::",
            stringify!(disable_secure_dlg_check)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_cfg_t__bindgen_ty_1>())).use_compact_form as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cfg_t__bindgen_ty_1),
            "::",
            stringify!(use_compact_form)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_cfg_t__bindgen_ty_1>())).accept_multiple_sdp_answers
                as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cfg_t__bindgen_ty_1),
            "::",
            stringify!(accept_multiple_sdp_answers)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_cfg_t__bindgen_ty_2 {
    pub max_count: ::std::os::raw::c_uint,
    pub t1: ::std::os::raw::c_uint,
    pub t2: ::std::os::raw::c_uint,
    pub t4: ::std::os::raw::c_uint,
    pub td: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_pjsip_cfg_t__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_cfg_t__bindgen_ty_2>(),
        20usize,
        concat!("Size of: ", stringify!(pjsip_cfg_t__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_cfg_t__bindgen_ty_2>(),
        4usize,
        concat!("Alignment of ", stringify!(pjsip_cfg_t__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_cfg_t__bindgen_ty_2>())).max_count as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cfg_t__bindgen_ty_2),
            "::",
            stringify!(max_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_cfg_t__bindgen_ty_2>())).t1 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cfg_t__bindgen_ty_2),
            "::",
            stringify!(t1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_cfg_t__bindgen_ty_2>())).t2 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cfg_t__bindgen_ty_2),
            "::",
            stringify!(t2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_cfg_t__bindgen_ty_2>())).t4 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cfg_t__bindgen_ty_2),
            "::",
            stringify!(t4)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_cfg_t__bindgen_ty_2>())).td as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cfg_t__bindgen_ty_2),
            "::",
            stringify!(td)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_cfg_t__bindgen_ty_3 {
    pub check_contact: pj_bool_t,
    pub add_xuid_param: pj_bool_t,
}
#[test]
fn bindgen_test_layout_pjsip_cfg_t__bindgen_ty_3() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_cfg_t__bindgen_ty_3>(),
        8usize,
        concat!("Size of: ", stringify!(pjsip_cfg_t__bindgen_ty_3))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_cfg_t__bindgen_ty_3>(),
        4usize,
        concat!("Alignment of ", stringify!(pjsip_cfg_t__bindgen_ty_3))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_cfg_t__bindgen_ty_3>())).check_contact as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cfg_t__bindgen_ty_3),
            "::",
            stringify!(check_contact)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_cfg_t__bindgen_ty_3>())).add_xuid_param as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cfg_t__bindgen_ty_3),
            "::",
            stringify!(add_xuid_param)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_cfg_t__bindgen_ty_4 {
    pub keep_alive_interval: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pjsip_cfg_t__bindgen_ty_4() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_cfg_t__bindgen_ty_4>(),
        8usize,
        concat!("Size of: ", stringify!(pjsip_cfg_t__bindgen_ty_4))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_cfg_t__bindgen_ty_4>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_cfg_t__bindgen_ty_4))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_cfg_t__bindgen_ty_4>())).keep_alive_interval as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cfg_t__bindgen_ty_4),
            "::",
            stringify!(keep_alive_interval)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_cfg_t__bindgen_ty_5 {
    pub keep_alive_interval: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pjsip_cfg_t__bindgen_ty_5() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_cfg_t__bindgen_ty_5>(),
        8usize,
        concat!("Size of: ", stringify!(pjsip_cfg_t__bindgen_ty_5))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_cfg_t__bindgen_ty_5>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_cfg_t__bindgen_ty_5))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_cfg_t__bindgen_ty_5>())).keep_alive_interval as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cfg_t__bindgen_ty_5),
            "::",
            stringify!(keep_alive_interval)
        )
    );
}
#[test]
fn bindgen_test_layout_pjsip_cfg_t() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_cfg_t>(),
        96usize,
        concat!("Size of: ", stringify!(pjsip_cfg_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_cfg_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_cfg_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_cfg_t>())).endpt as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cfg_t),
            "::",
            stringify!(endpt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_cfg_t>())).tsx as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cfg_t),
            "::",
            stringify!(tsx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_cfg_t>())).regc as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cfg_t),
            "::",
            stringify!(regc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_cfg_t>())).tcp as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cfg_t),
            "::",
            stringify!(tcp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_cfg_t>())).tls as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cfg_t),
            "::",
            stringify!(tls)
        )
    );
}
extern "C" {
    pub static mut pjsip_sip_cfg_var: pjsip_cfg_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_tpmgr {
    _unused: [u8; 0],
}
pub const pjsip_transport_type_e_PJSIP_TRANSPORT_UNSPECIFIED: pjsip_transport_type_e = 0;
pub const pjsip_transport_type_e_PJSIP_TRANSPORT_UDP: pjsip_transport_type_e = 1;
pub const pjsip_transport_type_e_PJSIP_TRANSPORT_TCP: pjsip_transport_type_e = 2;
pub const pjsip_transport_type_e_PJSIP_TRANSPORT_TLS: pjsip_transport_type_e = 3;
pub const pjsip_transport_type_e_PJSIP_TRANSPORT_DTLS: pjsip_transport_type_e = 4;
pub const pjsip_transport_type_e_PJSIP_TRANSPORT_SCTP: pjsip_transport_type_e = 5;
pub const pjsip_transport_type_e_PJSIP_TRANSPORT_LOOP: pjsip_transport_type_e = 6;
pub const pjsip_transport_type_e_PJSIP_TRANSPORT_LOOP_DGRAM: pjsip_transport_type_e = 7;
pub const pjsip_transport_type_e_PJSIP_TRANSPORT_START_OTHER: pjsip_transport_type_e = 8;
pub const pjsip_transport_type_e_PJSIP_TRANSPORT_IPV6: pjsip_transport_type_e = 128;
pub const pjsip_transport_type_e_PJSIP_TRANSPORT_UDP6: pjsip_transport_type_e = 129;
pub const pjsip_transport_type_e_PJSIP_TRANSPORT_TCP6: pjsip_transport_type_e = 130;
pub const pjsip_transport_type_e_PJSIP_TRANSPORT_TLS6: pjsip_transport_type_e = 131;
pub const pjsip_transport_type_e_PJSIP_TRANSPORT_DTLS6: pjsip_transport_type_e = 132;
pub type pjsip_transport_type_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_endpoint {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_resolver_t {
    _unused: [u8; 0],
}
pub type pjsip_user_agent = pjsip_module;
pub const pjsip_role_e_PJSIP_ROLE_UAC: pjsip_role_e = 0;
pub const pjsip_role_e_PJSIP_ROLE_UAS: pjsip_role_e = 1;
pub const pjsip_role_e_PJSIP_UAC_ROLE: pjsip_role_e = 0;
pub const pjsip_role_e_PJSIP_UAS_ROLE: pjsip_role_e = 1;
pub type pjsip_role_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_buffer {
    pub start: *mut ::std::os::raw::c_char,
    pub cur: *mut ::std::os::raw::c_char,
    pub end: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_pjsip_buffer() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_buffer>(),
        24usize,
        concat!("Size of: ", stringify!(pjsip_buffer))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_buffer>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_buffer))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_buffer>())).start as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_buffer),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_buffer>())).cur as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_buffer),
            "::",
            stringify!(cur)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_buffer>())).end as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_buffer),
            "::",
            stringify!(end)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_host_port {
    pub host: pj_str_t,
    pub port: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pjsip_host_port() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_host_port>(),
        24usize,
        concat!("Size of: ", stringify!(pjsip_host_port))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_host_port>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_host_port))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_host_port>())).host as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_host_port),
            "::",
            stringify!(host)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_host_port>())).port as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_host_port),
            "::",
            stringify!(port)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_host_info {
    pub flag: ::std::os::raw::c_uint,
    pub type_: pjsip_transport_type_e,
    pub addr: pjsip_host_port,
}
#[test]
fn bindgen_test_layout_pjsip_host_info() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_host_info>(),
        32usize,
        concat!("Size of: ", stringify!(pjsip_host_info))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_host_info>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_host_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_host_info>())).flag as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_host_info),
            "::",
            stringify!(flag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_host_info>())).type_ as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_host_info),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_host_info>())).addr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_host_info),
            "::",
            stringify!(addr)
        )
    );
}
extern "C" {
    pub fn pjsip_exception_to_status(exception_id: ::std::os::raw::c_int) -> pj_status_t;
}
pub type pj_os_err_type = ::std::os::raw::c_int;
pub type va_list = __builtin_va_list;
extern "C" {
    pub fn pj_get_os_error() -> pj_status_t;
}
extern "C" {
    pub fn pj_set_os_error(code: pj_status_t);
}
extern "C" {
    pub fn pj_get_netos_error() -> pj_status_t;
}
extern "C" {
    pub fn pj_set_netos_error(code: pj_status_t);
}
extern "C" {
    pub fn pj_strerror(
        statcode: pj_status_t,
        buf: *mut ::std::os::raw::c_char,
        bufsize: pj_size_t,
    ) -> pj_str_t;
}
extern "C" {
    pub fn pj_perror(
        log_level: ::std::os::raw::c_int,
        sender: *const ::std::os::raw::c_char,
        status: pj_status_t,
        title_fmt: *const ::std::os::raw::c_char,
        ...
    );
}
pub type pj_error_callback = ::std::option::Option<
    unsafe extern "C" fn(
        e: pj_status_t,
        msg: *mut ::std::os::raw::c_char,
        max: pj_size_t,
    ) -> pj_str_t,
>;
extern "C" {
    pub fn pj_register_strerror(
        start_code: pj_status_t,
        err_space: pj_status_t,
        f: pj_error_callback,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_errno_clear_handlers();
}
extern "C" {
    pub fn pj_perror_1(
        sender: *const ::std::os::raw::c_char,
        status: pj_status_t,
        title_fmt: *const ::std::os::raw::c_char,
        ...
    );
}
extern "C" {
    pub fn pj_perror_2(
        sender: *const ::std::os::raw::c_char,
        status: pj_status_t,
        title_fmt: *const ::std::os::raw::c_char,
        ...
    );
}
extern "C" {
    pub fn pj_perror_3(
        sender: *const ::std::os::raw::c_char,
        status: pj_status_t,
        title_fmt: *const ::std::os::raw::c_char,
        ...
    );
}
extern "C" {
    pub fn pj_perror_4(
        sender: *const ::std::os::raw::c_char,
        status: pj_status_t,
        title_fmt: *const ::std::os::raw::c_char,
        ...
    );
}
extern "C" {
    pub fn pj_perror_5(
        sender: *const ::std::os::raw::c_char,
        status: pj_status_t,
        title_fmt: *const ::std::os::raw::c_char,
        ...
    );
}
extern "C" {
    pub fn pjsip_strerror(
        status: pj_status_t,
        buffer: *mut ::std::os::raw::c_char,
        bufsize: pj_size_t,
    ) -> pj_str_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_list {
    pub prev: *mut ::std::os::raw::c_void,
    pub next: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_pj_list() {
    assert_eq!(
        ::std::mem::size_of::<pj_list>(),
        16usize,
        concat!("Size of: ", stringify!(pj_list))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_list>(),
        8usize,
        concat!("Alignment of ", stringify!(pj_list))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_list>())).prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_list),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_list>())).next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_list),
            "::",
            stringify!(next)
        )
    );
}
extern "C" {
    pub fn pj_list_insert_before(pos: *mut pj_list_type, node: *mut pj_list_type);
}
extern "C" {
    pub fn pj_list_insert_nodes_before(lst: *mut pj_list_type, nodes: *mut pj_list_type);
}
extern "C" {
    pub fn pj_list_insert_after(pos: *mut pj_list_type, node: *mut pj_list_type);
}
extern "C" {
    pub fn pj_list_insert_nodes_after(lst: *mut pj_list_type, nodes: *mut pj_list_type);
}
extern "C" {
    pub fn pj_list_merge_first(list1: *mut pj_list_type, list2: *mut pj_list_type);
}
extern "C" {
    pub fn pj_list_merge_last(list1: *mut pj_list_type, list2: *mut pj_list_type);
}
extern "C" {
    pub fn pj_list_erase(node: *mut pj_list_type);
}
extern "C" {
    pub fn pj_list_find_node(list: *mut pj_list_type, node: *mut pj_list_type)
        -> *mut pj_list_type;
}
extern "C" {
    pub fn pj_list_search(
        list: *mut pj_list_type,
        value: *mut ::std::os::raw::c_void,
        comp: ::std::option::Option<
            unsafe extern "C" fn(
                value: *mut ::std::os::raw::c_void,
                node: *const pj_list_type,
            ) -> ::std::os::raw::c_int,
        >,
    ) -> *mut pj_list_type;
}
extern "C" {
    pub fn pj_list_size(list: *const pj_list_type) -> pj_size_t;
}
extern "C" {
    pub fn pjlib_util_init() -> pj_status_t;
}
pub type pj_cis_elem_t = pj_uint32_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pj_cis_buf_t {
    pub cis_buf: [pj_cis_elem_t; 256usize],
    pub use_mask: pj_cis_elem_t,
}
#[test]
fn bindgen_test_layout_pj_cis_buf_t() {
    assert_eq!(
        ::std::mem::size_of::<pj_cis_buf_t>(),
        1028usize,
        concat!("Size of: ", stringify!(pj_cis_buf_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_cis_buf_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pj_cis_buf_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_cis_buf_t>())).cis_buf as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_cis_buf_t),
            "::",
            stringify!(cis_buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_cis_buf_t>())).use_mask as *const _ as usize },
        1024usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_cis_buf_t),
            "::",
            stringify!(use_mask)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_cis_t {
    pub cis_buf: *mut pj_cis_elem_t,
    pub cis_id: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pj_cis_t() {
    assert_eq!(
        ::std::mem::size_of::<pj_cis_t>(),
        16usize,
        concat!("Size of: ", stringify!(pj_cis_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_cis_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pj_cis_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_cis_t>())).cis_buf as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_cis_t),
            "::",
            stringify!(cis_buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_cis_t>())).cis_id as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_cis_t),
            "::",
            stringify!(cis_id)
        )
    );
}
extern "C" {
    pub fn pj_cis_buf_init(cs_buf: *mut pj_cis_buf_t);
}
extern "C" {
    pub fn pj_cis_init(cs_buf: *mut pj_cis_buf_t, cis: *mut pj_cis_t) -> pj_status_t;
}
extern "C" {
    pub fn pj_cis_dup(new_cis: *mut pj_cis_t, existing: *mut pj_cis_t) -> pj_status_t;
}
extern "C" {
    pub fn pj_cis_add_range(
        cis: *mut pj_cis_t,
        cstart: ::std::os::raw::c_int,
        cend: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn pj_cis_add_alpha(cis: *mut pj_cis_t);
}
extern "C" {
    pub fn pj_cis_add_num(cis: *mut pj_cis_t);
}
extern "C" {
    pub fn pj_cis_add_str(cis: *mut pj_cis_t, str_: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn pj_cis_add_cis(cis: *mut pj_cis_t, rhs: *const pj_cis_t);
}
extern "C" {
    pub fn pj_cis_del_range(
        cis: *mut pj_cis_t,
        cstart: ::std::os::raw::c_int,
        cend: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn pj_cis_del_str(cis: *mut pj_cis_t, str_: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn pj_cis_invert(cis: *mut pj_cis_t);
}
pub const PJ_SCAN_AUTOSKIP_WS: ::std::os::raw::c_uint = 1;
pub const PJ_SCAN_AUTOSKIP_WS_HEADER: ::std::os::raw::c_uint = 3;
pub const PJ_SCAN_AUTOSKIP_NEWLINE: ::std::os::raw::c_uint = 4;
pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
pub type pj_syn_err_func_ptr =
    ::std::option::Option<unsafe extern "C" fn(scanner: *mut pj_scanner)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_scanner {
    pub begin: *mut ::std::os::raw::c_char,
    pub end: *mut ::std::os::raw::c_char,
    pub curptr: *mut ::std::os::raw::c_char,
    pub line: ::std::os::raw::c_int,
    pub start_line: *mut ::std::os::raw::c_char,
    pub skip_ws: ::std::os::raw::c_int,
    pub callback: pj_syn_err_func_ptr,
}
#[test]
fn bindgen_test_layout_pj_scanner() {
    assert_eq!(
        ::std::mem::size_of::<pj_scanner>(),
        56usize,
        concat!("Size of: ", stringify!(pj_scanner))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_scanner>(),
        8usize,
        concat!("Alignment of ", stringify!(pj_scanner))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_scanner>())).begin as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_scanner),
            "::",
            stringify!(begin)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_scanner>())).end as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_scanner),
            "::",
            stringify!(end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_scanner>())).curptr as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_scanner),
            "::",
            stringify!(curptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_scanner>())).line as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_scanner),
            "::",
            stringify!(line)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_scanner>())).start_line as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_scanner),
            "::",
            stringify!(start_line)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_scanner>())).skip_ws as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_scanner),
            "::",
            stringify!(skip_ws)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_scanner>())).callback as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_scanner),
            "::",
            stringify!(callback)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_scan_state {
    pub curptr: *mut ::std::os::raw::c_char,
    pub line: ::std::os::raw::c_int,
    pub start_line: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_pj_scan_state() {
    assert_eq!(
        ::std::mem::size_of::<pj_scan_state>(),
        24usize,
        concat!("Size of: ", stringify!(pj_scan_state))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_scan_state>(),
        8usize,
        concat!("Alignment of ", stringify!(pj_scan_state))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_scan_state>())).curptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_scan_state),
            "::",
            stringify!(curptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_scan_state>())).line as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_scan_state),
            "::",
            stringify!(line)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_scan_state>())).start_line as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_scan_state),
            "::",
            stringify!(start_line)
        )
    );
}
extern "C" {
    pub fn pj_scan_init(
        scanner: *mut pj_scanner,
        bufstart: *mut ::std::os::raw::c_char,
        buflen: pj_size_t,
        options: ::std::os::raw::c_uint,
        callback: pj_syn_err_func_ptr,
    );
}
extern "C" {
    pub fn pj_scan_fini(scanner: *mut pj_scanner);
}
extern "C" {
    pub fn pj_scan_peek(
        scanner: *mut pj_scanner,
        spec: *const pj_cis_t,
        out: *mut pj_str_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pj_scan_peek_n(
        scanner: *mut pj_scanner,
        len: pj_size_t,
        out: *mut pj_str_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pj_scan_peek_until(
        scanner: *mut pj_scanner,
        spec: *const pj_cis_t,
        out: *mut pj_str_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pj_scan_get(scanner: *mut pj_scanner, spec: *const pj_cis_t, out: *mut pj_str_t);
}
extern "C" {
    pub fn pj_scan_get_unescape(
        scanner: *mut pj_scanner,
        spec: *const pj_cis_t,
        out: *mut pj_str_t,
    );
}
extern "C" {
    pub fn pj_scan_get_quote(
        scanner: *mut pj_scanner,
        begin_quote: ::std::os::raw::c_int,
        end_quote: ::std::os::raw::c_int,
        out: *mut pj_str_t,
    );
}
extern "C" {
    pub fn pj_scan_get_quotes(
        scanner: *mut pj_scanner,
        begin_quotes: *const ::std::os::raw::c_char,
        end_quotes: *const ::std::os::raw::c_char,
        qsize: ::std::os::raw::c_int,
        out: *mut pj_str_t,
    );
}
extern "C" {
    pub fn pj_scan_get_n(scanner: *mut pj_scanner, N: ::std::os::raw::c_uint, out: *mut pj_str_t);
}
extern "C" {
    pub fn pj_scan_get_char(scanner: *mut pj_scanner) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pj_scan_get_until(scanner: *mut pj_scanner, spec: *const pj_cis_t, out: *mut pj_str_t);
}
extern "C" {
    pub fn pj_scan_get_until_ch(
        scanner: *mut pj_scanner,
        until_char: ::std::os::raw::c_int,
        out: *mut pj_str_t,
    );
}
extern "C" {
    pub fn pj_scan_get_until_chr(
        scanner: *mut pj_scanner,
        until_spec: *const ::std::os::raw::c_char,
        out: *mut pj_str_t,
    );
}
extern "C" {
    pub fn pj_scan_advance_n(scanner: *mut pj_scanner, N: ::std::os::raw::c_uint, skip: pj_bool_t);
}
extern "C" {
    pub fn pj_scan_strcmp(
        scanner: *mut pj_scanner,
        s: *const ::std::os::raw::c_char,
        len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pj_scan_stricmp(
        scanner: *mut pj_scanner,
        s: *const ::std::os::raw::c_char,
        len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pj_scan_stricmp_alnum(
        scanner: *mut pj_scanner,
        s: *const ::std::os::raw::c_char,
        len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pj_scan_get_newline(scanner: *mut pj_scanner);
}
extern "C" {
    pub fn pj_scan_skip_whitespace(scanner: *mut pj_scanner);
}
extern "C" {
    pub fn pj_scan_skip_line(scanner: *mut pj_scanner);
}
extern "C" {
    pub fn pj_scan_save_state(scanner: *const pj_scanner, state: *mut pj_scan_state);
}
extern "C" {
    pub fn pj_scan_restore_state(scanner: *mut pj_scanner, state: *mut pj_scan_state);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_param {
    pub prev: *mut pjsip_param,
    pub next: *mut pjsip_param,
    pub name: pj_str_t,
    pub value: pj_str_t,
}
#[test]
fn bindgen_test_layout_pjsip_param() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_param>(),
        48usize,
        concat!("Size of: ", stringify!(pjsip_param))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_param>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_param))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_param>())).prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_param),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_param>())).next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_param),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_param>())).name as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_param),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_param>())).value as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_param),
            "::",
            stringify!(value)
        )
    );
}
extern "C" {
    pub fn pjsip_param_find(
        param_list: *const pjsip_param,
        name: *const pj_str_t,
    ) -> *mut pjsip_param;
}
extern "C" {
    pub fn pjsip_param_cmp(
        param_list1: *const pjsip_param,
        param_list2: *const pjsip_param,
        ig_nf: pj_bool_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pjsip_param_clone(
        pool: *mut pj_pool_t,
        dst_list: *mut pjsip_param,
        src_list: *const pjsip_param,
    );
}
extern "C" {
    pub fn pjsip_param_shallow_clone(
        pool: *mut pj_pool_t,
        dst_list: *mut pjsip_param,
        src_list: *const pjsip_param,
    );
}
extern "C" {
    pub fn pjsip_param_print_on(
        param_list: *const pjsip_param,
        buf: *mut ::std::os::raw::c_char,
        size: pj_size_t,
        pname_unres: *const pj_cis_t,
        pvalue_unres: *const pj_cis_t,
        sep: ::std::os::raw::c_int,
    ) -> pj_ssize_t;
}
pub const pjsip_uri_context_e_PJSIP_URI_IN_REQ_URI: pjsip_uri_context_e = 0;
pub const pjsip_uri_context_e_PJSIP_URI_IN_FROMTO_HDR: pjsip_uri_context_e = 1;
pub const pjsip_uri_context_e_PJSIP_URI_IN_CONTACT_HDR: pjsip_uri_context_e = 2;
pub const pjsip_uri_context_e_PJSIP_URI_IN_ROUTING_HDR: pjsip_uri_context_e = 3;
pub const pjsip_uri_context_e_PJSIP_URI_IN_OTHER: pjsip_uri_context_e = 4;
pub type pjsip_uri_context_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_uri_vptr {
    pub p_get_scheme: ::std::option::Option<
        unsafe extern "C" fn(uri: *const ::std::os::raw::c_void) -> *const pj_str_t,
    >,
    pub p_get_uri: ::std::option::Option<
        unsafe extern "C" fn(uri: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void,
    >,
    pub p_print: ::std::option::Option<
        unsafe extern "C" fn(
            context: pjsip_uri_context_e,
            uri: *const ::std::os::raw::c_void,
            buf: *mut ::std::os::raw::c_char,
            size: pj_size_t,
        ) -> pj_ssize_t,
    >,
    pub p_compare: ::std::option::Option<
        unsafe extern "C" fn(
            context: pjsip_uri_context_e,
            uri1: *const ::std::os::raw::c_void,
            uri2: *const ::std::os::raw::c_void,
        ) -> pj_status_t,
    >,
    pub p_clone: ::std::option::Option<
        unsafe extern "C" fn(
            pool: *mut pj_pool_t,
            uri: *const ::std::os::raw::c_void,
        ) -> *mut ::std::os::raw::c_void,
    >,
}
#[test]
fn bindgen_test_layout_pjsip_uri_vptr() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_uri_vptr>(),
        40usize,
        concat!("Size of: ", stringify!(pjsip_uri_vptr))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_uri_vptr>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_uri_vptr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_uri_vptr>())).p_get_scheme as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_uri_vptr),
            "::",
            stringify!(p_get_scheme)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_uri_vptr>())).p_get_uri as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_uri_vptr),
            "::",
            stringify!(p_get_uri)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_uri_vptr>())).p_print as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_uri_vptr),
            "::",
            stringify!(p_print)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_uri_vptr>())).p_compare as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_uri_vptr),
            "::",
            stringify!(p_compare)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_uri_vptr>())).p_clone as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_uri_vptr),
            "::",
            stringify!(p_clone)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_uri {
    pub vptr: *mut pjsip_uri_vptr,
}
#[test]
fn bindgen_test_layout_pjsip_uri() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_uri>(),
        8usize,
        concat!("Size of: ", stringify!(pjsip_uri))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_uri>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_uri))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_uri>())).vptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_uri),
            "::",
            stringify!(vptr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_sip_uri {
    pub vptr: *mut pjsip_uri_vptr,
    pub user: pj_str_t,
    pub passwd: pj_str_t,
    pub host: pj_str_t,
    pub port: ::std::os::raw::c_int,
    pub user_param: pj_str_t,
    pub method_param: pj_str_t,
    pub transport_param: pj_str_t,
    pub ttl_param: ::std::os::raw::c_int,
    pub lr_param: ::std::os::raw::c_int,
    pub maddr_param: pj_str_t,
    pub other_param: pjsip_param,
    pub header_param: pjsip_param,
}
#[test]
fn bindgen_test_layout_pjsip_sip_uri() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_sip_uri>(),
        232usize,
        concat!("Size of: ", stringify!(pjsip_sip_uri))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_sip_uri>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_sip_uri))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_sip_uri>())).vptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_sip_uri),
            "::",
            stringify!(vptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_sip_uri>())).user as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_sip_uri),
            "::",
            stringify!(user)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_sip_uri>())).passwd as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_sip_uri),
            "::",
            stringify!(passwd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_sip_uri>())).host as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_sip_uri),
            "::",
            stringify!(host)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_sip_uri>())).port as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_sip_uri),
            "::",
            stringify!(port)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_sip_uri>())).user_param as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_sip_uri),
            "::",
            stringify!(user_param)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_sip_uri>())).method_param as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_sip_uri),
            "::",
            stringify!(method_param)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_sip_uri>())).transport_param as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_sip_uri),
            "::",
            stringify!(transport_param)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_sip_uri>())).ttl_param as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_sip_uri),
            "::",
            stringify!(ttl_param)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_sip_uri>())).lr_param as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_sip_uri),
            "::",
            stringify!(lr_param)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_sip_uri>())).maddr_param as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_sip_uri),
            "::",
            stringify!(maddr_param)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_sip_uri>())).other_param as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_sip_uri),
            "::",
            stringify!(other_param)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_sip_uri>())).header_param as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_sip_uri),
            "::",
            stringify!(header_param)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_name_addr {
    pub vptr: *mut pjsip_uri_vptr,
    pub display: pj_str_t,
    pub uri: *mut pjsip_uri,
}
#[test]
fn bindgen_test_layout_pjsip_name_addr() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_name_addr>(),
        32usize,
        concat!("Size of: ", stringify!(pjsip_name_addr))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_name_addr>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_name_addr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_name_addr>())).vptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_name_addr),
            "::",
            stringify!(vptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_name_addr>())).display as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_name_addr),
            "::",
            stringify!(display)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_name_addr>())).uri as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_name_addr),
            "::",
            stringify!(uri)
        )
    );
}
extern "C" {
    pub fn pjsip_sip_uri_create(pool: *mut pj_pool_t, secure: pj_bool_t) -> *mut pjsip_sip_uri;
}
extern "C" {
    pub fn pjsip_sip_uri_set_secure(uri: *mut pjsip_sip_uri, secure: pj_bool_t);
}
extern "C" {
    pub fn pjsip_sip_uri_init(url: *mut pjsip_sip_uri, secure: pj_bool_t);
}
extern "C" {
    pub fn pjsip_sip_uri_assign(
        pool: *mut pj_pool_t,
        url: *mut pjsip_sip_uri,
        rhs: *const pjsip_sip_uri,
    );
}
extern "C" {
    pub fn pjsip_name_addr_create(pool: *mut pj_pool_t) -> *mut pjsip_name_addr;
}
extern "C" {
    pub fn pjsip_name_addr_init(name_addr: *mut pjsip_name_addr);
}
extern "C" {
    pub fn pjsip_name_addr_assign(
        pool: *mut pj_pool_t,
        addr: *mut pjsip_name_addr,
        rhs: *const pjsip_name_addr,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_other_uri {
    pub vptr: *mut pjsip_uri_vptr,
    pub scheme: pj_str_t,
    pub content: pj_str_t,
}
#[test]
fn bindgen_test_layout_pjsip_other_uri() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_other_uri>(),
        40usize,
        concat!("Size of: ", stringify!(pjsip_other_uri))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_other_uri>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_other_uri))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_other_uri>())).vptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_other_uri),
            "::",
            stringify!(vptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_other_uri>())).scheme as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_other_uri),
            "::",
            stringify!(scheme)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_other_uri>())).content as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_other_uri),
            "::",
            stringify!(content)
        )
    );
}
extern "C" {
    pub fn pjsip_other_uri_create(pool: *mut pj_pool_t) -> *mut pjsip_other_uri;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_tel_uri {
    pub vptr: *mut pjsip_uri_vptr,
    pub number: pj_str_t,
    pub context: pj_str_t,
    pub ext_param: pj_str_t,
    pub isub_param: pj_str_t,
    pub other_param: pjsip_param,
}
#[test]
fn bindgen_test_layout_pjsip_tel_uri() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_tel_uri>(),
        120usize,
        concat!("Size of: ", stringify!(pjsip_tel_uri))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_tel_uri>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_tel_uri))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_tel_uri>())).vptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_tel_uri),
            "::",
            stringify!(vptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_tel_uri>())).number as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_tel_uri),
            "::",
            stringify!(number)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_tel_uri>())).context as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_tel_uri),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_tel_uri>())).ext_param as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_tel_uri),
            "::",
            stringify!(ext_param)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_tel_uri>())).isub_param as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_tel_uri),
            "::",
            stringify!(isub_param)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_tel_uri>())).other_param as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_tel_uri),
            "::",
            stringify!(other_param)
        )
    );
}
extern "C" {
    pub fn pjsip_tel_uri_create(pool: *mut pj_pool_t) -> *mut pjsip_tel_uri;
}
extern "C" {
    pub fn pjsip_tel_nb_cmp(nb1: *const pj_str_t, nb2: *const pj_str_t) -> ::std::os::raw::c_int;
}
pub const pjsip_method_e_PJSIP_INVITE_METHOD: pjsip_method_e = 0;
pub const pjsip_method_e_PJSIP_CANCEL_METHOD: pjsip_method_e = 1;
pub const pjsip_method_e_PJSIP_ACK_METHOD: pjsip_method_e = 2;
pub const pjsip_method_e_PJSIP_BYE_METHOD: pjsip_method_e = 3;
pub const pjsip_method_e_PJSIP_REGISTER_METHOD: pjsip_method_e = 4;
pub const pjsip_method_e_PJSIP_OPTIONS_METHOD: pjsip_method_e = 5;
pub const pjsip_method_e_PJSIP_OTHER_METHOD: pjsip_method_e = 6;
pub type pjsip_method_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_method {
    pub id: pjsip_method_e,
    pub name: pj_str_t,
}
#[test]
fn bindgen_test_layout_pjsip_method() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_method>(),
        24usize,
        concat!("Size of: ", stringify!(pjsip_method))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_method>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_method))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_method>())).id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_method),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_method>())).name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_method),
            "::",
            stringify!(name)
        )
    );
}
extern "C" {
    pub static pjsip_invite_method: pjsip_method;
}
extern "C" {
    pub static pjsip_cancel_method: pjsip_method;
}
extern "C" {
    pub static pjsip_ack_method: pjsip_method;
}
extern "C" {
    pub static pjsip_bye_method: pjsip_method;
}
extern "C" {
    pub static pjsip_register_method: pjsip_method;
}
extern "C" {
    pub static pjsip_options_method: pjsip_method;
}
extern "C" {
    pub fn pjsip_get_invite_method() -> *const pjsip_method;
}
extern "C" {
    pub fn pjsip_get_cancel_method() -> *const pjsip_method;
}
extern "C" {
    pub fn pjsip_get_ack_method() -> *const pjsip_method;
}
extern "C" {
    pub fn pjsip_get_bye_method() -> *const pjsip_method;
}
extern "C" {
    pub fn pjsip_get_register_method() -> *const pjsip_method;
}
extern "C" {
    pub fn pjsip_get_options_method() -> *const pjsip_method;
}
extern "C" {
    pub fn pjsip_method_init(m: *mut pjsip_method, pool: *mut pj_pool_t, str_: *const pj_str_t);
}
extern "C" {
    pub fn pjsip_method_init_np(m: *mut pjsip_method, str_: *mut pj_str_t);
}
extern "C" {
    pub fn pjsip_method_set(m: *mut pjsip_method, id: pjsip_method_e);
}
extern "C" {
    pub fn pjsip_method_copy(
        pool: *mut pj_pool_t,
        method: *mut pjsip_method,
        rhs: *const pjsip_method,
    );
}
extern "C" {
    pub fn pjsip_method_cmp(
        m1: *const pjsip_method,
        m2: *const pjsip_method,
    ) -> ::std::os::raw::c_int;
}
pub const pjsip_hdr_e_PJSIP_H_ACCEPT: pjsip_hdr_e = 0;
pub const pjsip_hdr_e_PJSIP_H_ACCEPT_ENCODING_UNIMP: pjsip_hdr_e = 1;
pub const pjsip_hdr_e_PJSIP_H_ACCEPT_LANGUAGE_UNIMP: pjsip_hdr_e = 2;
pub const pjsip_hdr_e_PJSIP_H_ALERT_INFO_UNIMP: pjsip_hdr_e = 3;
pub const pjsip_hdr_e_PJSIP_H_ALLOW: pjsip_hdr_e = 4;
pub const pjsip_hdr_e_PJSIP_H_AUTHENTICATION_INFO_UNIMP: pjsip_hdr_e = 5;
pub const pjsip_hdr_e_PJSIP_H_AUTHORIZATION: pjsip_hdr_e = 6;
pub const pjsip_hdr_e_PJSIP_H_CALL_ID: pjsip_hdr_e = 7;
pub const pjsip_hdr_e_PJSIP_H_CALL_INFO_UNIMP: pjsip_hdr_e = 8;
pub const pjsip_hdr_e_PJSIP_H_CONTACT: pjsip_hdr_e = 9;
pub const pjsip_hdr_e_PJSIP_H_CONTENT_DISPOSITION_UNIMP: pjsip_hdr_e = 10;
pub const pjsip_hdr_e_PJSIP_H_CONTENT_ENCODING_UNIMP: pjsip_hdr_e = 11;
pub const pjsip_hdr_e_PJSIP_H_CONTENT_LANGUAGE_UNIMP: pjsip_hdr_e = 12;
pub const pjsip_hdr_e_PJSIP_H_CONTENT_LENGTH: pjsip_hdr_e = 13;
pub const pjsip_hdr_e_PJSIP_H_CONTENT_TYPE: pjsip_hdr_e = 14;
pub const pjsip_hdr_e_PJSIP_H_CSEQ: pjsip_hdr_e = 15;
pub const pjsip_hdr_e_PJSIP_H_DATE_UNIMP: pjsip_hdr_e = 16;
pub const pjsip_hdr_e_PJSIP_H_ERROR_INFO_UNIMP: pjsip_hdr_e = 17;
pub const pjsip_hdr_e_PJSIP_H_EXPIRES: pjsip_hdr_e = 18;
pub const pjsip_hdr_e_PJSIP_H_FROM: pjsip_hdr_e = 19;
pub const pjsip_hdr_e_PJSIP_H_IN_REPLY_TO_UNIMP: pjsip_hdr_e = 20;
pub const pjsip_hdr_e_PJSIP_H_MAX_FORWARDS: pjsip_hdr_e = 21;
pub const pjsip_hdr_e_PJSIP_H_MIME_VERSION_UNIMP: pjsip_hdr_e = 22;
pub const pjsip_hdr_e_PJSIP_H_MIN_EXPIRES: pjsip_hdr_e = 23;
pub const pjsip_hdr_e_PJSIP_H_ORGANIZATION_UNIMP: pjsip_hdr_e = 24;
pub const pjsip_hdr_e_PJSIP_H_PRIORITY_UNIMP: pjsip_hdr_e = 25;
pub const pjsip_hdr_e_PJSIP_H_PROXY_AUTHENTICATE: pjsip_hdr_e = 26;
pub const pjsip_hdr_e_PJSIP_H_PROXY_AUTHORIZATION: pjsip_hdr_e = 27;
pub const pjsip_hdr_e_PJSIP_H_PROXY_REQUIRE_UNIMP: pjsip_hdr_e = 28;
pub const pjsip_hdr_e_PJSIP_H_RECORD_ROUTE: pjsip_hdr_e = 29;
pub const pjsip_hdr_e_PJSIP_H_REPLY_TO_UNIMP: pjsip_hdr_e = 30;
pub const pjsip_hdr_e_PJSIP_H_REQUIRE: pjsip_hdr_e = 31;
pub const pjsip_hdr_e_PJSIP_H_RETRY_AFTER: pjsip_hdr_e = 32;
pub const pjsip_hdr_e_PJSIP_H_ROUTE: pjsip_hdr_e = 33;
pub const pjsip_hdr_e_PJSIP_H_SERVER_UNIMP: pjsip_hdr_e = 34;
pub const pjsip_hdr_e_PJSIP_H_SUBJECT_UNIMP: pjsip_hdr_e = 35;
pub const pjsip_hdr_e_PJSIP_H_SUPPORTED: pjsip_hdr_e = 36;
pub const pjsip_hdr_e_PJSIP_H_TIMESTAMP_UNIMP: pjsip_hdr_e = 37;
pub const pjsip_hdr_e_PJSIP_H_TO: pjsip_hdr_e = 38;
pub const pjsip_hdr_e_PJSIP_H_UNSUPPORTED: pjsip_hdr_e = 39;
pub const pjsip_hdr_e_PJSIP_H_USER_AGENT_UNIMP: pjsip_hdr_e = 40;
pub const pjsip_hdr_e_PJSIP_H_VIA: pjsip_hdr_e = 41;
pub const pjsip_hdr_e_PJSIP_H_WARNING_UNIMP: pjsip_hdr_e = 42;
pub const pjsip_hdr_e_PJSIP_H_WWW_AUTHENTICATE: pjsip_hdr_e = 43;
pub const pjsip_hdr_e_PJSIP_H_OTHER: pjsip_hdr_e = 44;
pub type pjsip_hdr_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_hdr_vptr {
    pub clone: ::std::option::Option<
        unsafe extern "C" fn(
            pool: *mut pj_pool_t,
            hdr: *const ::std::os::raw::c_void,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub shallow_clone: ::std::option::Option<
        unsafe extern "C" fn(
            pool: *mut pj_pool_t,
            hdr: *const ::std::os::raw::c_void,
        ) -> *mut ::std::os::raw::c_void,
    >,
    pub print_on: ::std::option::Option<
        unsafe extern "C" fn(
            hdr: *mut ::std::os::raw::c_void,
            buf: *mut ::std::os::raw::c_char,
            len: pj_size_t,
        ) -> ::std::os::raw::c_int,
    >,
}
#[test]
fn bindgen_test_layout_pjsip_hdr_vptr() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_hdr_vptr>(),
        24usize,
        concat!("Size of: ", stringify!(pjsip_hdr_vptr))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_hdr_vptr>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_hdr_vptr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_hdr_vptr>())).clone as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_hdr_vptr),
            "::",
            stringify!(clone)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_hdr_vptr>())).shallow_clone as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_hdr_vptr),
            "::",
            stringify!(shallow_clone)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_hdr_vptr>())).print_on as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_hdr_vptr),
            "::",
            stringify!(print_on)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_hdr {
    pub prev: *mut pjsip_hdr,
    pub next: *mut pjsip_hdr,
    pub type_: pjsip_hdr_e,
    pub name: pj_str_t,
    pub sname: pj_str_t,
    pub vptr: *mut pjsip_hdr_vptr,
}
#[test]
fn bindgen_test_layout_pjsip_hdr() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_hdr>(),
        64usize,
        concat!("Size of: ", stringify!(pjsip_hdr))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_hdr>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_hdr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_hdr>())).prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_hdr),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_hdr>())).next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_hdr),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_hdr>())).type_ as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_hdr),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_hdr>())).name as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_hdr),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_hdr>())).sname as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_hdr),
            "::",
            stringify!(sname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_hdr>())).vptr as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_hdr),
            "::",
            stringify!(vptr)
        )
    );
}
extern "C" {
    pub fn pjsip_hdr_clone(
        pool: *mut pj_pool_t,
        hdr: *const ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn pjsip_hdr_shallow_clone(
        pool: *mut pj_pool_t,
        hdr: *const ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn pjsip_hdr_print_on(
        hdr: *mut ::std::os::raw::c_void,
        buf: *mut ::std::os::raw::c_char,
        len: pj_size_t,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_request_line {
    pub method: pjsip_method,
    pub uri: *mut pjsip_uri,
}
#[test]
fn bindgen_test_layout_pjsip_request_line() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_request_line>(),
        32usize,
        concat!("Size of: ", stringify!(pjsip_request_line))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_request_line>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_request_line))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_request_line>())).method as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_request_line),
            "::",
            stringify!(method)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_request_line>())).uri as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_request_line),
            "::",
            stringify!(uri)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_status_line {
    pub code: ::std::os::raw::c_int,
    pub reason: pj_str_t,
}
#[test]
fn bindgen_test_layout_pjsip_status_line() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_status_line>(),
        24usize,
        concat!("Size of: ", stringify!(pjsip_status_line))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_status_line>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_status_line))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_status_line>())).code as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_status_line),
            "::",
            stringify!(code)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_status_line>())).reason as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_status_line),
            "::",
            stringify!(reason)
        )
    );
}
pub const pjsip_status_code_PJSIP_SC_NULL: pjsip_status_code = 0;
pub const pjsip_status_code_PJSIP_SC_TRYING: pjsip_status_code = 100;
pub const pjsip_status_code_PJSIP_SC_RINGING: pjsip_status_code = 180;
pub const pjsip_status_code_PJSIP_SC_CALL_BEING_FORWARDED: pjsip_status_code = 181;
pub const pjsip_status_code_PJSIP_SC_QUEUED: pjsip_status_code = 182;
pub const pjsip_status_code_PJSIP_SC_PROGRESS: pjsip_status_code = 183;
pub const pjsip_status_code_PJSIP_SC_EARLY_DIALOG_TERMINATED: pjsip_status_code = 199;
pub const pjsip_status_code_PJSIP_SC_OK: pjsip_status_code = 200;
pub const pjsip_status_code_PJSIP_SC_ACCEPTED: pjsip_status_code = 202;
pub const pjsip_status_code_PJSIP_SC_NO_NOTIFICATION: pjsip_status_code = 204;
pub const pjsip_status_code_PJSIP_SC_MULTIPLE_CHOICES: pjsip_status_code = 300;
pub const pjsip_status_code_PJSIP_SC_MOVED_PERMANENTLY: pjsip_status_code = 301;
pub const pjsip_status_code_PJSIP_SC_MOVED_TEMPORARILY: pjsip_status_code = 302;
pub const pjsip_status_code_PJSIP_SC_USE_PROXY: pjsip_status_code = 305;
pub const pjsip_status_code_PJSIP_SC_ALTERNATIVE_SERVICE: pjsip_status_code = 380;
pub const pjsip_status_code_PJSIP_SC_BAD_REQUEST: pjsip_status_code = 400;
pub const pjsip_status_code_PJSIP_SC_UNAUTHORIZED: pjsip_status_code = 401;
pub const pjsip_status_code_PJSIP_SC_PAYMENT_REQUIRED: pjsip_status_code = 402;
pub const pjsip_status_code_PJSIP_SC_FORBIDDEN: pjsip_status_code = 403;
pub const pjsip_status_code_PJSIP_SC_NOT_FOUND: pjsip_status_code = 404;
pub const pjsip_status_code_PJSIP_SC_METHOD_NOT_ALLOWED: pjsip_status_code = 405;
pub const pjsip_status_code_PJSIP_SC_NOT_ACCEPTABLE: pjsip_status_code = 406;
pub const pjsip_status_code_PJSIP_SC_PROXY_AUTHENTICATION_REQUIRED: pjsip_status_code = 407;
pub const pjsip_status_code_PJSIP_SC_REQUEST_TIMEOUT: pjsip_status_code = 408;
pub const pjsip_status_code_PJSIP_SC_CONFLICT: pjsip_status_code = 409;
pub const pjsip_status_code_PJSIP_SC_GONE: pjsip_status_code = 410;
pub const pjsip_status_code_PJSIP_SC_LENGTH_REQUIRED: pjsip_status_code = 411;
pub const pjsip_status_code_PJSIP_SC_CONDITIONAL_REQUEST_FAILED: pjsip_status_code = 412;
pub const pjsip_status_code_PJSIP_SC_REQUEST_ENTITY_TOO_LARGE: pjsip_status_code = 413;
pub const pjsip_status_code_PJSIP_SC_REQUEST_URI_TOO_LONG: pjsip_status_code = 414;
pub const pjsip_status_code_PJSIP_SC_UNSUPPORTED_MEDIA_TYPE: pjsip_status_code = 415;
pub const pjsip_status_code_PJSIP_SC_UNSUPPORTED_URI_SCHEME: pjsip_status_code = 416;
pub const pjsip_status_code_PJSIP_SC_UNKNOWN_RESOURCE_PRIORITY: pjsip_status_code = 417;
pub const pjsip_status_code_PJSIP_SC_BAD_EXTENSION: pjsip_status_code = 420;
pub const pjsip_status_code_PJSIP_SC_EXTENSION_REQUIRED: pjsip_status_code = 421;
pub const pjsip_status_code_PJSIP_SC_SESSION_TIMER_TOO_SMALL: pjsip_status_code = 422;
pub const pjsip_status_code_PJSIP_SC_INTERVAL_TOO_BRIEF: pjsip_status_code = 423;
pub const pjsip_status_code_PJSIP_SC_BAD_LOCATION_INFORMATION: pjsip_status_code = 424;
pub const pjsip_status_code_PJSIP_SC_USE_IDENTITY_HEADER: pjsip_status_code = 428;
pub const pjsip_status_code_PJSIP_SC_PROVIDE_REFERRER_HEADER: pjsip_status_code = 429;
pub const pjsip_status_code_PJSIP_SC_FLOW_FAILED: pjsip_status_code = 430;
pub const pjsip_status_code_PJSIP_SC_ANONIMITY_DISALLOWED: pjsip_status_code = 433;
pub const pjsip_status_code_PJSIP_SC_BAD_IDENTITY_INFO: pjsip_status_code = 436;
pub const pjsip_status_code_PJSIP_SC_UNSUPPORTED_CERTIFICATE: pjsip_status_code = 437;
pub const pjsip_status_code_PJSIP_SC_INVALID_IDENTITY_HEADER: pjsip_status_code = 438;
pub const pjsip_status_code_PJSIP_SC_FIRST_HOP_LACKS_OUTBOUND_SUPPORT: pjsip_status_code = 439;
pub const pjsip_status_code_PJSIP_SC_MAX_BREADTH_EXCEEDED: pjsip_status_code = 440;
pub const pjsip_status_code_PJSIP_SC_BAD_INFO_PACKAGE: pjsip_status_code = 469;
pub const pjsip_status_code_PJSIP_SC_CONSENT_NEEDED: pjsip_status_code = 470;
pub const pjsip_status_code_PJSIP_SC_TEMPORARILY_UNAVAILABLE: pjsip_status_code = 480;
pub const pjsip_status_code_PJSIP_SC_CALL_TSX_DOES_NOT_EXIST: pjsip_status_code = 481;
pub const pjsip_status_code_PJSIP_SC_LOOP_DETECTED: pjsip_status_code = 482;
pub const pjsip_status_code_PJSIP_SC_TOO_MANY_HOPS: pjsip_status_code = 483;
pub const pjsip_status_code_PJSIP_SC_ADDRESS_INCOMPLETE: pjsip_status_code = 484;
pub const pjsip_status_code_PJSIP_AC_AMBIGUOUS: pjsip_status_code = 485;
pub const pjsip_status_code_PJSIP_SC_BUSY_HERE: pjsip_status_code = 486;
pub const pjsip_status_code_PJSIP_SC_REQUEST_TERMINATED: pjsip_status_code = 487;
pub const pjsip_status_code_PJSIP_SC_NOT_ACCEPTABLE_HERE: pjsip_status_code = 488;
pub const pjsip_status_code_PJSIP_SC_BAD_EVENT: pjsip_status_code = 489;
pub const pjsip_status_code_PJSIP_SC_REQUEST_UPDATED: pjsip_status_code = 490;
pub const pjsip_status_code_PJSIP_SC_REQUEST_PENDING: pjsip_status_code = 491;
pub const pjsip_status_code_PJSIP_SC_UNDECIPHERABLE: pjsip_status_code = 493;
pub const pjsip_status_code_PJSIP_SC_SECURITY_AGREEMENT_NEEDED: pjsip_status_code = 494;
pub const pjsip_status_code_PJSIP_SC_INTERNAL_SERVER_ERROR: pjsip_status_code = 500;
pub const pjsip_status_code_PJSIP_SC_NOT_IMPLEMENTED: pjsip_status_code = 501;
pub const pjsip_status_code_PJSIP_SC_BAD_GATEWAY: pjsip_status_code = 502;
pub const pjsip_status_code_PJSIP_SC_SERVICE_UNAVAILABLE: pjsip_status_code = 503;
pub const pjsip_status_code_PJSIP_SC_SERVER_TIMEOUT: pjsip_status_code = 504;
pub const pjsip_status_code_PJSIP_SC_VERSION_NOT_SUPPORTED: pjsip_status_code = 505;
pub const pjsip_status_code_PJSIP_SC_MESSAGE_TOO_LARGE: pjsip_status_code = 513;
pub const pjsip_status_code_PJSIP_SC_PUSH_NOTIFICATION_SERVICE_NOT_SUPPORTED: pjsip_status_code =
    555;
pub const pjsip_status_code_PJSIP_SC_PRECONDITION_FAILURE: pjsip_status_code = 580;
pub const pjsip_status_code_PJSIP_SC_BUSY_EVERYWHERE: pjsip_status_code = 600;
pub const pjsip_status_code_PJSIP_SC_DECLINE: pjsip_status_code = 603;
pub const pjsip_status_code_PJSIP_SC_DOES_NOT_EXIST_ANYWHERE: pjsip_status_code = 604;
pub const pjsip_status_code_PJSIP_SC_NOT_ACCEPTABLE_ANYWHERE: pjsip_status_code = 606;
pub const pjsip_status_code_PJSIP_SC_UNWANTED: pjsip_status_code = 607;
pub const pjsip_status_code_PJSIP_SC_REJECTED: pjsip_status_code = 608;
pub const pjsip_status_code_PJSIP_SC_TSX_TIMEOUT: pjsip_status_code = 408;
pub const pjsip_status_code_PJSIP_SC_TSX_TRANSPORT_ERROR: pjsip_status_code = 503;
pub const pjsip_status_code_PJSIP_SC__force_32bit: pjsip_status_code = 2147483647;
pub type pjsip_status_code = ::std::os::raw::c_uint;
extern "C" {
    pub fn pjsip_get_status_text(status_code: ::std::os::raw::c_int) -> *const pj_str_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_media_type {
    pub type_: pj_str_t,
    pub subtype: pj_str_t,
    pub param: pjsip_param,
}
#[test]
fn bindgen_test_layout_pjsip_media_type() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_media_type>(),
        80usize,
        concat!("Size of: ", stringify!(pjsip_media_type))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_media_type>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_media_type))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_media_type>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_media_type),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_media_type>())).subtype as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_media_type),
            "::",
            stringify!(subtype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_media_type>())).param as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_media_type),
            "::",
            stringify!(param)
        )
    );
}
extern "C" {
    pub fn pjsip_media_type_init(
        mt: *mut pjsip_media_type,
        type_: *mut pj_str_t,
        subtype: *mut pj_str_t,
    );
}
extern "C" {
    pub fn pjsip_media_type_init2(
        mt: *mut pjsip_media_type,
        type_: *mut ::std::os::raw::c_char,
        subtype: *mut ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn pjsip_media_type_cmp(
        mt1: *const pjsip_media_type,
        mt2: *const pjsip_media_type,
        cmp_param: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pjsip_media_type_cp(
        pool: *mut pj_pool_t,
        dst: *mut pjsip_media_type,
        src: *const pjsip_media_type,
    );
}
extern "C" {
    pub fn pjsip_media_type_print(
        buf: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
        mt: *const pjsip_media_type,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_msg_body {
    pub content_type: pjsip_media_type,
    pub data: *mut ::std::os::raw::c_void,
    pub len: ::std::os::raw::c_uint,
    pub print_body: ::std::option::Option<
        unsafe extern "C" fn(
            msg_body: *mut pjsip_msg_body,
            buf: *mut ::std::os::raw::c_char,
            size: pj_size_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub clone_data: ::std::option::Option<
        unsafe extern "C" fn(
            pool: *mut pj_pool_t,
            data: *const ::std::os::raw::c_void,
            len: ::std::os::raw::c_uint,
        ) -> *mut ::std::os::raw::c_void,
    >,
}
#[test]
fn bindgen_test_layout_pjsip_msg_body() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_msg_body>(),
        112usize,
        concat!("Size of: ", stringify!(pjsip_msg_body))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_msg_body>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_msg_body))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_msg_body>())).content_type as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_msg_body),
            "::",
            stringify!(content_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_msg_body>())).data as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_msg_body),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_msg_body>())).len as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_msg_body),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_msg_body>())).print_body as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_msg_body),
            "::",
            stringify!(print_body)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_msg_body>())).clone_data as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_msg_body),
            "::",
            stringify!(clone_data)
        )
    );
}
extern "C" {
    pub fn pjsip_print_text_body(
        msg_body: *mut pjsip_msg_body,
        buf: *mut ::std::os::raw::c_char,
        size: pj_size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pjsip_clone_text_data(
        pool: *mut pj_pool_t,
        data: *const ::std::os::raw::c_void,
        len: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn pjsip_msg_body_copy(
        pool: *mut pj_pool_t,
        dst_body: *mut pjsip_msg_body,
        src_body: *const pjsip_msg_body,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pjsip_msg_body_clone(
        pool: *mut pj_pool_t,
        body: *const pjsip_msg_body,
    ) -> *mut pjsip_msg_body;
}
extern "C" {
    pub fn pjsip_msg_body_create(
        pool: *mut pj_pool_t,
        type_: *const pj_str_t,
        subtype: *const pj_str_t,
        text: *const pj_str_t,
    ) -> *mut pjsip_msg_body;
}
pub const pjsip_msg_type_e_PJSIP_REQUEST_MSG: pjsip_msg_type_e = 0;
pub const pjsip_msg_type_e_PJSIP_RESPONSE_MSG: pjsip_msg_type_e = 1;
pub type pjsip_msg_type_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pjsip_msg {
    pub type_: pjsip_msg_type_e,
    pub line: pjsip_msg__bindgen_ty_1,
    pub hdr: pjsip_hdr,
    pub body: *mut pjsip_msg_body,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pjsip_msg__bindgen_ty_1 {
    pub req: pjsip_request_line,
    pub status: pjsip_status_line,
    _bindgen_union_align: [u64; 4usize],
}
#[test]
fn bindgen_test_layout_pjsip_msg__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_msg__bindgen_ty_1>(),
        32usize,
        concat!("Size of: ", stringify!(pjsip_msg__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_msg__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_msg__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_msg__bindgen_ty_1>())).req as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_msg__bindgen_ty_1),
            "::",
            stringify!(req)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_msg__bindgen_ty_1>())).status as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_msg__bindgen_ty_1),
            "::",
            stringify!(status)
        )
    );
}
#[test]
fn bindgen_test_layout_pjsip_msg() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_msg>(),
        112usize,
        concat!("Size of: ", stringify!(pjsip_msg))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_msg>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_msg))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_msg>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_msg),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_msg>())).line as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_msg),
            "::",
            stringify!(line)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_msg>())).hdr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_msg),
            "::",
            stringify!(hdr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_msg>())).body as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_msg),
            "::",
            stringify!(body)
        )
    );
}
extern "C" {
    pub fn pjsip_msg_create(pool: *mut pj_pool_t, type_: pjsip_msg_type_e) -> *mut pjsip_msg;
}
extern "C" {
    pub fn pjsip_msg_clone(pool: *mut pj_pool_t, msg: *const pjsip_msg) -> *mut pjsip_msg;
}
extern "C" {
    pub fn pjsip_msg_find_hdr(
        msg: *const pjsip_msg,
        type_: pjsip_hdr_e,
        start: *const ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn pjsip_msg_find_hdr_by_name(
        msg: *const pjsip_msg,
        name: *const pj_str_t,
        start: *const ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn pjsip_msg_find_hdr_by_names(
        msg: *const pjsip_msg,
        name: *const pj_str_t,
        sname: *const pj_str_t,
        start: *const ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn pjsip_msg_find_remove_hdr(
        msg: *mut pjsip_msg,
        hdr: pjsip_hdr_e,
        start: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn pjsip_msg_print(
        msg: *const pjsip_msg,
        buf: *mut ::std::os::raw::c_char,
        size: pj_size_t,
    ) -> pj_ssize_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_generic_string_hdr {
    pub prev: *mut pjsip_generic_string_hdr,
    pub next: *mut pjsip_generic_string_hdr,
    pub type_: pjsip_hdr_e,
    pub name: pj_str_t,
    pub sname: pj_str_t,
    pub vptr: *mut pjsip_hdr_vptr,
    pub hvalue: pj_str_t,
}
#[test]
fn bindgen_test_layout_pjsip_generic_string_hdr() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_generic_string_hdr>(),
        80usize,
        concat!("Size of: ", stringify!(pjsip_generic_string_hdr))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_generic_string_hdr>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_generic_string_hdr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_generic_string_hdr>())).prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_generic_string_hdr),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_generic_string_hdr>())).next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_generic_string_hdr),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_generic_string_hdr>())).type_ as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_generic_string_hdr),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_generic_string_hdr>())).name as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_generic_string_hdr),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_generic_string_hdr>())).sname as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_generic_string_hdr),
            "::",
            stringify!(sname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_generic_string_hdr>())).vptr as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_generic_string_hdr),
            "::",
            stringify!(vptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_generic_string_hdr>())).hvalue as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_generic_string_hdr),
            "::",
            stringify!(hvalue)
        )
    );
}
extern "C" {
    pub fn pjsip_generic_string_hdr_create(
        pool: *mut pj_pool_t,
        hname: *const pj_str_t,
        hvalue: *const pj_str_t,
    ) -> *mut pjsip_generic_string_hdr;
}
extern "C" {
    pub fn pjsip_generic_string_hdr_init(
        pool: *mut pj_pool_t,
        mem: *mut ::std::os::raw::c_void,
        hname: *const pj_str_t,
        hvalue: *const pj_str_t,
    ) -> *mut pjsip_generic_string_hdr;
}
extern "C" {
    pub fn pjsip_generic_string_hdr_init2(
        h: *mut pjsip_generic_string_hdr,
        hname: *mut pj_str_t,
        hvalue: *mut pj_str_t,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_generic_int_hdr {
    pub prev: *mut pjsip_generic_int_hdr,
    pub next: *mut pjsip_generic_int_hdr,
    pub type_: pjsip_hdr_e,
    pub name: pj_str_t,
    pub sname: pj_str_t,
    pub vptr: *mut pjsip_hdr_vptr,
    pub ivalue: pj_uint32_t,
}
#[test]
fn bindgen_test_layout_pjsip_generic_int_hdr() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_generic_int_hdr>(),
        72usize,
        concat!("Size of: ", stringify!(pjsip_generic_int_hdr))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_generic_int_hdr>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_generic_int_hdr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_generic_int_hdr>())).prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_generic_int_hdr),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_generic_int_hdr>())).next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_generic_int_hdr),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_generic_int_hdr>())).type_ as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_generic_int_hdr),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_generic_int_hdr>())).name as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_generic_int_hdr),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_generic_int_hdr>())).sname as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_generic_int_hdr),
            "::",
            stringify!(sname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_generic_int_hdr>())).vptr as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_generic_int_hdr),
            "::",
            stringify!(vptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_generic_int_hdr>())).ivalue as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_generic_int_hdr),
            "::",
            stringify!(ivalue)
        )
    );
}
extern "C" {
    pub fn pjsip_generic_int_hdr_create(
        pool: *mut pj_pool_t,
        hname: *const pj_str_t,
        hvalue: ::std::os::raw::c_uint,
    ) -> *mut pjsip_generic_int_hdr;
}
extern "C" {
    pub fn pjsip_generic_int_hdr_init(
        pool: *mut pj_pool_t,
        mem: *mut ::std::os::raw::c_void,
        hname: *const pj_str_t,
        value: ::std::os::raw::c_uint,
    ) -> *mut pjsip_generic_int_hdr;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_generic_array_hdr {
    pub prev: *mut pjsip_generic_array_hdr,
    pub next: *mut pjsip_generic_array_hdr,
    pub type_: pjsip_hdr_e,
    pub name: pj_str_t,
    pub sname: pj_str_t,
    pub vptr: *mut pjsip_hdr_vptr,
    pub count: ::std::os::raw::c_uint,
    pub values: [pj_str_t; 32usize],
}
#[test]
fn bindgen_test_layout_pjsip_generic_array_hdr() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_generic_array_hdr>(),
        584usize,
        concat!("Size of: ", stringify!(pjsip_generic_array_hdr))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_generic_array_hdr>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_generic_array_hdr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_generic_array_hdr>())).prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_generic_array_hdr),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_generic_array_hdr>())).next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_generic_array_hdr),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_generic_array_hdr>())).type_ as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_generic_array_hdr),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_generic_array_hdr>())).name as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_generic_array_hdr),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_generic_array_hdr>())).sname as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_generic_array_hdr),
            "::",
            stringify!(sname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_generic_array_hdr>())).vptr as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_generic_array_hdr),
            "::",
            stringify!(vptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_generic_array_hdr>())).count as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_generic_array_hdr),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_generic_array_hdr>())).values as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_generic_array_hdr),
            "::",
            stringify!(values)
        )
    );
}
extern "C" {
    pub fn pjsip_generic_array_hdr_create(
        pool: *mut pj_pool_t,
        hname: *const pj_str_t,
    ) -> *mut pjsip_generic_array_hdr;
}
extern "C" {
    pub fn pjsip_generic_array_hdr_init(
        pool: *mut pj_pool_t,
        mem: *mut ::std::os::raw::c_void,
        hname: *const pj_str_t,
    ) -> *mut pjsip_generic_array_hdr;
}
pub type pjsip_accept_hdr = pjsip_generic_array_hdr;
extern "C" {
    pub fn pjsip_accept_hdr_create(pool: *mut pj_pool_t) -> *mut pjsip_accept_hdr;
}
extern "C" {
    pub fn pjsip_accept_hdr_init(
        pool: *mut pj_pool_t,
        mem: *mut ::std::os::raw::c_void,
    ) -> *mut pjsip_accept_hdr;
}
pub type pjsip_allow_hdr = pjsip_generic_array_hdr;
extern "C" {
    pub fn pjsip_allow_hdr_create(pool: *mut pj_pool_t) -> *mut pjsip_allow_hdr;
}
extern "C" {
    pub fn pjsip_allow_hdr_init(
        pool: *mut pj_pool_t,
        mem: *mut ::std::os::raw::c_void,
    ) -> *mut pjsip_allow_hdr;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_cid_hdr {
    pub prev: *mut pjsip_cid_hdr,
    pub next: *mut pjsip_cid_hdr,
    pub type_: pjsip_hdr_e,
    pub name: pj_str_t,
    pub sname: pj_str_t,
    pub vptr: *mut pjsip_hdr_vptr,
    pub id: pj_str_t,
}
#[test]
fn bindgen_test_layout_pjsip_cid_hdr() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_cid_hdr>(),
        80usize,
        concat!("Size of: ", stringify!(pjsip_cid_hdr))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_cid_hdr>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_cid_hdr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_cid_hdr>())).prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cid_hdr),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_cid_hdr>())).next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cid_hdr),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_cid_hdr>())).type_ as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cid_hdr),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_cid_hdr>())).name as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cid_hdr),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_cid_hdr>())).sname as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cid_hdr),
            "::",
            stringify!(sname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_cid_hdr>())).vptr as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cid_hdr),
            "::",
            stringify!(vptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_cid_hdr>())).id as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cid_hdr),
            "::",
            stringify!(id)
        )
    );
}
extern "C" {
    pub fn pjsip_cid_hdr_create(pool: *mut pj_pool_t) -> *mut pjsip_cid_hdr;
}
extern "C" {
    pub fn pjsip_cid_hdr_init(
        pool: *mut pj_pool_t,
        mem: *mut ::std::os::raw::c_void,
    ) -> *mut pjsip_cid_hdr;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_clen_hdr {
    pub prev: *mut pjsip_clen_hdr,
    pub next: *mut pjsip_clen_hdr,
    pub type_: pjsip_hdr_e,
    pub name: pj_str_t,
    pub sname: pj_str_t,
    pub vptr: *mut pjsip_hdr_vptr,
    pub len: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pjsip_clen_hdr() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_clen_hdr>(),
        72usize,
        concat!("Size of: ", stringify!(pjsip_clen_hdr))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_clen_hdr>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_clen_hdr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_clen_hdr>())).prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_clen_hdr),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_clen_hdr>())).next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_clen_hdr),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_clen_hdr>())).type_ as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_clen_hdr),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_clen_hdr>())).name as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_clen_hdr),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_clen_hdr>())).sname as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_clen_hdr),
            "::",
            stringify!(sname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_clen_hdr>())).vptr as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_clen_hdr),
            "::",
            stringify!(vptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_clen_hdr>())).len as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_clen_hdr),
            "::",
            stringify!(len)
        )
    );
}
extern "C" {
    pub fn pjsip_clen_hdr_create(pool: *mut pj_pool_t) -> *mut pjsip_clen_hdr;
}
extern "C" {
    pub fn pjsip_clen_hdr_init(
        pool: *mut pj_pool_t,
        mem: *mut ::std::os::raw::c_void,
    ) -> *mut pjsip_clen_hdr;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_cseq_hdr {
    pub prev: *mut pjsip_cseq_hdr,
    pub next: *mut pjsip_cseq_hdr,
    pub type_: pjsip_hdr_e,
    pub name: pj_str_t,
    pub sname: pj_str_t,
    pub vptr: *mut pjsip_hdr_vptr,
    pub cseq: pj_int32_t,
    pub method: pjsip_method,
}
#[test]
fn bindgen_test_layout_pjsip_cseq_hdr() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_cseq_hdr>(),
        96usize,
        concat!("Size of: ", stringify!(pjsip_cseq_hdr))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_cseq_hdr>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_cseq_hdr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_cseq_hdr>())).prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cseq_hdr),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_cseq_hdr>())).next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cseq_hdr),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_cseq_hdr>())).type_ as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cseq_hdr),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_cseq_hdr>())).name as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cseq_hdr),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_cseq_hdr>())).sname as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cseq_hdr),
            "::",
            stringify!(sname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_cseq_hdr>())).vptr as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cseq_hdr),
            "::",
            stringify!(vptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_cseq_hdr>())).cseq as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cseq_hdr),
            "::",
            stringify!(cseq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_cseq_hdr>())).method as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_cseq_hdr),
            "::",
            stringify!(method)
        )
    );
}
extern "C" {
    pub fn pjsip_cseq_hdr_create(pool: *mut pj_pool_t) -> *mut pjsip_cseq_hdr;
}
extern "C" {
    pub fn pjsip_cseq_hdr_init(
        pool: *mut pj_pool_t,
        mem: *mut ::std::os::raw::c_void,
    ) -> *mut pjsip_cseq_hdr;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_contact_hdr {
    pub prev: *mut pjsip_contact_hdr,
    pub next: *mut pjsip_contact_hdr,
    pub type_: pjsip_hdr_e,
    pub name: pj_str_t,
    pub sname: pj_str_t,
    pub vptr: *mut pjsip_hdr_vptr,
    pub star: ::std::os::raw::c_int,
    pub uri: *mut pjsip_uri,
    pub q1000: ::std::os::raw::c_int,
    pub expires: pj_uint32_t,
    pub other_param: pjsip_param,
}
#[test]
fn bindgen_test_layout_pjsip_contact_hdr() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_contact_hdr>(),
        136usize,
        concat!("Size of: ", stringify!(pjsip_contact_hdr))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_contact_hdr>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_contact_hdr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_contact_hdr>())).prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_contact_hdr),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_contact_hdr>())).next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_contact_hdr),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_contact_hdr>())).type_ as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_contact_hdr),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_contact_hdr>())).name as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_contact_hdr),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_contact_hdr>())).sname as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_contact_hdr),
            "::",
            stringify!(sname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_contact_hdr>())).vptr as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_contact_hdr),
            "::",
            stringify!(vptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_contact_hdr>())).star as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_contact_hdr),
            "::",
            stringify!(star)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_contact_hdr>())).uri as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_contact_hdr),
            "::",
            stringify!(uri)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_contact_hdr>())).q1000 as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_contact_hdr),
            "::",
            stringify!(q1000)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_contact_hdr>())).expires as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_contact_hdr),
            "::",
            stringify!(expires)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_contact_hdr>())).other_param as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_contact_hdr),
            "::",
            stringify!(other_param)
        )
    );
}
extern "C" {
    pub fn pjsip_contact_hdr_create(pool: *mut pj_pool_t) -> *mut pjsip_contact_hdr;
}
extern "C" {
    pub fn pjsip_contact_hdr_init(
        pool: *mut pj_pool_t,
        mem: *mut ::std::os::raw::c_void,
    ) -> *mut pjsip_contact_hdr;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_ctype_hdr {
    pub prev: *mut pjsip_ctype_hdr,
    pub next: *mut pjsip_ctype_hdr,
    pub type_: pjsip_hdr_e,
    pub name: pj_str_t,
    pub sname: pj_str_t,
    pub vptr: *mut pjsip_hdr_vptr,
    pub media: pjsip_media_type,
}
#[test]
fn bindgen_test_layout_pjsip_ctype_hdr() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_ctype_hdr>(),
        144usize,
        concat!("Size of: ", stringify!(pjsip_ctype_hdr))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_ctype_hdr>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_ctype_hdr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_ctype_hdr>())).prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_ctype_hdr),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_ctype_hdr>())).next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_ctype_hdr),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_ctype_hdr>())).type_ as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_ctype_hdr),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_ctype_hdr>())).name as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_ctype_hdr),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_ctype_hdr>())).sname as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_ctype_hdr),
            "::",
            stringify!(sname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_ctype_hdr>())).vptr as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_ctype_hdr),
            "::",
            stringify!(vptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_ctype_hdr>())).media as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_ctype_hdr),
            "::",
            stringify!(media)
        )
    );
}
extern "C" {
    pub fn pjsip_ctype_hdr_create(pool: *mut pj_pool_t) -> *mut pjsip_ctype_hdr;
}
extern "C" {
    pub fn pjsip_ctype_hdr_init(
        pool: *mut pj_pool_t,
        mem: *mut ::std::os::raw::c_void,
    ) -> *mut pjsip_ctype_hdr;
}
pub type pjsip_expires_hdr = pjsip_generic_int_hdr;
extern "C" {
    pub fn pjsip_expires_hdr_create(
        pool: *mut pj_pool_t,
        value: ::std::os::raw::c_uint,
    ) -> *mut pjsip_expires_hdr;
}
extern "C" {
    pub fn pjsip_expires_hdr_init(
        pool: *mut pj_pool_t,
        mem: *mut ::std::os::raw::c_void,
        value: ::std::os::raw::c_uint,
    ) -> *mut pjsip_expires_hdr;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_fromto_hdr {
    pub prev: *mut pjsip_fromto_hdr,
    pub next: *mut pjsip_fromto_hdr,
    pub type_: pjsip_hdr_e,
    pub name: pj_str_t,
    pub sname: pj_str_t,
    pub vptr: *mut pjsip_hdr_vptr,
    pub uri: *mut pjsip_uri,
    pub tag: pj_str_t,
    pub other_param: pjsip_param,
}
#[test]
fn bindgen_test_layout_pjsip_fromto_hdr() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_fromto_hdr>(),
        136usize,
        concat!("Size of: ", stringify!(pjsip_fromto_hdr))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_fromto_hdr>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_fromto_hdr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_fromto_hdr>())).prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_fromto_hdr),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_fromto_hdr>())).next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_fromto_hdr),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_fromto_hdr>())).type_ as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_fromto_hdr),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_fromto_hdr>())).name as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_fromto_hdr),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_fromto_hdr>())).sname as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_fromto_hdr),
            "::",
            stringify!(sname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_fromto_hdr>())).vptr as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_fromto_hdr),
            "::",
            stringify!(vptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_fromto_hdr>())).uri as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_fromto_hdr),
            "::",
            stringify!(uri)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_fromto_hdr>())).tag as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_fromto_hdr),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_fromto_hdr>())).other_param as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_fromto_hdr),
            "::",
            stringify!(other_param)
        )
    );
}
pub type pjsip_from_hdr = pjsip_fromto_hdr;
pub type pjsip_to_hdr = pjsip_fromto_hdr;
extern "C" {
    pub fn pjsip_from_hdr_create(pool: *mut pj_pool_t) -> *mut pjsip_from_hdr;
}
extern "C" {
    pub fn pjsip_from_hdr_init(
        pool: *mut pj_pool_t,
        mem: *mut ::std::os::raw::c_void,
    ) -> *mut pjsip_from_hdr;
}
extern "C" {
    pub fn pjsip_to_hdr_create(pool: *mut pj_pool_t) -> *mut pjsip_to_hdr;
}
extern "C" {
    pub fn pjsip_to_hdr_init(
        pool: *mut pj_pool_t,
        mem: *mut ::std::os::raw::c_void,
    ) -> *mut pjsip_to_hdr;
}
extern "C" {
    pub fn pjsip_fromto_hdr_set_from(hdr: *mut pjsip_fromto_hdr) -> *mut pjsip_from_hdr;
}
extern "C" {
    pub fn pjsip_fromto_hdr_set_to(hdr: *mut pjsip_fromto_hdr) -> *mut pjsip_to_hdr;
}
pub type pjsip_max_fwd_hdr = pjsip_generic_int_hdr;
extern "C" {
    pub fn pjsip_max_fwd_hdr_create(
        pool: *mut pj_pool_t,
        value: ::std::os::raw::c_uint,
    ) -> *mut pjsip_max_fwd_hdr;
}
extern "C" {
    pub fn pjsip_max_fwd_hdr_init(
        pool: *mut pj_pool_t,
        mem: *mut ::std::os::raw::c_void,
        value: ::std::os::raw::c_uint,
    ) -> *mut pjsip_max_fwd_hdr;
}
pub type pjsip_min_expires_hdr = pjsip_generic_int_hdr;
extern "C" {
    pub fn pjsip_min_expires_hdr_create(
        pool: *mut pj_pool_t,
        value: ::std::os::raw::c_uint,
    ) -> *mut pjsip_min_expires_hdr;
}
extern "C" {
    pub fn pjsip_min_expires_hdr_init(
        pool: *mut pj_pool_t,
        mem: *mut ::std::os::raw::c_void,
        value: ::std::os::raw::c_uint,
    ) -> *mut pjsip_min_expires_hdr;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_routing_hdr {
    pub prev: *mut pjsip_routing_hdr,
    pub next: *mut pjsip_routing_hdr,
    pub type_: pjsip_hdr_e,
    pub name: pj_str_t,
    pub sname: pj_str_t,
    pub vptr: *mut pjsip_hdr_vptr,
    pub name_addr: pjsip_name_addr,
    pub other_param: pjsip_param,
}
#[test]
fn bindgen_test_layout_pjsip_routing_hdr() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_routing_hdr>(),
        144usize,
        concat!("Size of: ", stringify!(pjsip_routing_hdr))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_routing_hdr>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_routing_hdr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_routing_hdr>())).prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_routing_hdr),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_routing_hdr>())).next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_routing_hdr),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_routing_hdr>())).type_ as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_routing_hdr),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_routing_hdr>())).name as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_routing_hdr),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_routing_hdr>())).sname as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_routing_hdr),
            "::",
            stringify!(sname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_routing_hdr>())).vptr as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_routing_hdr),
            "::",
            stringify!(vptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_routing_hdr>())).name_addr as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_routing_hdr),
            "::",
            stringify!(name_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_routing_hdr>())).other_param as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_routing_hdr),
            "::",
            stringify!(other_param)
        )
    );
}
pub type pjsip_rr_hdr = pjsip_routing_hdr;
pub type pjsip_route_hdr = pjsip_routing_hdr;
extern "C" {
    pub fn pjsip_rr_hdr_create(pool: *mut pj_pool_t) -> *mut pjsip_rr_hdr;
}
extern "C" {
    pub fn pjsip_rr_hdr_init(
        pool: *mut pj_pool_t,
        mem: *mut ::std::os::raw::c_void,
    ) -> *mut pjsip_rr_hdr;
}
extern "C" {
    pub fn pjsip_route_hdr_create(pool: *mut pj_pool_t) -> *mut pjsip_route_hdr;
}
extern "C" {
    pub fn pjsip_route_hdr_init(
        pool: *mut pj_pool_t,
        mem: *mut ::std::os::raw::c_void,
    ) -> *mut pjsip_route_hdr;
}
extern "C" {
    pub fn pjsip_routing_hdr_set_rr(r: *mut pjsip_routing_hdr) -> *mut pjsip_rr_hdr;
}
extern "C" {
    pub fn pjsip_routing_hdr_set_route(r: *mut pjsip_routing_hdr) -> *mut pjsip_route_hdr;
}
pub type pjsip_require_hdr = pjsip_generic_array_hdr;
extern "C" {
    pub fn pjsip_require_hdr_create(pool: *mut pj_pool_t) -> *mut pjsip_require_hdr;
}
extern "C" {
    pub fn pjsip_require_hdr_init(
        pool: *mut pj_pool_t,
        mem: *mut ::std::os::raw::c_void,
    ) -> *mut pjsip_require_hdr;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_retry_after_hdr {
    pub prev: *mut pjsip_retry_after_hdr,
    pub next: *mut pjsip_retry_after_hdr,
    pub type_: pjsip_hdr_e,
    pub name: pj_str_t,
    pub sname: pj_str_t,
    pub vptr: *mut pjsip_hdr_vptr,
    pub ivalue: pj_int32_t,
    pub param: pjsip_param,
    pub comment: pj_str_t,
}
#[test]
fn bindgen_test_layout_pjsip_retry_after_hdr() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_retry_after_hdr>(),
        136usize,
        concat!("Size of: ", stringify!(pjsip_retry_after_hdr))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_retry_after_hdr>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_retry_after_hdr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_retry_after_hdr>())).prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_retry_after_hdr),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_retry_after_hdr>())).next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_retry_after_hdr),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_retry_after_hdr>())).type_ as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_retry_after_hdr),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_retry_after_hdr>())).name as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_retry_after_hdr),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_retry_after_hdr>())).sname as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_retry_after_hdr),
            "::",
            stringify!(sname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_retry_after_hdr>())).vptr as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_retry_after_hdr),
            "::",
            stringify!(vptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_retry_after_hdr>())).ivalue as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_retry_after_hdr),
            "::",
            stringify!(ivalue)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_retry_after_hdr>())).param as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_retry_after_hdr),
            "::",
            stringify!(param)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_retry_after_hdr>())).comment as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_retry_after_hdr),
            "::",
            stringify!(comment)
        )
    );
}
extern "C" {
    pub fn pjsip_retry_after_hdr_create(
        pool: *mut pj_pool_t,
        value: ::std::os::raw::c_int,
    ) -> *mut pjsip_retry_after_hdr;
}
extern "C" {
    pub fn pjsip_retry_after_hdr_init(
        pool: *mut pj_pool_t,
        mem: *mut ::std::os::raw::c_void,
        value: ::std::os::raw::c_int,
    ) -> *mut pjsip_retry_after_hdr;
}
pub type pjsip_supported_hdr = pjsip_generic_array_hdr;
extern "C" {
    pub fn pjsip_supported_hdr_create(pool: *mut pj_pool_t) -> *mut pjsip_supported_hdr;
}
extern "C" {
    pub fn pjsip_supported_hdr_init(
        pool: *mut pj_pool_t,
        mem: *mut ::std::os::raw::c_void,
    ) -> *mut pjsip_supported_hdr;
}
pub type pjsip_unsupported_hdr = pjsip_generic_array_hdr;
extern "C" {
    pub fn pjsip_unsupported_hdr_create(pool: *mut pj_pool_t) -> *mut pjsip_unsupported_hdr;
}
extern "C" {
    pub fn pjsip_unsupported_hdr_init(
        pool: *mut pj_pool_t,
        mem: *mut ::std::os::raw::c_void,
    ) -> *mut pjsip_unsupported_hdr;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_via_hdr {
    pub prev: *mut pjsip_via_hdr,
    pub next: *mut pjsip_via_hdr,
    pub type_: pjsip_hdr_e,
    pub name: pj_str_t,
    pub sname: pj_str_t,
    pub vptr: *mut pjsip_hdr_vptr,
    pub transport: pj_str_t,
    pub sent_by: pjsip_host_port,
    pub ttl_param: ::std::os::raw::c_int,
    pub rport_param: ::std::os::raw::c_int,
    pub maddr_param: pj_str_t,
    pub recvd_param: pj_str_t,
    pub branch_param: pj_str_t,
    pub other_param: pjsip_param,
    pub comment: pj_str_t,
}
#[test]
fn bindgen_test_layout_pjsip_via_hdr() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_via_hdr>(),
        224usize,
        concat!("Size of: ", stringify!(pjsip_via_hdr))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_via_hdr>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_via_hdr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_via_hdr>())).prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_via_hdr),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_via_hdr>())).next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_via_hdr),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_via_hdr>())).type_ as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_via_hdr),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_via_hdr>())).name as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_via_hdr),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_via_hdr>())).sname as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_via_hdr),
            "::",
            stringify!(sname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_via_hdr>())).vptr as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_via_hdr),
            "::",
            stringify!(vptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_via_hdr>())).transport as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_via_hdr),
            "::",
            stringify!(transport)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_via_hdr>())).sent_by as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_via_hdr),
            "::",
            stringify!(sent_by)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_via_hdr>())).ttl_param as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_via_hdr),
            "::",
            stringify!(ttl_param)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_via_hdr>())).rport_param as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_via_hdr),
            "::",
            stringify!(rport_param)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_via_hdr>())).maddr_param as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_via_hdr),
            "::",
            stringify!(maddr_param)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_via_hdr>())).recvd_param as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_via_hdr),
            "::",
            stringify!(recvd_param)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_via_hdr>())).branch_param as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_via_hdr),
            "::",
            stringify!(branch_param)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_via_hdr>())).other_param as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_via_hdr),
            "::",
            stringify!(other_param)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_via_hdr>())).comment as *const _ as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_via_hdr),
            "::",
            stringify!(comment)
        )
    );
}
extern "C" {
    pub fn pjsip_via_hdr_create(pool: *mut pj_pool_t) -> *mut pjsip_via_hdr;
}
extern "C" {
    pub fn pjsip_via_hdr_init(
        pool: *mut pj_pool_t,
        mem: *mut ::std::os::raw::c_void,
    ) -> *mut pjsip_via_hdr;
}
pub type pjsip_warning_hdr = pjsip_generic_string_hdr;
extern "C" {
    pub fn pjsip_warning_hdr_create(
        pool: *mut pj_pool_t,
        code: ::std::os::raw::c_int,
        host: *const pj_str_t,
        text: *const pj_str_t,
    ) -> *mut pjsip_warning_hdr;
}
extern "C" {
    pub fn pjsip_warning_hdr_create_from_status(
        pool: *mut pj_pool_t,
        host: *const pj_str_t,
        status: pj_status_t,
    ) -> *mut pjsip_warning_hdr;
}
pub type pjsip_accept_encoding_hdr = pjsip_generic_string_hdr;
pub type pjsip_accept_lang_hdr = pjsip_generic_string_hdr;
pub type pjsip_alert_info_hdr = pjsip_generic_string_hdr;
pub type pjsip_auth_info_hdr = pjsip_generic_string_hdr;
pub type pjsip_call_info_hdr = pjsip_generic_string_hdr;
pub type pjsip_content_disposition_hdr = pjsip_generic_string_hdr;
pub type pjsip_content_encoding_hdr = pjsip_generic_string_hdr;
pub type pjsip_content_lang_hdr = pjsip_generic_string_hdr;
pub type pjsip_date_hdr = pjsip_generic_string_hdr;
pub type pjsip_err_info_hdr = pjsip_generic_string_hdr;
pub type pjsip_in_reply_to_hdr = pjsip_generic_string_hdr;
pub type pjsip_mime_version_hdr = pjsip_generic_string_hdr;
pub type pjsip_organization_hdr = pjsip_generic_string_hdr;
pub type pjsip_priority_hdr = pjsip_generic_string_hdr;
pub type pjsip_proxy_require_hdr = pjsip_generic_string_hdr;
pub type pjsip_reply_to_hdr = pjsip_generic_string_hdr;
pub type pjsip_server_hdr = pjsip_generic_string_hdr;
pub type pjsip_subject_hdr = pjsip_generic_string_hdr;
pub type pjsip_timestamp_hdr = pjsip_generic_string_hdr;
pub type pjsip_user_agent_hdr = pjsip_generic_string_hdr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_multipart_part {
    pub prev: *mut pjsip_multipart_part,
    pub next: *mut pjsip_multipart_part,
    pub hdr: pjsip_hdr,
    pub body: *mut pjsip_msg_body,
}
#[test]
fn bindgen_test_layout_pjsip_multipart_part() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_multipart_part>(),
        88usize,
        concat!("Size of: ", stringify!(pjsip_multipart_part))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_multipart_part>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_multipart_part))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_multipart_part>())).prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_multipart_part),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_multipart_part>())).next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_multipart_part),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_multipart_part>())).hdr as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_multipart_part),
            "::",
            stringify!(hdr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_multipart_part>())).body as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_multipart_part),
            "::",
            stringify!(body)
        )
    );
}
extern "C" {
    pub fn pjsip_multipart_create(
        pool: *mut pj_pool_t,
        ctype: *const pjsip_media_type,
        boundary: *const pj_str_t,
    ) -> *mut pjsip_msg_body;
}
extern "C" {
    pub fn pjsip_multipart_create_part(pool: *mut pj_pool_t) -> *mut pjsip_multipart_part;
}
extern "C" {
    pub fn pjsip_multipart_clone_part(
        pool: *mut pj_pool_t,
        part: *const pjsip_multipart_part,
    ) -> *mut pjsip_multipart_part;
}
extern "C" {
    pub fn pjsip_multipart_add_part(
        pool: *mut pj_pool_t,
        mp: *mut pjsip_msg_body,
        part: *mut pjsip_multipart_part,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pjsip_multipart_get_first_part(mp: *const pjsip_msg_body) -> *mut pjsip_multipart_part;
}
extern "C" {
    pub fn pjsip_multipart_get_next_part(
        mp: *const pjsip_msg_body,
        part: *mut pjsip_multipart_part,
    ) -> *mut pjsip_multipart_part;
}
extern "C" {
    pub fn pjsip_multipart_find_part(
        mp: *const pjsip_msg_body,
        content_type: *const pjsip_media_type,
        start: *const pjsip_multipart_part,
    ) -> *mut pjsip_multipart_part;
}
extern "C" {
    pub fn pjsip_multipart_parse(
        pool: *mut pj_pool_t,
        buf: *mut ::std::os::raw::c_char,
        len: pj_size_t,
        ctype: *const pjsip_media_type,
        options: ::std::os::raw::c_uint,
    ) -> *mut pjsip_msg_body;
}
extern "C" {
    pub fn pjsip_multipart_get_raw(
        mp: *mut pjsip_msg_body,
        boundary: *mut pj_str_t,
        raw_data: *mut pj_str_t,
    ) -> pj_status_t;
}
pub const PJSIP_PARSE_URI_AS_NAMEADDR: ::std::os::raw::c_uint = 1;
pub const PJSIP_PARSE_URI_IN_FROM_TO_HDR: ::std::os::raw::c_uint = 2;
pub type _bindgen_ty_3 = ::std::os::raw::c_uint;
extern "C" {
    pub static mut PJSIP_SYN_ERR_EXCEPTION: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut PJSIP_EINVAL_ERR_EXCEPTION: ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_parser_err_report {
    pub prev: *mut pjsip_parser_err_report,
    pub next: *mut pjsip_parser_err_report,
    pub except_code: ::std::os::raw::c_int,
    pub line: ::std::os::raw::c_int,
    pub col: ::std::os::raw::c_int,
    pub hname: pj_str_t,
}
#[test]
fn bindgen_test_layout_pjsip_parser_err_report() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_parser_err_report>(),
        48usize,
        concat!("Size of: ", stringify!(pjsip_parser_err_report))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_parser_err_report>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_parser_err_report))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_parser_err_report>())).prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_err_report),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_parser_err_report>())).next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_err_report),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_err_report>())).except_code as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_err_report),
            "::",
            stringify!(except_code)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_parser_err_report>())).line as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_err_report),
            "::",
            stringify!(line)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_parser_err_report>())).col as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_err_report),
            "::",
            stringify!(col)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_parser_err_report>())).hname as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_err_report),
            "::",
            stringify!(hname)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_parse_ctx {
    pub scanner: *mut pj_scanner,
    pub pool: *mut pj_pool_t,
    pub rdata: *mut pjsip_rx_data,
}
#[test]
fn bindgen_test_layout_pjsip_parse_ctx() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_parse_ctx>(),
        24usize,
        concat!("Size of: ", stringify!(pjsip_parse_ctx))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_parse_ctx>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_parse_ctx))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_parse_ctx>())).scanner as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parse_ctx),
            "::",
            stringify!(scanner)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_parse_ctx>())).pool as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parse_ctx),
            "::",
            stringify!(pool)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_parse_ctx>())).rdata as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parse_ctx),
            "::",
            stringify!(rdata)
        )
    );
}
pub type pjsip_parse_hdr_func =
    ::std::option::Option<unsafe extern "C" fn(context: *mut pjsip_parse_ctx) -> *mut pjsip_hdr>;
pub type pjsip_parse_uri_func = ::std::option::Option<
    unsafe extern "C" fn(
        scanner: *mut pj_scanner,
        pool: *mut pj_pool_t,
        parse_params: pj_bool_t,
    ) -> *mut ::std::os::raw::c_void,
>;
extern "C" {
    pub fn pjsip_register_hdr_parser(
        hname: *const ::std::os::raw::c_char,
        hshortname: *const ::std::os::raw::c_char,
        fptr: pjsip_parse_hdr_func,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pjsip_unregister_hdr_parser(
        hname: *const ::std::os::raw::c_char,
        hshortname: *const ::std::os::raw::c_char,
        fptr: pjsip_parse_hdr_func,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pjsip_register_uri_parser(
        scheme: *mut ::std::os::raw::c_char,
        func: pjsip_parse_uri_func,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pjsip_unregister_uri_parser(
        scheme: *const ::std::os::raw::c_char,
        func: pjsip_parse_uri_func,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pjsip_parse_uri(
        pool: *mut pj_pool_t,
        buf: *mut ::std::os::raw::c_char,
        size: pj_size_t,
        options: ::std::os::raw::c_uint,
    ) -> *mut pjsip_uri;
}
extern "C" {
    pub fn pjsip_parse_status_line(
        buf: *mut ::std::os::raw::c_char,
        size: pj_size_t,
        status_line: *mut pjsip_status_line,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pjsip_parse_msg(
        pool: *mut pj_pool_t,
        buf: *mut ::std::os::raw::c_char,
        size: pj_size_t,
        err_list: *mut pjsip_parser_err_report,
    ) -> *mut pjsip_msg;
}
extern "C" {
    pub fn pjsip_parse_rdata(
        buf: *mut ::std::os::raw::c_char,
        size: pj_size_t,
        rdata: *mut pjsip_rx_data,
    ) -> *mut pjsip_msg;
}
extern "C" {
    pub fn pjsip_find_msg(
        buf: *const ::std::os::raw::c_char,
        size: pj_size_t,
        is_datagram: pj_bool_t,
        msg_size: *mut pj_size_t,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pjsip_parse_hdr(
        pool: *mut pj_pool_t,
        hname: *const pj_str_t,
        line: *mut ::std::os::raw::c_char,
        size: pj_size_t,
        parsed_len: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn pjsip_parse_headers(
        pool: *mut pj_pool_t,
        input: *mut ::std::os::raw::c_char,
        size: pj_size_t,
        hlist: *mut pjsip_hdr,
        options: ::std::os::raw::c_uint,
    ) -> pj_status_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_parser_const_t {
    pub pjsip_USER_STR: pj_str_t,
    pub pjsip_METHOD_STR: pj_str_t,
    pub pjsip_TRANSPORT_STR: pj_str_t,
    pub pjsip_MADDR_STR: pj_str_t,
    pub pjsip_LR_STR: pj_str_t,
    pub pjsip_SIP_STR: pj_str_t,
    pub pjsip_SIPS_STR: pj_str_t,
    pub pjsip_TEL_STR: pj_str_t,
    pub pjsip_BRANCH_STR: pj_str_t,
    pub pjsip_TTL_STR: pj_str_t,
    pub pjsip_RECEIVED_STR: pj_str_t,
    pub pjsip_Q_STR: pj_str_t,
    pub pjsip_EXPIRES_STR: pj_str_t,
    pub pjsip_TAG_STR: pj_str_t,
    pub pjsip_RPORT_STR: pj_str_t,
    pub pjsip_HOST_SPEC: pj_cis_t,
    pub pjsip_DIGIT_SPEC: pj_cis_t,
    pub pjsip_ALPHA_SPEC: pj_cis_t,
    pub pjsip_ALNUM_SPEC: pj_cis_t,
    pub pjsip_TOKEN_SPEC: pj_cis_t,
    pub pjsip_TOKEN_SPEC_ESC: pj_cis_t,
    pub pjsip_VIA_PARAM_SPEC: pj_cis_t,
    pub pjsip_VIA_PARAM_SPEC_ESC: pj_cis_t,
    pub pjsip_HEX_SPEC: pj_cis_t,
    pub pjsip_PARAM_CHAR_SPEC: pj_cis_t,
    pub pjsip_PARAM_CHAR_SPEC_ESC: pj_cis_t,
    pub pjsip_HDR_CHAR_SPEC: pj_cis_t,
    pub pjsip_HDR_CHAR_SPEC_ESC: pj_cis_t,
    pub pjsip_PROBE_USER_HOST_SPEC: pj_cis_t,
    pub pjsip_PASSWD_SPEC: pj_cis_t,
    pub pjsip_PASSWD_SPEC_ESC: pj_cis_t,
    pub pjsip_USER_SPEC: pj_cis_t,
    pub pjsip_USER_SPEC_ESC: pj_cis_t,
    pub pjsip_USER_SPEC_LENIENT: pj_cis_t,
    pub pjsip_USER_SPEC_LENIENT_ESC: pj_cis_t,
    pub pjsip_NOT_NEWLINE: pj_cis_t,
    pub pjsip_NOT_COMMA_OR_NEWLINE: pj_cis_t,
    pub pjsip_DISPLAY_SPEC: pj_cis_t,
    pub pjsip_OTHER_URI_CONTENT: pj_cis_t,
}
#[test]
fn bindgen_test_layout_pjsip_parser_const_t() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_parser_const_t>(),
        624usize,
        concat!("Size of: ", stringify!(pjsip_parser_const_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_parser_const_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_parser_const_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_USER_STR as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_USER_STR)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_METHOD_STR as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_METHOD_STR)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_TRANSPORT_STR as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_TRANSPORT_STR)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_MADDR_STR as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_MADDR_STR)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_LR_STR as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_LR_STR)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_SIP_STR as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_SIP_STR)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_SIPS_STR as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_SIPS_STR)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_TEL_STR as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_TEL_STR)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_BRANCH_STR as *const _ as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_BRANCH_STR)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_TTL_STR as *const _ as usize
        },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_TTL_STR)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_RECEIVED_STR as *const _ as usize
        },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_RECEIVED_STR)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_Q_STR as *const _ as usize
        },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_Q_STR)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_EXPIRES_STR as *const _ as usize
        },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_EXPIRES_STR)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_TAG_STR as *const _ as usize
        },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_TAG_STR)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_RPORT_STR as *const _ as usize
        },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_RPORT_STR)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_HOST_SPEC as *const _ as usize
        },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_HOST_SPEC)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_DIGIT_SPEC as *const _ as usize
        },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_DIGIT_SPEC)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_ALPHA_SPEC as *const _ as usize
        },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_ALPHA_SPEC)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_ALNUM_SPEC as *const _ as usize
        },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_ALNUM_SPEC)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_TOKEN_SPEC as *const _ as usize
        },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_TOKEN_SPEC)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_TOKEN_SPEC_ESC as *const _
                as usize
        },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_TOKEN_SPEC_ESC)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_VIA_PARAM_SPEC as *const _
                as usize
        },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_VIA_PARAM_SPEC)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_VIA_PARAM_SPEC_ESC as *const _
                as usize
        },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_VIA_PARAM_SPEC_ESC)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_HEX_SPEC as *const _ as usize
        },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_HEX_SPEC)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_PARAM_CHAR_SPEC as *const _
                as usize
        },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_PARAM_CHAR_SPEC)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_PARAM_CHAR_SPEC_ESC as *const _
                as usize
        },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_PARAM_CHAR_SPEC_ESC)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_HDR_CHAR_SPEC as *const _
                as usize
        },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_HDR_CHAR_SPEC)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_HDR_CHAR_SPEC_ESC as *const _
                as usize
        },
        432usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_HDR_CHAR_SPEC_ESC)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_PROBE_USER_HOST_SPEC as *const _
                as usize
        },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_PROBE_USER_HOST_SPEC)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_PASSWD_SPEC as *const _ as usize
        },
        464usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_PASSWD_SPEC)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_PASSWD_SPEC_ESC as *const _
                as usize
        },
        480usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_PASSWD_SPEC_ESC)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_USER_SPEC as *const _ as usize
        },
        496usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_USER_SPEC)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_USER_SPEC_ESC as *const _
                as usize
        },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_USER_SPEC_ESC)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_USER_SPEC_LENIENT as *const _
                as usize
        },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_USER_SPEC_LENIENT)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_USER_SPEC_LENIENT_ESC as *const _
                as usize
        },
        544usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_USER_SPEC_LENIENT_ESC)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_NOT_NEWLINE as *const _ as usize
        },
        560usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_NOT_NEWLINE)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_NOT_COMMA_OR_NEWLINE as *const _
                as usize
        },
        576usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_NOT_COMMA_OR_NEWLINE)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_DISPLAY_SPEC as *const _ as usize
        },
        592usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_DISPLAY_SPEC)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_parser_const_t>())).pjsip_OTHER_URI_CONTENT as *const _
                as usize
        },
        608usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_parser_const_t),
            "::",
            stringify!(pjsip_OTHER_URI_CONTENT)
        )
    );
}
extern "C" {
    pub fn pjsip_parser_const() -> *const pjsip_parser_const_t;
}
pub const PJSIP_PARSE_REMOVE_QUOTE: ::std::os::raw::c_uint = 1;
pub type _bindgen_ty_4 = ::std::os::raw::c_uint;
extern "C" {
    pub fn pjsip_parse_param_imp(
        scanner: *mut pj_scanner,
        pool: *mut pj_pool_t,
        pname: *mut pj_str_t,
        pvalue: *mut pj_str_t,
        opt: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn pjsip_parse_uri_param_imp(
        scanner: *mut pj_scanner,
        pool: *mut pj_pool_t,
        pname: *mut pj_str_t,
        pvalue: *mut pj_str_t,
        opt: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn pjsip_concat_param_imp(
        param: *mut pj_str_t,
        pool: *mut pj_pool_t,
        pname: *const pj_str_t,
        pvalue: *const pj_str_t,
        sepchar: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn pjsip_parse_end_hdr_imp(scanner: *mut pj_scanner);
}
extern "C" {
    pub fn pjsip_parse_generic_array_hdr_imp(
        hdr: *mut pjsip_generic_array_hdr,
        scanner: *mut pj_scanner,
    );
}
extern "C" {
    pub fn pj_lock_create_simple_mutex(
        pool: *mut pj_pool_t,
        name: *const ::std::os::raw::c_char,
        lock: *mut *mut pj_lock_t,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_lock_create_recursive_mutex(
        pool: *mut pj_pool_t,
        name: *const ::std::os::raw::c_char,
        lock: *mut *mut pj_lock_t,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_lock_create_null_mutex(
        pool: *mut pj_pool_t,
        name: *const ::std::os::raw::c_char,
        lock: *mut *mut pj_lock_t,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_lock_create_semaphore(
        pool: *mut pj_pool_t,
        name: *const ::std::os::raw::c_char,
        initial: ::std::os::raw::c_uint,
        max: ::std::os::raw::c_uint,
        lock: *mut *mut pj_lock_t,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_lock_acquire(lock: *mut pj_lock_t) -> pj_status_t;
}
extern "C" {
    pub fn pj_lock_tryacquire(lock: *mut pj_lock_t) -> pj_status_t;
}
extern "C" {
    pub fn pj_lock_release(lock: *mut pj_lock_t) -> pj_status_t;
}
extern "C" {
    pub fn pj_lock_destroy(lock: *mut pj_lock_t) -> pj_status_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_grp_lock_config {
    pub flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_pj_grp_lock_config() {
    assert_eq!(
        ::std::mem::size_of::<pj_grp_lock_config>(),
        4usize,
        concat!("Size of: ", stringify!(pj_grp_lock_config))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_grp_lock_config>(),
        4usize,
        concat!("Alignment of ", stringify!(pj_grp_lock_config))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_grp_lock_config>())).flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_grp_lock_config),
            "::",
            stringify!(flags)
        )
    );
}
extern "C" {
    pub fn pj_grp_lock_config_default(cfg: *mut pj_grp_lock_config);
}
extern "C" {
    pub fn pj_grp_lock_create(
        pool: *mut pj_pool_t,
        cfg: *const pj_grp_lock_config,
        p_grp_lock: *mut *mut pj_grp_lock_t,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_grp_lock_create_w_handler(
        pool: *mut pj_pool_t,
        cfg: *const pj_grp_lock_config,
        member: *mut ::std::os::raw::c_void,
        handler: ::std::option::Option<unsafe extern "C" fn(member: *mut ::std::os::raw::c_void)>,
        p_grp_lock: *mut *mut pj_grp_lock_t,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_grp_lock_destroy(grp_lock: *mut pj_grp_lock_t) -> pj_status_t;
}
extern "C" {
    pub fn pj_grp_lock_replace(
        old_lock: *mut pj_grp_lock_t,
        new_lock: *mut pj_grp_lock_t,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_grp_lock_acquire(grp_lock: *mut pj_grp_lock_t) -> pj_status_t;
}
extern "C" {
    pub fn pj_grp_lock_tryacquire(grp_lock: *mut pj_grp_lock_t) -> pj_status_t;
}
extern "C" {
    pub fn pj_grp_lock_release(grp_lock: *mut pj_grp_lock_t) -> pj_status_t;
}
extern "C" {
    pub fn pj_grp_lock_add_handler(
        grp_lock: *mut pj_grp_lock_t,
        pool: *mut pj_pool_t,
        member: *mut ::std::os::raw::c_void,
        handler: ::std::option::Option<unsafe extern "C" fn(member: *mut ::std::os::raw::c_void)>,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_grp_lock_del_handler(
        grp_lock: *mut pj_grp_lock_t,
        member: *mut ::std::os::raw::c_void,
        handler: ::std::option::Option<unsafe extern "C" fn(member: *mut ::std::os::raw::c_void)>,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_grp_lock_add_ref(grp_lock: *mut pj_grp_lock_t) -> pj_status_t;
}
extern "C" {
    pub fn pj_grp_lock_dec_ref(grp_lock: *mut pj_grp_lock_t) -> pj_status_t;
}
extern "C" {
    pub fn pj_grp_lock_get_ref(grp_lock: *mut pj_grp_lock_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pj_grp_lock_dump(grp_lock: *mut pj_grp_lock_t);
}
extern "C" {
    pub fn pj_grp_lock_chain_lock(
        grp_lock: *mut pj_grp_lock_t,
        ext_lock: *mut pj_lock_t,
        pos: ::std::os::raw::c_int,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_grp_lock_unchain_lock(
        grp_lock: *mut pj_grp_lock_t,
        ext_lock: *mut pj_lock_t,
    ) -> pj_status_t;
}
pub type pj_timer_id_t = ::std::os::raw::c_int;
pub type pj_timer_heap_callback = ::std::option::Option<
    unsafe extern "C" fn(timer_heap: *mut pj_timer_heap_t, entry: *mut pj_timer_entry),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_timer_entry {
    pub user_data: *mut ::std::os::raw::c_void,
    pub id: ::std::os::raw::c_int,
    pub cb: pj_timer_heap_callback,
    pub _timer_id: pj_timer_id_t,
}
#[test]
fn bindgen_test_layout_pj_timer_entry() {
    assert_eq!(
        ::std::mem::size_of::<pj_timer_entry>(),
        32usize,
        concat!("Size of: ", stringify!(pj_timer_entry))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_timer_entry>(),
        8usize,
        concat!("Alignment of ", stringify!(pj_timer_entry))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_timer_entry>())).user_data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_timer_entry),
            "::",
            stringify!(user_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_timer_entry>())).id as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_timer_entry),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_timer_entry>())).cb as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_timer_entry),
            "::",
            stringify!(cb)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_timer_entry>()))._timer_id as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_timer_entry),
            "::",
            stringify!(_timer_id)
        )
    );
}
extern "C" {
    pub fn pj_timer_heap_mem_size(count: pj_size_t) -> pj_size_t;
}
extern "C" {
    pub fn pj_timer_heap_create(
        pool: *mut pj_pool_t,
        count: pj_size_t,
        ht: *mut *mut pj_timer_heap_t,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_timer_heap_destroy(ht: *mut pj_timer_heap_t);
}
extern "C" {
    pub fn pj_timer_heap_set_lock(
        ht: *mut pj_timer_heap_t,
        lock: *mut pj_lock_t,
        auto_del: pj_bool_t,
    );
}
extern "C" {
    pub fn pj_timer_heap_set_max_timed_out_per_poll(
        ht: *mut pj_timer_heap_t,
        count: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn pj_timer_entry_init(
        entry: *mut pj_timer_entry,
        id: ::std::os::raw::c_int,
        user_data: *mut ::std::os::raw::c_void,
        cb: pj_timer_heap_callback,
    ) -> *mut pj_timer_entry;
}
extern "C" {
    pub fn pj_timer_entry_running(entry: *mut pj_timer_entry) -> pj_bool_t;
}
extern "C" {
    pub fn pj_timer_heap_schedule_dbg(
        ht: *mut pj_timer_heap_t,
        entry: *mut pj_timer_entry,
        delay: *const pj_time_val,
        src_file: *const ::std::os::raw::c_char,
        src_line: ::std::os::raw::c_int,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_timer_heap_schedule_w_grp_lock_dbg(
        ht: *mut pj_timer_heap_t,
        entry: *mut pj_timer_entry,
        delay: *const pj_time_val,
        id_val: ::std::os::raw::c_int,
        grp_lock: *mut pj_grp_lock_t,
        src_file: *const ::std::os::raw::c_char,
        src_line: ::std::os::raw::c_int,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_timer_heap_cancel(
        ht: *mut pj_timer_heap_t,
        entry: *mut pj_timer_entry,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pj_timer_heap_cancel_if_active(
        ht: *mut pj_timer_heap_t,
        entry: *mut pj_timer_entry,
        id_val: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pj_timer_heap_count(ht: *mut pj_timer_heap_t) -> pj_size_t;
}
extern "C" {
    pub fn pj_timer_heap_earliest_time(
        ht: *mut pj_timer_heap_t,
        timeval: *mut pj_time_val,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_timer_heap_poll(
        ht: *mut pj_timer_heap_t,
        next_delay: *mut pj_time_val,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn pj_timer_heap_dump(ht: *mut pj_timer_heap_t);
}
pub const pjsip_event_id_e_PJSIP_EVENT_UNKNOWN: pjsip_event_id_e = 0;
pub const pjsip_event_id_e_PJSIP_EVENT_TIMER: pjsip_event_id_e = 1;
pub const pjsip_event_id_e_PJSIP_EVENT_TX_MSG: pjsip_event_id_e = 2;
pub const pjsip_event_id_e_PJSIP_EVENT_RX_MSG: pjsip_event_id_e = 3;
pub const pjsip_event_id_e_PJSIP_EVENT_TRANSPORT_ERROR: pjsip_event_id_e = 4;
pub const pjsip_event_id_e_PJSIP_EVENT_TSX_STATE: pjsip_event_id_e = 5;
pub const pjsip_event_id_e_PJSIP_EVENT_USER: pjsip_event_id_e = 6;
pub type pjsip_event_id_e = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pjsip_event {
    pub prev: *mut pjsip_event,
    pub next: *mut pjsip_event,
    pub type_: pjsip_event_id_e,
    pub body: pjsip_event__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pjsip_event__bindgen_ty_1 {
    pub timer: pjsip_event__bindgen_ty_1__bindgen_ty_1,
    pub tsx_state: pjsip_event__bindgen_ty_1__bindgen_ty_2,
    pub tx_msg: pjsip_event__bindgen_ty_1__bindgen_ty_3,
    pub tx_error: pjsip_event__bindgen_ty_1__bindgen_ty_4,
    pub rx_msg: pjsip_event__bindgen_ty_1__bindgen_ty_5,
    pub user: pjsip_event__bindgen_ty_1__bindgen_ty_6,
    _bindgen_union_align: [u64; 4usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_event__bindgen_ty_1__bindgen_ty_1 {
    pub entry: *mut pj_timer_entry,
}
#[test]
fn bindgen_test_layout_pjsip_event__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_event__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(pjsip_event__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_event__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(pjsip_event__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_event__bindgen_ty_1__bindgen_ty_1>())).entry as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_event__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(entry)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pjsip_event__bindgen_ty_1__bindgen_ty_2 {
    pub src: pjsip_event__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1,
    pub tsx: *mut pjsip_transaction,
    pub prev_state: ::std::os::raw::c_int,
    pub type_: pjsip_event_id_e,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pjsip_event__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1 {
    pub rdata: *mut pjsip_rx_data,
    pub tdata: *mut pjsip_tx_data,
    pub timer: *mut pj_timer_entry,
    pub status: pj_status_t,
    pub data: *mut ::std::os::raw::c_void,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_pjsip_event__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_event__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(pjsip_event__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_event__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(pjsip_event__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_event__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1>())).rdata
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_event__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(rdata)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_event__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1>())).tdata
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_event__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(tdata)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_event__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1>())).timer
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_event__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(timer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_event__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1>())).status
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_event__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_event__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1>())).data
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_event__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(data)
        )
    );
}
#[test]
fn bindgen_test_layout_pjsip_event__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_event__bindgen_ty_1__bindgen_ty_2>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(pjsip_event__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_event__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(pjsip_event__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_event__bindgen_ty_1__bindgen_ty_2>())).src as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_event__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(src)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_event__bindgen_ty_1__bindgen_ty_2>())).tsx as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_event__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(tsx)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_event__bindgen_ty_1__bindgen_ty_2>())).prev_state
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_event__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(prev_state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_event__bindgen_ty_1__bindgen_ty_2>())).type_ as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_event__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(type_)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_event__bindgen_ty_1__bindgen_ty_3 {
    pub tdata: *mut pjsip_tx_data,
}
#[test]
fn bindgen_test_layout_pjsip_event__bindgen_ty_1__bindgen_ty_3() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_event__bindgen_ty_1__bindgen_ty_3>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(pjsip_event__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_event__bindgen_ty_1__bindgen_ty_3>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(pjsip_event__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_event__bindgen_ty_1__bindgen_ty_3>())).tdata as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_event__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(tdata)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_event__bindgen_ty_1__bindgen_ty_4 {
    pub tdata: *mut pjsip_tx_data,
    pub tsx: *mut pjsip_transaction,
}
#[test]
fn bindgen_test_layout_pjsip_event__bindgen_ty_1__bindgen_ty_4() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_event__bindgen_ty_1__bindgen_ty_4>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(pjsip_event__bindgen_ty_1__bindgen_ty_4)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_event__bindgen_ty_1__bindgen_ty_4>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(pjsip_event__bindgen_ty_1__bindgen_ty_4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_event__bindgen_ty_1__bindgen_ty_4>())).tdata as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_event__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(tdata)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_event__bindgen_ty_1__bindgen_ty_4>())).tsx as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_event__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(tsx)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_event__bindgen_ty_1__bindgen_ty_5 {
    pub rdata: *mut pjsip_rx_data,
}
#[test]
fn bindgen_test_layout_pjsip_event__bindgen_ty_1__bindgen_ty_5() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_event__bindgen_ty_1__bindgen_ty_5>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(pjsip_event__bindgen_ty_1__bindgen_ty_5)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_event__bindgen_ty_1__bindgen_ty_5>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(pjsip_event__bindgen_ty_1__bindgen_ty_5)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_event__bindgen_ty_1__bindgen_ty_5>())).rdata as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_event__bindgen_ty_1__bindgen_ty_5),
            "::",
            stringify!(rdata)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_event__bindgen_ty_1__bindgen_ty_6 {
    pub user1: *mut ::std::os::raw::c_void,
    pub user2: *mut ::std::os::raw::c_void,
    pub user3: *mut ::std::os::raw::c_void,
    pub user4: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_pjsip_event__bindgen_ty_1__bindgen_ty_6() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_event__bindgen_ty_1__bindgen_ty_6>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(pjsip_event__bindgen_ty_1__bindgen_ty_6)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_event__bindgen_ty_1__bindgen_ty_6>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(pjsip_event__bindgen_ty_1__bindgen_ty_6)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_event__bindgen_ty_1__bindgen_ty_6>())).user1 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_event__bindgen_ty_1__bindgen_ty_6),
            "::",
            stringify!(user1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_event__bindgen_ty_1__bindgen_ty_6>())).user2 as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_event__bindgen_ty_1__bindgen_ty_6),
            "::",
            stringify!(user2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_event__bindgen_ty_1__bindgen_ty_6>())).user3 as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_event__bindgen_ty_1__bindgen_ty_6),
            "::",
            stringify!(user3)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_event__bindgen_ty_1__bindgen_ty_6>())).user4 as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_event__bindgen_ty_1__bindgen_ty_6),
            "::",
            stringify!(user4)
        )
    );
}
#[test]
fn bindgen_test_layout_pjsip_event__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_event__bindgen_ty_1>(),
        32usize,
        concat!("Size of: ", stringify!(pjsip_event__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_event__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_event__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_event__bindgen_ty_1>())).timer as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_event__bindgen_ty_1),
            "::",
            stringify!(timer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_event__bindgen_ty_1>())).tsx_state as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_event__bindgen_ty_1),
            "::",
            stringify!(tsx_state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_event__bindgen_ty_1>())).tx_msg as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_event__bindgen_ty_1),
            "::",
            stringify!(tx_msg)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_event__bindgen_ty_1>())).tx_error as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_event__bindgen_ty_1),
            "::",
            stringify!(tx_error)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_event__bindgen_ty_1>())).rx_msg as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_event__bindgen_ty_1),
            "::",
            stringify!(rx_msg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_event__bindgen_ty_1>())).user as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_event__bindgen_ty_1),
            "::",
            stringify!(user)
        )
    );
}
#[test]
fn bindgen_test_layout_pjsip_event() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_event>(),
        56usize,
        concat!("Size of: ", stringify!(pjsip_event))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_event>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_event))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_event>())).prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_event),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_event>())).next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_event),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_event>())).type_ as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_event),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_event>())).body as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_event),
            "::",
            stringify!(body)
        )
    );
}
extern "C" {
    pub fn pjsip_event_str(e: pjsip_event_id_e) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_module {
    pub prev: *mut pjsip_module,
    pub next: *mut pjsip_module,
    pub name: pj_str_t,
    pub id: ::std::os::raw::c_int,
    pub priority: ::std::os::raw::c_int,
    pub load:
        ::std::option::Option<unsafe extern "C" fn(endpt: *mut pjsip_endpoint) -> pj_status_t>,
    pub start: ::std::option::Option<unsafe extern "C" fn() -> pj_status_t>,
    pub stop: ::std::option::Option<unsafe extern "C" fn() -> pj_status_t>,
    pub unload: ::std::option::Option<unsafe extern "C" fn() -> pj_status_t>,
    pub on_rx_request:
        ::std::option::Option<unsafe extern "C" fn(rdata: *mut pjsip_rx_data) -> pj_bool_t>,
    pub on_rx_response:
        ::std::option::Option<unsafe extern "C" fn(rdata: *mut pjsip_rx_data) -> pj_bool_t>,
    pub on_tx_request:
        ::std::option::Option<unsafe extern "C" fn(tdata: *mut pjsip_tx_data) -> pj_status_t>,
    pub on_tx_response:
        ::std::option::Option<unsafe extern "C" fn(tdata: *mut pjsip_tx_data) -> pj_status_t>,
    pub on_tsx_state: ::std::option::Option<
        unsafe extern "C" fn(tsx: *mut pjsip_transaction, event: *mut pjsip_event),
    >,
}
#[test]
fn bindgen_test_layout_pjsip_module() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_module>(),
        112usize,
        concat!("Size of: ", stringify!(pjsip_module))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_module>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_module))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_module>())).prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_module),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_module>())).next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_module),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_module>())).name as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_module),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_module>())).id as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_module),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_module>())).priority as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_module),
            "::",
            stringify!(priority)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_module>())).load as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_module),
            "::",
            stringify!(load)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_module>())).start as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_module),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_module>())).stop as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_module),
            "::",
            stringify!(stop)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_module>())).unload as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_module),
            "::",
            stringify!(unload)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_module>())).on_rx_request as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_module),
            "::",
            stringify!(on_rx_request)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_module>())).on_rx_response as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_module),
            "::",
            stringify!(on_rx_response)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_module>())).on_tx_request as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_module),
            "::",
            stringify!(on_tx_request)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_module>())).on_tx_response as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_module),
            "::",
            stringify!(on_tx_response)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_module>())).on_tsx_state as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_module),
            "::",
            stringify!(on_tsx_state)
        )
    );
}
pub const pjsip_module_priority_PJSIP_MOD_PRIORITY_TRANSPORT_LAYER: pjsip_module_priority = 8;
pub const pjsip_module_priority_PJSIP_MOD_PRIORITY_TSX_LAYER: pjsip_module_priority = 16;
pub const pjsip_module_priority_PJSIP_MOD_PRIORITY_UA_PROXY_LAYER: pjsip_module_priority = 32;
pub const pjsip_module_priority_PJSIP_MOD_PRIORITY_DIALOG_USAGE: pjsip_module_priority = 48;
pub const pjsip_module_priority_PJSIP_MOD_PRIORITY_APPLICATION: pjsip_module_priority = 64;
pub type pjsip_module_priority = ::std::os::raw::c_uint;
pub type in_addr_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct in_addr {
    pub s_addr: in_addr_t,
}
#[test]
fn bindgen_test_layout_in_addr() {
    assert_eq!(
        ::std::mem::size_of::<in_addr>(),
        4usize,
        concat!("Size of: ", stringify!(in_addr))
    );
    assert_eq!(
        ::std::mem::align_of::<in_addr>(),
        4usize,
        concat!("Alignment of ", stringify!(in_addr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<in_addr>())).s_addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in_addr),
            "::",
            stringify!(s_addr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct in6_addr {
    pub __in6_u: in6_addr__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union in6_addr__bindgen_ty_1 {
    pub __u6_addr8: [u8; 16usize],
    pub __u6_addr16: [u16; 8usize],
    pub __u6_addr32: [u32; 4usize],
    _bindgen_union_align: [u32; 4usize],
}
#[test]
fn bindgen_test_layout_in6_addr__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<in6_addr__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(in6_addr__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<in6_addr__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(in6_addr__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<in6_addr__bindgen_ty_1>())).__u6_addr8 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr__bindgen_ty_1),
            "::",
            stringify!(__u6_addr8)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<in6_addr__bindgen_ty_1>())).__u6_addr16 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr__bindgen_ty_1),
            "::",
            stringify!(__u6_addr16)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<in6_addr__bindgen_ty_1>())).__u6_addr32 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr__bindgen_ty_1),
            "::",
            stringify!(__u6_addr32)
        )
    );
}
#[test]
fn bindgen_test_layout_in6_addr() {
    assert_eq!(
        ::std::mem::size_of::<in6_addr>(),
        16usize,
        concat!("Size of: ", stringify!(in6_addr))
    );
    assert_eq!(
        ::std::mem::align_of::<in6_addr>(),
        4usize,
        concat!("Alignment of ", stringify!(in6_addr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<in6_addr>())).__in6_u as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr),
            "::",
            stringify!(__in6_u)
        )
    );
}
extern "C" {
    pub static PJ_AF_UNSPEC: pj_uint16_t;
}
extern "C" {
    pub static PJ_AF_UNIX: pj_uint16_t;
}
extern "C" {
    pub static PJ_AF_INET: pj_uint16_t;
}
extern "C" {
    pub static PJ_AF_INET6: pj_uint16_t;
}
extern "C" {
    pub static PJ_AF_PACKET: pj_uint16_t;
}
extern "C" {
    pub static PJ_AF_IRDA: pj_uint16_t;
}
extern "C" {
    pub static PJ_SOCK_STREAM: pj_uint16_t;
}
extern "C" {
    pub static PJ_SOCK_DGRAM: pj_uint16_t;
}
extern "C" {
    pub static PJ_SOCK_RAW: pj_uint16_t;
}
extern "C" {
    pub static PJ_SOCK_RDM: pj_uint16_t;
}
extern "C" {
    pub static PJ_SOL_SOCKET: pj_uint16_t;
}
extern "C" {
    pub static PJ_SOL_IP: pj_uint16_t;
}
extern "C" {
    pub static PJ_SOL_TCP: pj_uint16_t;
}
extern "C" {
    pub static PJ_SOL_UDP: pj_uint16_t;
}
extern "C" {
    pub static PJ_SOL_IPV6: pj_uint16_t;
}
extern "C" {
    pub static PJ_IP_TOS: pj_uint16_t;
}
extern "C" {
    pub static PJ_IPTOS_LOWDELAY: pj_uint16_t;
}
extern "C" {
    pub static PJ_IPTOS_THROUGHPUT: pj_uint16_t;
}
extern "C" {
    pub static PJ_IPTOS_RELIABILITY: pj_uint16_t;
}
extern "C" {
    pub static PJ_IPTOS_MINCOST: pj_uint16_t;
}
extern "C" {
    pub static PJ_IPV6_TCLASS: pj_uint16_t;
}
extern "C" {
    pub static PJ_SO_TYPE: pj_uint16_t;
}
extern "C" {
    pub static PJ_SO_RCVBUF: pj_uint16_t;
}
extern "C" {
    pub static PJ_SO_SNDBUF: pj_uint16_t;
}
extern "C" {
    pub static PJ_TCP_NODELAY: pj_uint16_t;
}
extern "C" {
    pub static PJ_SO_REUSEADDR: pj_uint16_t;
}
extern "C" {
    pub static PJ_SO_NOSIGPIPE: pj_uint16_t;
}
extern "C" {
    pub static PJ_SO_PRIORITY: pj_uint16_t;
}
extern "C" {
    pub static PJ_IP_MULTICAST_IF: pj_uint16_t;
}
extern "C" {
    pub static PJ_IP_MULTICAST_TTL: pj_uint16_t;
}
extern "C" {
    pub static PJ_IP_MULTICAST_LOOP: pj_uint16_t;
}
extern "C" {
    pub static PJ_IP_ADD_MEMBERSHIP: pj_uint16_t;
}
extern "C" {
    pub static PJ_IP_DROP_MEMBERSHIP: pj_uint16_t;
}
extern "C" {
    pub static PJ_MSG_OOB: ::std::os::raw::c_int;
}
extern "C" {
    pub static PJ_MSG_PEEK: ::std::os::raw::c_int;
}
extern "C" {
    pub static PJ_MSG_DONTROUTE: ::std::os::raw::c_int;
}
pub const pj_socket_sd_type_PJ_SD_RECEIVE: pj_socket_sd_type = 0;
pub const pj_socket_sd_type_PJ_SHUT_RD: pj_socket_sd_type = 0;
pub const pj_socket_sd_type_PJ_SD_SEND: pj_socket_sd_type = 1;
pub const pj_socket_sd_type_PJ_SHUT_WR: pj_socket_sd_type = 1;
pub const pj_socket_sd_type_PJ_SD_BOTH: pj_socket_sd_type = 2;
pub const pj_socket_sd_type_PJ_SHUT_RDWR: pj_socket_sd_type = 2;
pub type pj_socket_sd_type = ::std::os::raw::c_uint;
pub type pj_in_addr = in_addr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_sockaddr_in {
    pub sin_family: pj_uint16_t,
    pub sin_port: pj_uint16_t,
    pub sin_addr: pj_in_addr,
    pub sin_zero_pad: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout_pj_sockaddr_in() {
    assert_eq!(
        ::std::mem::size_of::<pj_sockaddr_in>(),
        16usize,
        concat!("Size of: ", stringify!(pj_sockaddr_in))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_sockaddr_in>(),
        4usize,
        concat!("Alignment of ", stringify!(pj_sockaddr_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_sockaddr_in>())).sin_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_sockaddr_in),
            "::",
            stringify!(sin_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_sockaddr_in>())).sin_port as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_sockaddr_in),
            "::",
            stringify!(sin_port)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_sockaddr_in>())).sin_addr as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_sockaddr_in),
            "::",
            stringify!(sin_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_sockaddr_in>())).sin_zero_pad as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_sockaddr_in),
            "::",
            stringify!(sin_zero_pad)
        )
    );
}
pub type pj_in6_addr = in6_addr;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pj_sockaddr_in6 {
    pub sin6_family: pj_uint16_t,
    pub sin6_port: pj_uint16_t,
    pub sin6_flowinfo: pj_uint32_t,
    pub sin6_addr: pj_in6_addr,
    pub sin6_scope_id: pj_uint32_t,
}
#[test]
fn bindgen_test_layout_pj_sockaddr_in6() {
    assert_eq!(
        ::std::mem::size_of::<pj_sockaddr_in6>(),
        28usize,
        concat!("Size of: ", stringify!(pj_sockaddr_in6))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_sockaddr_in6>(),
        4usize,
        concat!("Alignment of ", stringify!(pj_sockaddr_in6))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_sockaddr_in6>())).sin6_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_sockaddr_in6),
            "::",
            stringify!(sin6_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_sockaddr_in6>())).sin6_port as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_sockaddr_in6),
            "::",
            stringify!(sin6_port)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_sockaddr_in6>())).sin6_flowinfo as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_sockaddr_in6),
            "::",
            stringify!(sin6_flowinfo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_sockaddr_in6>())).sin6_addr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_sockaddr_in6),
            "::",
            stringify!(sin6_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_sockaddr_in6>())).sin6_scope_id as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_sockaddr_in6),
            "::",
            stringify!(sin6_scope_id)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_addr_hdr {
    pub sa_family: pj_uint16_t,
}
#[test]
fn bindgen_test_layout_pj_addr_hdr() {
    assert_eq!(
        ::std::mem::size_of::<pj_addr_hdr>(),
        2usize,
        concat!("Size of: ", stringify!(pj_addr_hdr))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_addr_hdr>(),
        2usize,
        concat!("Alignment of ", stringify!(pj_addr_hdr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_addr_hdr>())).sa_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_addr_hdr),
            "::",
            stringify!(sa_family)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pj_sockaddr {
    pub addr: pj_addr_hdr,
    pub ipv4: pj_sockaddr_in,
    pub ipv6: pj_sockaddr_in6,
    _bindgen_union_align: [u32; 7usize],
}
#[test]
fn bindgen_test_layout_pj_sockaddr() {
    assert_eq!(
        ::std::mem::size_of::<pj_sockaddr>(),
        28usize,
        concat!("Size of: ", stringify!(pj_sockaddr))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_sockaddr>(),
        4usize,
        concat!("Alignment of ", stringify!(pj_sockaddr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_sockaddr>())).addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_sockaddr),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_sockaddr>())).ipv4 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_sockaddr),
            "::",
            stringify!(ipv4)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_sockaddr>())).ipv6 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_sockaddr),
            "::",
            stringify!(ipv6)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_ip_mreq {
    pub imr_multiaddr: pj_in_addr,
    pub imr_interface: pj_in_addr,
}
#[test]
fn bindgen_test_layout_pj_ip_mreq() {
    assert_eq!(
        ::std::mem::size_of::<pj_ip_mreq>(),
        8usize,
        concat!("Size of: ", stringify!(pj_ip_mreq))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_ip_mreq>(),
        4usize,
        concat!("Alignment of ", stringify!(pj_ip_mreq))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_ip_mreq>())).imr_multiaddr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_ip_mreq),
            "::",
            stringify!(imr_multiaddr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_ip_mreq>())).imr_interface as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_ip_mreq),
            "::",
            stringify!(imr_interface)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_sockopt_params {
    pub cnt: ::std::os::raw::c_uint,
    pub options: [pj_sockopt_params__bindgen_ty_1; 4usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_sockopt_params__bindgen_ty_1 {
    pub level: ::std::os::raw::c_int,
    pub optname: ::std::os::raw::c_int,
    pub optval: *mut ::std::os::raw::c_void,
    pub optlen: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pj_sockopt_params__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<pj_sockopt_params__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(pj_sockopt_params__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_sockopt_params__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(pj_sockopt_params__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pj_sockopt_params__bindgen_ty_1>())).level as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_sockopt_params__bindgen_ty_1),
            "::",
            stringify!(level)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pj_sockopt_params__bindgen_ty_1>())).optname as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_sockopt_params__bindgen_ty_1),
            "::",
            stringify!(optname)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pj_sockopt_params__bindgen_ty_1>())).optval as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_sockopt_params__bindgen_ty_1),
            "::",
            stringify!(optval)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pj_sockopt_params__bindgen_ty_1>())).optlen as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_sockopt_params__bindgen_ty_1),
            "::",
            stringify!(optlen)
        )
    );
}
#[test]
fn bindgen_test_layout_pj_sockopt_params() {
    assert_eq!(
        ::std::mem::size_of::<pj_sockopt_params>(),
        104usize,
        concat!("Size of: ", stringify!(pj_sockopt_params))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_sockopt_params>(),
        8usize,
        concat!("Alignment of ", stringify!(pj_sockopt_params))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_sockopt_params>())).cnt as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_sockopt_params),
            "::",
            stringify!(cnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_sockopt_params>())).options as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_sockopt_params),
            "::",
            stringify!(options)
        )
    );
}
extern "C" {
    pub fn pj_ntohs(netshort: pj_uint16_t) -> pj_uint16_t;
}
extern "C" {
    pub fn pj_htons(hostshort: pj_uint16_t) -> pj_uint16_t;
}
extern "C" {
    pub fn pj_ntohl(netlong: pj_uint32_t) -> pj_uint32_t;
}
extern "C" {
    pub fn pj_htonl(hostlong: pj_uint32_t) -> pj_uint32_t;
}
extern "C" {
    pub fn pj_inet_ntoa(inaddr: pj_in_addr) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn pj_inet_aton(cp: *const pj_str_t, inp: *mut pj_in_addr) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pj_inet_pton(
        af: ::std::os::raw::c_int,
        src: *const pj_str_t,
        dst: *mut ::std::os::raw::c_void,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_inet_ntop(
        af: ::std::os::raw::c_int,
        src: *const ::std::os::raw::c_void,
        dst: *mut ::std::os::raw::c_char,
        size: ::std::os::raw::c_int,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_inet_ntop2(
        af: ::std::os::raw::c_int,
        src: *const ::std::os::raw::c_void,
        dst: *mut ::std::os::raw::c_char,
        size: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn pj_sockaddr_print(
        addr: *const pj_sockaddr_t,
        buf: *mut ::std::os::raw::c_char,
        size: ::std::os::raw::c_int,
        flags: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn pj_inet_addr(cp: *const pj_str_t) -> pj_in_addr;
}
extern "C" {
    pub fn pj_inet_addr2(cp: *const ::std::os::raw::c_char) -> pj_in_addr;
}
extern "C" {
    pub fn pj_sockaddr_in_init(
        addr: *mut pj_sockaddr_in,
        cp: *const pj_str_t,
        port: pj_uint16_t,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_sockaddr_init(
        af: ::std::os::raw::c_int,
        addr: *mut pj_sockaddr,
        cp: *const pj_str_t,
        port: pj_uint16_t,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_sockaddr_cmp(
        addr1: *const pj_sockaddr_t,
        addr2: *const pj_sockaddr_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pj_sockaddr_get_addr(addr: *const pj_sockaddr_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn pj_sockaddr_has_addr(addr: *const pj_sockaddr_t) -> pj_bool_t;
}
extern "C" {
    pub fn pj_sockaddr_get_addr_len(addr: *const pj_sockaddr_t) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn pj_sockaddr_get_len(addr: *const pj_sockaddr_t) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn pj_sockaddr_copy_addr(dst: *mut pj_sockaddr, src: *const pj_sockaddr);
}
extern "C" {
    pub fn pj_sockaddr_cp(dst: *mut pj_sockaddr_t, src: *const pj_sockaddr_t);
}
extern "C" {
    pub fn pj_sockaddr_synthesize(
        dst_af: ::std::os::raw::c_int,
        dst: *mut pj_sockaddr_t,
        src: *const pj_sockaddr_t,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_sockaddr_in_get_addr(addr: *const pj_sockaddr_in) -> pj_in_addr;
}
extern "C" {
    pub fn pj_sockaddr_in_set_addr(addr: *mut pj_sockaddr_in, hostaddr: pj_uint32_t);
}
extern "C" {
    pub fn pj_sockaddr_in_set_str_addr(
        addr: *mut pj_sockaddr_in,
        cp: *const pj_str_t,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_sockaddr_set_str_addr(
        af: ::std::os::raw::c_int,
        addr: *mut pj_sockaddr,
        cp: *const pj_str_t,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_sockaddr_get_port(addr: *const pj_sockaddr_t) -> pj_uint16_t;
}
extern "C" {
    pub fn pj_sockaddr_in_get_port(addr: *const pj_sockaddr_in) -> pj_uint16_t;
}
extern "C" {
    pub fn pj_sockaddr_set_port(addr: *mut pj_sockaddr, hostport: pj_uint16_t) -> pj_status_t;
}
extern "C" {
    pub fn pj_sockaddr_in_set_port(addr: *mut pj_sockaddr_in, hostport: pj_uint16_t);
}
extern "C" {
    pub fn pj_sockaddr_parse(
        af: ::std::os::raw::c_int,
        options: ::std::os::raw::c_uint,
        str_: *const pj_str_t,
        addr: *mut pj_sockaddr,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_sockaddr_parse2(
        af: ::std::os::raw::c_int,
        options: ::std::os::raw::c_uint,
        str_: *const pj_str_t,
        hostpart: *mut pj_str_t,
        port: *mut pj_uint16_t,
        raf: *mut ::std::os::raw::c_int,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_gethostname() -> *const pj_str_t;
}
extern "C" {
    pub fn pj_gethostaddr() -> pj_in_addr;
}
extern "C" {
    pub fn pj_sock_socket(
        family: ::std::os::raw::c_int,
        type_: ::std::os::raw::c_int,
        protocol: ::std::os::raw::c_int,
        sock: *mut pj_sock_t,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_sock_close(sockfd: pj_sock_t) -> pj_status_t;
}
extern "C" {
    pub fn pj_sock_bind(
        sockfd: pj_sock_t,
        my_addr: *const pj_sockaddr_t,
        addrlen: ::std::os::raw::c_int,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_sock_bind_in(sockfd: pj_sock_t, addr: pj_uint32_t, port: pj_uint16_t) -> pj_status_t;
}
extern "C" {
    pub fn pj_sock_bind_random(
        sockfd: pj_sock_t,
        addr: *const pj_sockaddr_t,
        port_range: pj_uint16_t,
        max_try: pj_uint16_t,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_sock_listen(sockfd: pj_sock_t, backlog: ::std::os::raw::c_int) -> pj_status_t;
}
extern "C" {
    pub fn pj_sock_accept(
        serverfd: pj_sock_t,
        newsock: *mut pj_sock_t,
        addr: *mut pj_sockaddr_t,
        addrlen: *mut ::std::os::raw::c_int,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_sock_connect(
        sockfd: pj_sock_t,
        serv_addr: *const pj_sockaddr_t,
        addrlen: ::std::os::raw::c_int,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_sock_getpeername(
        sockfd: pj_sock_t,
        addr: *mut pj_sockaddr_t,
        namelen: *mut ::std::os::raw::c_int,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_sock_getsockname(
        sockfd: pj_sock_t,
        addr: *mut pj_sockaddr_t,
        namelen: *mut ::std::os::raw::c_int,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_sock_getsockopt(
        sockfd: pj_sock_t,
        level: pj_uint16_t,
        optname: pj_uint16_t,
        optval: *mut ::std::os::raw::c_void,
        optlen: *mut ::std::os::raw::c_int,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_sock_setsockopt(
        sockfd: pj_sock_t,
        level: pj_uint16_t,
        optname: pj_uint16_t,
        optval: *const ::std::os::raw::c_void,
        optlen: ::std::os::raw::c_int,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_sock_setsockopt_params(
        sockfd: pj_sock_t,
        params: *const pj_sockopt_params,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_sock_setsockopt_sobuf(
        sockfd: pj_sock_t,
        optname: pj_uint16_t,
        auto_retry: pj_bool_t,
        buf_size: *mut ::std::os::raw::c_uint,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_sock_recv(
        sockfd: pj_sock_t,
        buf: *mut ::std::os::raw::c_void,
        len: *mut pj_ssize_t,
        flags: ::std::os::raw::c_uint,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_sock_recvfrom(
        sockfd: pj_sock_t,
        buf: *mut ::std::os::raw::c_void,
        len: *mut pj_ssize_t,
        flags: ::std::os::raw::c_uint,
        from: *mut pj_sockaddr_t,
        fromlen: *mut ::std::os::raw::c_int,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_sock_send(
        sockfd: pj_sock_t,
        buf: *const ::std::os::raw::c_void,
        len: *mut pj_ssize_t,
        flags: ::std::os::raw::c_uint,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_sock_sendto(
        sockfd: pj_sock_t,
        buf: *const ::std::os::raw::c_void,
        len: *mut pj_ssize_t,
        flags: ::std::os::raw::c_uint,
        to: *const pj_sockaddr_t,
        tolen: ::std::os::raw::c_int,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_sock_shutdown(sockfd: pj_sock_t, how: ::std::os::raw::c_int) -> pj_status_t;
}
extern "C" {
    pub fn pj_addr_str_print(
        host_str: *const pj_str_t,
        port: ::std::os::raw::c_int,
        buf: *mut ::std::os::raw::c_char,
        size: ::std::os::raw::c_int,
        flag: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_char;
}
pub const PJ_DNS_CLASS_IN: ::std::os::raw::c_uint = 1;
pub type _bindgen_ty_14 = ::std::os::raw::c_uint;
pub const pj_dns_type_PJ_DNS_TYPE_A: pj_dns_type = 1;
pub const pj_dns_type_PJ_DNS_TYPE_NS: pj_dns_type = 2;
pub const pj_dns_type_PJ_DNS_TYPE_MD: pj_dns_type = 3;
pub const pj_dns_type_PJ_DNS_TYPE_MF: pj_dns_type = 4;
pub const pj_dns_type_PJ_DNS_TYPE_CNAME: pj_dns_type = 5;
pub const pj_dns_type_PJ_DNS_TYPE_SOA: pj_dns_type = 6;
pub const pj_dns_type_PJ_DNS_TYPE_MB: pj_dns_type = 7;
pub const pj_dns_type_PJ_DNS_TYPE_MG: pj_dns_type = 8;
pub const pj_dns_type_PJ_DNS_TYPE_MR: pj_dns_type = 9;
pub const pj_dns_type_PJ_DNS_TYPE_NULL: pj_dns_type = 10;
pub const pj_dns_type_PJ_DNS_TYPE_WKS: pj_dns_type = 11;
pub const pj_dns_type_PJ_DNS_TYPE_PTR: pj_dns_type = 12;
pub const pj_dns_type_PJ_DNS_TYPE_HINFO: pj_dns_type = 13;
pub const pj_dns_type_PJ_DNS_TYPE_MINFO: pj_dns_type = 14;
pub const pj_dns_type_PJ_DNS_TYPE_MX: pj_dns_type = 15;
pub const pj_dns_type_PJ_DNS_TYPE_TXT: pj_dns_type = 16;
pub const pj_dns_type_PJ_DNS_TYPE_RP: pj_dns_type = 17;
pub const pj_dns_type_PJ_DNS_TYPE_AFSB: pj_dns_type = 18;
pub const pj_dns_type_PJ_DNS_TYPE_X25: pj_dns_type = 19;
pub const pj_dns_type_PJ_DNS_TYPE_ISDN: pj_dns_type = 20;
pub const pj_dns_type_PJ_DNS_TYPE_RT: pj_dns_type = 21;
pub const pj_dns_type_PJ_DNS_TYPE_NSAP: pj_dns_type = 22;
pub const pj_dns_type_PJ_DNS_TYPE_NSAP_PTR: pj_dns_type = 23;
pub const pj_dns_type_PJ_DNS_TYPE_SIG: pj_dns_type = 24;
pub const pj_dns_type_PJ_DNS_TYPE_KEY: pj_dns_type = 25;
pub const pj_dns_type_PJ_DNS_TYPE_PX: pj_dns_type = 26;
pub const pj_dns_type_PJ_DNS_TYPE_GPOS: pj_dns_type = 27;
pub const pj_dns_type_PJ_DNS_TYPE_AAAA: pj_dns_type = 28;
pub const pj_dns_type_PJ_DNS_TYPE_LOC: pj_dns_type = 29;
pub const pj_dns_type_PJ_DNS_TYPE_NXT: pj_dns_type = 30;
pub const pj_dns_type_PJ_DNS_TYPE_EID: pj_dns_type = 31;
pub const pj_dns_type_PJ_DNS_TYPE_NIMLOC: pj_dns_type = 32;
pub const pj_dns_type_PJ_DNS_TYPE_SRV: pj_dns_type = 33;
pub const pj_dns_type_PJ_DNS_TYPE_ATMA: pj_dns_type = 34;
pub const pj_dns_type_PJ_DNS_TYPE_NAPTR: pj_dns_type = 35;
pub const pj_dns_type_PJ_DNS_TYPE_KX: pj_dns_type = 36;
pub const pj_dns_type_PJ_DNS_TYPE_CERT: pj_dns_type = 37;
pub const pj_dns_type_PJ_DNS_TYPE_A6: pj_dns_type = 38;
pub const pj_dns_type_PJ_DNS_TYPE_DNAME: pj_dns_type = 39;
pub const pj_dns_type_PJ_DNS_TYPE_OPT: pj_dns_type = 41;
pub const pj_dns_type_PJ_DNS_TYPE_APL: pj_dns_type = 42;
pub const pj_dns_type_PJ_DNS_TYPE_DS: pj_dns_type = 43;
pub const pj_dns_type_PJ_DNS_TYPE_SSHFP: pj_dns_type = 44;
pub const pj_dns_type_PJ_DNS_TYPE_IPSECKEY: pj_dns_type = 45;
pub const pj_dns_type_PJ_DNS_TYPE_RRSIG: pj_dns_type = 46;
pub const pj_dns_type_PJ_DNS_TYPE_NSEC: pj_dns_type = 47;
pub const pj_dns_type_PJ_DNS_TYPE_DNSKEY: pj_dns_type = 48;
pub type pj_dns_type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_dns_hdr {
    pub id: pj_uint16_t,
    pub flags: pj_uint16_t,
    pub qdcount: pj_uint16_t,
    pub anscount: pj_uint16_t,
    pub nscount: pj_uint16_t,
    pub arcount: pj_uint16_t,
}
#[test]
fn bindgen_test_layout_pj_dns_hdr() {
    assert_eq!(
        ::std::mem::size_of::<pj_dns_hdr>(),
        12usize,
        concat!("Size of: ", stringify!(pj_dns_hdr))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_dns_hdr>(),
        2usize,
        concat!("Alignment of ", stringify!(pj_dns_hdr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_hdr>())).id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_hdr),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_hdr>())).flags as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_hdr),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_hdr>())).qdcount as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_hdr),
            "::",
            stringify!(qdcount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_hdr>())).anscount as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_hdr),
            "::",
            stringify!(anscount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_hdr>())).nscount as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_hdr),
            "::",
            stringify!(nscount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_hdr>())).arcount as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_hdr),
            "::",
            stringify!(arcount)
        )
    );
}
pub const pj_dns_rcode_PJ_DNS_RCODE_FORMERR: pj_dns_rcode = 1;
pub const pj_dns_rcode_PJ_DNS_RCODE_SERVFAIL: pj_dns_rcode = 2;
pub const pj_dns_rcode_PJ_DNS_RCODE_NXDOMAIN: pj_dns_rcode = 3;
pub const pj_dns_rcode_PJ_DNS_RCODE_NOTIMPL: pj_dns_rcode = 4;
pub const pj_dns_rcode_PJ_DNS_RCODE_REFUSED: pj_dns_rcode = 5;
pub const pj_dns_rcode_PJ_DNS_RCODE_YXDOMAIN: pj_dns_rcode = 6;
pub const pj_dns_rcode_PJ_DNS_RCODE_YXRRSET: pj_dns_rcode = 7;
pub const pj_dns_rcode_PJ_DNS_RCODE_NXRRSET: pj_dns_rcode = 8;
pub const pj_dns_rcode_PJ_DNS_RCODE_NOTAUTH: pj_dns_rcode = 9;
pub const pj_dns_rcode_PJ_DNS_RCODE_NOTZONE: pj_dns_rcode = 10;
pub type pj_dns_rcode = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_dns_parsed_query {
    pub name: pj_str_t,
    pub type_: pj_uint16_t,
    pub dnsclass: pj_uint16_t,
}
#[test]
fn bindgen_test_layout_pj_dns_parsed_query() {
    assert_eq!(
        ::std::mem::size_of::<pj_dns_parsed_query>(),
        24usize,
        concat!("Size of: ", stringify!(pj_dns_parsed_query))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_dns_parsed_query>(),
        8usize,
        concat!("Alignment of ", stringify!(pj_dns_parsed_query))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_parsed_query>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_parsed_query),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_parsed_query>())).type_ as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_parsed_query),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_parsed_query>())).dnsclass as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_parsed_query),
            "::",
            stringify!(dnsclass)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pj_dns_parsed_rr {
    pub name: pj_str_t,
    pub type_: pj_uint16_t,
    pub dnsclass: pj_uint16_t,
    pub ttl: pj_uint32_t,
    pub rdlength: pj_uint16_t,
    pub data: *mut ::std::os::raw::c_void,
    pub rdata: pj_dns_parsed_rr_rdata,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pj_dns_parsed_rr_rdata {
    pub srv: pj_dns_parsed_rr_rdata_srv,
    pub cname: pj_dns_parsed_rr_rdata_cname,
    pub ns: pj_dns_parsed_rr_rdata_ns,
    pub ptr: pj_dns_parsed_rr_rdata_ptr,
    pub a: pj_dns_parsed_rr_rdata_a,
    pub aaaa: pj_dns_parsed_rr_rdata_aaaa,
    _bindgen_union_align: [u64; 3usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_dns_parsed_rr_rdata_srv {
    pub prio: pj_uint16_t,
    pub weight: pj_uint16_t,
    pub port: pj_uint16_t,
    pub target: pj_str_t,
}
#[test]
fn bindgen_test_layout_pj_dns_parsed_rr_rdata_srv() {
    assert_eq!(
        ::std::mem::size_of::<pj_dns_parsed_rr_rdata_srv>(),
        24usize,
        concat!("Size of: ", stringify!(pj_dns_parsed_rr_rdata_srv))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_dns_parsed_rr_rdata_srv>(),
        8usize,
        concat!("Alignment of ", stringify!(pj_dns_parsed_rr_rdata_srv))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_parsed_rr_rdata_srv>())).prio as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_parsed_rr_rdata_srv),
            "::",
            stringify!(prio)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pj_dns_parsed_rr_rdata_srv>())).weight as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_parsed_rr_rdata_srv),
            "::",
            stringify!(weight)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_parsed_rr_rdata_srv>())).port as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_parsed_rr_rdata_srv),
            "::",
            stringify!(port)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pj_dns_parsed_rr_rdata_srv>())).target as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_parsed_rr_rdata_srv),
            "::",
            stringify!(target)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_dns_parsed_rr_rdata_cname {
    pub name: pj_str_t,
}
#[test]
fn bindgen_test_layout_pj_dns_parsed_rr_rdata_cname() {
    assert_eq!(
        ::std::mem::size_of::<pj_dns_parsed_rr_rdata_cname>(),
        16usize,
        concat!("Size of: ", stringify!(pj_dns_parsed_rr_rdata_cname))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_dns_parsed_rr_rdata_cname>(),
        8usize,
        concat!("Alignment of ", stringify!(pj_dns_parsed_rr_rdata_cname))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pj_dns_parsed_rr_rdata_cname>())).name as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_parsed_rr_rdata_cname),
            "::",
            stringify!(name)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_dns_parsed_rr_rdata_ns {
    pub name: pj_str_t,
}
#[test]
fn bindgen_test_layout_pj_dns_parsed_rr_rdata_ns() {
    assert_eq!(
        ::std::mem::size_of::<pj_dns_parsed_rr_rdata_ns>(),
        16usize,
        concat!("Size of: ", stringify!(pj_dns_parsed_rr_rdata_ns))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_dns_parsed_rr_rdata_ns>(),
        8usize,
        concat!("Alignment of ", stringify!(pj_dns_parsed_rr_rdata_ns))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_parsed_rr_rdata_ns>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_parsed_rr_rdata_ns),
            "::",
            stringify!(name)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_dns_parsed_rr_rdata_ptr {
    pub name: pj_str_t,
}
#[test]
fn bindgen_test_layout_pj_dns_parsed_rr_rdata_ptr() {
    assert_eq!(
        ::std::mem::size_of::<pj_dns_parsed_rr_rdata_ptr>(),
        16usize,
        concat!("Size of: ", stringify!(pj_dns_parsed_rr_rdata_ptr))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_dns_parsed_rr_rdata_ptr>(),
        8usize,
        concat!("Alignment of ", stringify!(pj_dns_parsed_rr_rdata_ptr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_parsed_rr_rdata_ptr>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_parsed_rr_rdata_ptr),
            "::",
            stringify!(name)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_dns_parsed_rr_rdata_a {
    pub ip_addr: pj_in_addr,
}
#[test]
fn bindgen_test_layout_pj_dns_parsed_rr_rdata_a() {
    assert_eq!(
        ::std::mem::size_of::<pj_dns_parsed_rr_rdata_a>(),
        4usize,
        concat!("Size of: ", stringify!(pj_dns_parsed_rr_rdata_a))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_dns_parsed_rr_rdata_a>(),
        4usize,
        concat!("Alignment of ", stringify!(pj_dns_parsed_rr_rdata_a))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pj_dns_parsed_rr_rdata_a>())).ip_addr as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_parsed_rr_rdata_a),
            "::",
            stringify!(ip_addr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pj_dns_parsed_rr_rdata_aaaa {
    pub ip_addr: pj_in6_addr,
}
#[test]
fn bindgen_test_layout_pj_dns_parsed_rr_rdata_aaaa() {
    assert_eq!(
        ::std::mem::size_of::<pj_dns_parsed_rr_rdata_aaaa>(),
        16usize,
        concat!("Size of: ", stringify!(pj_dns_parsed_rr_rdata_aaaa))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_dns_parsed_rr_rdata_aaaa>(),
        4usize,
        concat!("Alignment of ", stringify!(pj_dns_parsed_rr_rdata_aaaa))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pj_dns_parsed_rr_rdata_aaaa>())).ip_addr as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_parsed_rr_rdata_aaaa),
            "::",
            stringify!(ip_addr)
        )
    );
}
#[test]
fn bindgen_test_layout_pj_dns_parsed_rr_rdata() {
    assert_eq!(
        ::std::mem::size_of::<pj_dns_parsed_rr_rdata>(),
        24usize,
        concat!("Size of: ", stringify!(pj_dns_parsed_rr_rdata))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_dns_parsed_rr_rdata>(),
        8usize,
        concat!("Alignment of ", stringify!(pj_dns_parsed_rr_rdata))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_parsed_rr_rdata>())).srv as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_parsed_rr_rdata),
            "::",
            stringify!(srv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_parsed_rr_rdata>())).cname as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_parsed_rr_rdata),
            "::",
            stringify!(cname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_parsed_rr_rdata>())).ns as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_parsed_rr_rdata),
            "::",
            stringify!(ns)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_parsed_rr_rdata>())).ptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_parsed_rr_rdata),
            "::",
            stringify!(ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_parsed_rr_rdata>())).a as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_parsed_rr_rdata),
            "::",
            stringify!(a)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_parsed_rr_rdata>())).aaaa as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_parsed_rr_rdata),
            "::",
            stringify!(aaaa)
        )
    );
}
#[test]
fn bindgen_test_layout_pj_dns_parsed_rr() {
    assert_eq!(
        ::std::mem::size_of::<pj_dns_parsed_rr>(),
        64usize,
        concat!("Size of: ", stringify!(pj_dns_parsed_rr))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_dns_parsed_rr>(),
        8usize,
        concat!("Alignment of ", stringify!(pj_dns_parsed_rr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_parsed_rr>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_parsed_rr),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_parsed_rr>())).type_ as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_parsed_rr),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_parsed_rr>())).dnsclass as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_parsed_rr),
            "::",
            stringify!(dnsclass)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_parsed_rr>())).ttl as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_parsed_rr),
            "::",
            stringify!(ttl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_parsed_rr>())).rdlength as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_parsed_rr),
            "::",
            stringify!(rdlength)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_parsed_rr>())).data as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_parsed_rr),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_parsed_rr>())).rdata as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_parsed_rr),
            "::",
            stringify!(rdata)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_dns_parsed_packet {
    pub hdr: pj_dns_hdr,
    pub q: *mut pj_dns_parsed_query,
    pub ans: *mut pj_dns_parsed_rr,
    pub ns: *mut pj_dns_parsed_rr,
    pub arr: *mut pj_dns_parsed_rr,
}
#[test]
fn bindgen_test_layout_pj_dns_parsed_packet() {
    assert_eq!(
        ::std::mem::size_of::<pj_dns_parsed_packet>(),
        48usize,
        concat!("Size of: ", stringify!(pj_dns_parsed_packet))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_dns_parsed_packet>(),
        8usize,
        concat!("Alignment of ", stringify!(pj_dns_parsed_packet))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_parsed_packet>())).hdr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_parsed_packet),
            "::",
            stringify!(hdr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_parsed_packet>())).q as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_parsed_packet),
            "::",
            stringify!(q)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_parsed_packet>())).ans as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_parsed_packet),
            "::",
            stringify!(ans)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_parsed_packet>())).ns as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_parsed_packet),
            "::",
            stringify!(ns)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_parsed_packet>())).arr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_parsed_packet),
            "::",
            stringify!(arr)
        )
    );
}
pub const pj_dns_dup_options_PJ_DNS_NO_QD: pj_dns_dup_options = 1;
pub const pj_dns_dup_options_PJ_DNS_NO_ANS: pj_dns_dup_options = 2;
pub const pj_dns_dup_options_PJ_DNS_NO_NS: pj_dns_dup_options = 4;
pub const pj_dns_dup_options_PJ_DNS_NO_AR: pj_dns_dup_options = 8;
pub type pj_dns_dup_options = ::std::os::raw::c_uint;
extern "C" {
    pub fn pj_dns_make_query(
        packet: *mut ::std::os::raw::c_void,
        size: *mut ::std::os::raw::c_uint,
        id: pj_uint16_t,
        qtype: ::std::os::raw::c_int,
        name: *const pj_str_t,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_dns_parse_packet(
        pool: *mut pj_pool_t,
        packet: *const ::std::os::raw::c_void,
        size: ::std::os::raw::c_uint,
        p_res: *mut *mut pj_dns_parsed_packet,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_dns_packet_dup(
        pool: *mut pj_pool_t,
        p: *const pj_dns_parsed_packet,
        options: ::std::os::raw::c_uint,
        p_dst: *mut *mut pj_dns_parsed_packet,
    );
}
extern "C" {
    pub fn pj_dns_get_type_name(type_: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn pj_dns_init_srv_rr(
        rec: *mut pj_dns_parsed_rr,
        res_name: *const pj_str_t,
        dnsclass: ::std::os::raw::c_uint,
        ttl: ::std::os::raw::c_uint,
        prio: ::std::os::raw::c_uint,
        weight: ::std::os::raw::c_uint,
        port: ::std::os::raw::c_uint,
        target: *const pj_str_t,
    );
}
extern "C" {
    pub fn pj_dns_init_cname_rr(
        rec: *mut pj_dns_parsed_rr,
        res_name: *const pj_str_t,
        dnsclass: ::std::os::raw::c_uint,
        ttl: ::std::os::raw::c_uint,
        name: *const pj_str_t,
    );
}
extern "C" {
    pub fn pj_dns_init_a_rr(
        rec: *mut pj_dns_parsed_rr,
        res_name: *const pj_str_t,
        dnsclass: ::std::os::raw::c_uint,
        ttl: ::std::os::raw::c_uint,
        ip_addr: *const pj_in_addr,
    );
}
extern "C" {
    pub fn pj_dns_init_aaaa_rr(
        rec: *mut pj_dns_parsed_rr,
        res_name: *const pj_str_t,
        dnsclass: ::std::os::raw::c_uint,
        ttl: ::std::os::raw::c_uint,
        ip_addr: *const pj_in6_addr,
    );
}
extern "C" {
    pub fn pj_dns_dump_packet(res: *const pj_dns_parsed_packet);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_dns_resolver {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_dns_async_query {
    _unused: [u8; 0],
}
pub type pj_dns_callback = ::std::option::Option<
    unsafe extern "C" fn(
        user_data: *mut ::std::os::raw::c_void,
        status: pj_status_t,
        response: *mut pj_dns_parsed_packet,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_dns_settings {
    pub options: ::std::os::raw::c_uint,
    pub qretr_delay: ::std::os::raw::c_uint,
    pub qretr_count: ::std::os::raw::c_uint,
    pub cache_max_ttl: ::std::os::raw::c_uint,
    pub good_ns_ttl: ::std::os::raw::c_uint,
    pub bad_ns_ttl: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_pj_dns_settings() {
    assert_eq!(
        ::std::mem::size_of::<pj_dns_settings>(),
        24usize,
        concat!("Size of: ", stringify!(pj_dns_settings))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_dns_settings>(),
        4usize,
        concat!("Alignment of ", stringify!(pj_dns_settings))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_settings>())).options as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_settings),
            "::",
            stringify!(options)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_settings>())).qretr_delay as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_settings),
            "::",
            stringify!(qretr_delay)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_settings>())).qretr_count as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_settings),
            "::",
            stringify!(qretr_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_settings>())).cache_max_ttl as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_settings),
            "::",
            stringify!(cache_max_ttl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_settings>())).good_ns_ttl as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_settings),
            "::",
            stringify!(good_ns_ttl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_settings>())).bad_ns_ttl as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_settings),
            "::",
            stringify!(bad_ns_ttl)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pj_dns_a_record {
    pub name: pj_str_t,
    pub alias: pj_str_t,
    pub addr_count: ::std::os::raw::c_uint,
    pub addr: [pj_in_addr; 8usize],
    pub buf_: [::std::os::raw::c_char; 128usize],
}
#[test]
fn bindgen_test_layout_pj_dns_a_record() {
    assert_eq!(
        ::std::mem::size_of::<pj_dns_a_record>(),
        200usize,
        concat!("Size of: ", stringify!(pj_dns_a_record))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_dns_a_record>(),
        8usize,
        concat!("Alignment of ", stringify!(pj_dns_a_record))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_a_record>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_a_record),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_a_record>())).alias as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_a_record),
            "::",
            stringify!(alias)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_a_record>())).addr_count as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_a_record),
            "::",
            stringify!(addr_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_a_record>())).addr as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_a_record),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_a_record>())).buf_ as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_a_record),
            "::",
            stringify!(buf_)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pj_dns_addr_record {
    pub name: pj_str_t,
    pub alias: pj_str_t,
    pub addr_count: ::std::os::raw::c_uint,
    pub addr: [pj_dns_addr_record__bindgen_ty_1; 8usize],
    pub buf_: [::std::os::raw::c_char; 128usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pj_dns_addr_record__bindgen_ty_1 {
    pub af: ::std::os::raw::c_int,
    pub ip: pj_dns_addr_record__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pj_dns_addr_record__bindgen_ty_1__bindgen_ty_1 {
    pub v4: pj_in_addr,
    pub v6: pj_in6_addr,
    _bindgen_union_align: [u32; 4usize],
}
#[test]
fn bindgen_test_layout_pj_dns_addr_record__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<pj_dns_addr_record__bindgen_ty_1__bindgen_ty_1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(pj_dns_addr_record__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<pj_dns_addr_record__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(pj_dns_addr_record__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pj_dns_addr_record__bindgen_ty_1__bindgen_ty_1>())).v4
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_addr_record__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(v4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pj_dns_addr_record__bindgen_ty_1__bindgen_ty_1>())).v6
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_addr_record__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(v6)
        )
    );
}
#[test]
fn bindgen_test_layout_pj_dns_addr_record__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<pj_dns_addr_record__bindgen_ty_1>(),
        20usize,
        concat!("Size of: ", stringify!(pj_dns_addr_record__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_dns_addr_record__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(pj_dns_addr_record__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pj_dns_addr_record__bindgen_ty_1>())).af as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_addr_record__bindgen_ty_1),
            "::",
            stringify!(af)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pj_dns_addr_record__bindgen_ty_1>())).ip as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_addr_record__bindgen_ty_1),
            "::",
            stringify!(ip)
        )
    );
}
#[test]
fn bindgen_test_layout_pj_dns_addr_record() {
    assert_eq!(
        ::std::mem::size_of::<pj_dns_addr_record>(),
        328usize,
        concat!("Size of: ", stringify!(pj_dns_addr_record))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_dns_addr_record>(),
        8usize,
        concat!("Alignment of ", stringify!(pj_dns_addr_record))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_addr_record>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_addr_record),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_addr_record>())).alias as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_addr_record),
            "::",
            stringify!(alias)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_addr_record>())).addr_count as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_addr_record),
            "::",
            stringify!(addr_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_addr_record>())).addr as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_addr_record),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_dns_addr_record>())).buf_ as *const _ as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_dns_addr_record),
            "::",
            stringify!(buf_)
        )
    );
}
extern "C" {
    pub fn pj_dns_settings_default(s: *mut pj_dns_settings);
}
extern "C" {
    pub fn pj_dns_resolver_create(
        pf: *mut pj_pool_factory,
        name: *const ::std::os::raw::c_char,
        options: ::std::os::raw::c_uint,
        timer: *mut pj_timer_heap_t,
        ioqueue: *mut pj_ioqueue_t,
        p_resolver: *mut *mut pj_dns_resolver,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_dns_resolver_set_ns(
        resolver: *mut pj_dns_resolver,
        count: ::std::os::raw::c_uint,
        servers: *const pj_str_t,
        ports: *const pj_uint16_t,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_dns_resolver_get_settings(
        resolver: *mut pj_dns_resolver,
        st: *mut pj_dns_settings,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_dns_resolver_set_settings(
        resolver: *mut pj_dns_resolver,
        st: *const pj_dns_settings,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_dns_resolver_handle_events(
        resolver: *mut pj_dns_resolver,
        timeout: *const pj_time_val,
    );
}
extern "C" {
    pub fn pj_dns_resolver_destroy(
        resolver: *mut pj_dns_resolver,
        notify: pj_bool_t,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_dns_resolver_start_query(
        resolver: *mut pj_dns_resolver,
        name: *const pj_str_t,
        type_: ::std::os::raw::c_int,
        options: ::std::os::raw::c_uint,
        cb: pj_dns_callback,
        user_data: *mut ::std::os::raw::c_void,
        p_query: *mut *mut pj_dns_async_query,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_dns_resolver_cancel_query(
        query: *mut pj_dns_async_query,
        notify: pj_bool_t,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_dns_parse_a_response(
        pkt: *const pj_dns_parsed_packet,
        rec: *mut pj_dns_a_record,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_dns_parse_addr_response(
        pkt: *const pj_dns_parsed_packet,
        rec: *mut pj_dns_addr_record,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_dns_resolver_add_entry(
        resolver: *mut pj_dns_resolver,
        pkt: *const pj_dns_parsed_packet,
        set_ttl: pj_bool_t,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_dns_resolver_get_cached_count(
        resolver: *mut pj_dns_resolver,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn pj_dns_resolver_dump(resolver: *mut pj_dns_resolver, detail: pj_bool_t);
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pjsip_server_addresses {
    pub count: ::std::os::raw::c_uint,
    pub entry: [pjsip_server_addresses__bindgen_ty_1; 16usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pjsip_server_addresses__bindgen_ty_1 {
    pub type_: pjsip_transport_type_e,
    pub priority: ::std::os::raw::c_uint,
    pub weight: ::std::os::raw::c_uint,
    pub addr: pj_sockaddr,
    pub addr_len: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pjsip_server_addresses__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_server_addresses__bindgen_ty_1>(),
        44usize,
        concat!(
            "Size of: ",
            stringify!(pjsip_server_addresses__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_server_addresses__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(pjsip_server_addresses__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_server_addresses__bindgen_ty_1>())).type_ as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_server_addresses__bindgen_ty_1),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_server_addresses__bindgen_ty_1>())).priority as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_server_addresses__bindgen_ty_1),
            "::",
            stringify!(priority)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_server_addresses__bindgen_ty_1>())).weight as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_server_addresses__bindgen_ty_1),
            "::",
            stringify!(weight)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_server_addresses__bindgen_ty_1>())).addr as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_server_addresses__bindgen_ty_1),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_server_addresses__bindgen_ty_1>())).addr_len as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_server_addresses__bindgen_ty_1),
            "::",
            stringify!(addr_len)
        )
    );
}
#[test]
fn bindgen_test_layout_pjsip_server_addresses() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_server_addresses>(),
        708usize,
        concat!("Size of: ", stringify!(pjsip_server_addresses))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_server_addresses>(),
        4usize,
        concat!("Alignment of ", stringify!(pjsip_server_addresses))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_server_addresses>())).count as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_server_addresses),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_server_addresses>())).entry as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_server_addresses),
            "::",
            stringify!(entry)
        )
    );
}
pub type pjsip_resolver_callback = ::std::option::Option<
    unsafe extern "C" fn(
        status: pj_status_t,
        token: *mut ::std::os::raw::c_void,
        addr: *const pjsip_server_addresses,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_ext_resolver {
    pub resolve: ::std::option::Option<
        unsafe extern "C" fn(
            resolver: *mut pjsip_resolver_t,
            pool: *mut pj_pool_t,
            target: *const pjsip_host_info,
            token: *mut ::std::os::raw::c_void,
            cb: pjsip_resolver_callback,
        ),
    >,
}
#[test]
fn bindgen_test_layout_pjsip_ext_resolver() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_ext_resolver>(),
        8usize,
        concat!("Size of: ", stringify!(pjsip_ext_resolver))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_ext_resolver>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_ext_resolver))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_ext_resolver>())).resolve as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_ext_resolver),
            "::",
            stringify!(resolve)
        )
    );
}
extern "C" {
    pub fn pjsip_resolver_create(
        pool: *mut pj_pool_t,
        p_res: *mut *mut pjsip_resolver_t,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pjsip_resolver_set_resolver(
        res: *mut pjsip_resolver_t,
        dns_res: *mut pj_dns_resolver,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pjsip_resolver_set_ext_resolver(
        res: *mut pjsip_resolver_t,
        ext_res: *mut pjsip_ext_resolver,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pjsip_resolver_get_resolver(res: *mut pjsip_resolver_t) -> *mut pj_dns_resolver;
}
extern "C" {
    pub fn pjsip_resolver_destroy(resolver: *mut pjsip_resolver_t);
}
extern "C" {
    pub fn pjsip_resolve(
        resolver: *mut pjsip_resolver_t,
        pool: *mut pj_pool_t,
        target: *const pjsip_host_info,
        token: *mut ::std::os::raw::c_void,
        cb: pjsip_resolver_callback,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_ioqueue_op_key_t {
    pub internal__: [*mut ::std::os::raw::c_void; 32usize],
    pub activesock_data: *mut ::std::os::raw::c_void,
    pub user_data: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_pj_ioqueue_op_key_t() {
    assert_eq!(
        ::std::mem::size_of::<pj_ioqueue_op_key_t>(),
        272usize,
        concat!("Size of: ", stringify!(pj_ioqueue_op_key_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_ioqueue_op_key_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pj_ioqueue_op_key_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_ioqueue_op_key_t>())).internal__ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_ioqueue_op_key_t),
            "::",
            stringify!(internal__)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pj_ioqueue_op_key_t>())).activesock_data as *const _ as usize
        },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_ioqueue_op_key_t),
            "::",
            stringify!(activesock_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pj_ioqueue_op_key_t>())).user_data as *const _ as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_ioqueue_op_key_t),
            "::",
            stringify!(user_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pj_ioqueue_callback {
    pub on_read_complete: ::std::option::Option<
        unsafe extern "C" fn(
            key: *mut pj_ioqueue_key_t,
            op_key: *mut pj_ioqueue_op_key_t,
            bytes_read: pj_ssize_t,
        ),
    >,
    pub on_write_complete: ::std::option::Option<
        unsafe extern "C" fn(
            key: *mut pj_ioqueue_key_t,
            op_key: *mut pj_ioqueue_op_key_t,
            bytes_sent: pj_ssize_t,
        ),
    >,
    pub on_accept_complete: ::std::option::Option<
        unsafe extern "C" fn(
            key: *mut pj_ioqueue_key_t,
            op_key: *mut pj_ioqueue_op_key_t,
            sock: pj_sock_t,
            status: pj_status_t,
        ),
    >,
    pub on_connect_complete: ::std::option::Option<
        unsafe extern "C" fn(key: *mut pj_ioqueue_key_t, status: pj_status_t),
    >,
}
#[test]
fn bindgen_test_layout_pj_ioqueue_callback() {
    assert_eq!(
        ::std::mem::size_of::<pj_ioqueue_callback>(),
        32usize,
        concat!("Size of: ", stringify!(pj_ioqueue_callback))
    );
    assert_eq!(
        ::std::mem::align_of::<pj_ioqueue_callback>(),
        8usize,
        concat!("Alignment of ", stringify!(pj_ioqueue_callback))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pj_ioqueue_callback>())).on_read_complete as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_ioqueue_callback),
            "::",
            stringify!(on_read_complete)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pj_ioqueue_callback>())).on_write_complete as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_ioqueue_callback),
            "::",
            stringify!(on_write_complete)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pj_ioqueue_callback>())).on_accept_complete as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_ioqueue_callback),
            "::",
            stringify!(on_accept_complete)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pj_ioqueue_callback>())).on_connect_complete as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pj_ioqueue_callback),
            "::",
            stringify!(on_connect_complete)
        )
    );
}
pub const pj_ioqueue_operation_e_PJ_IOQUEUE_OP_NONE: pj_ioqueue_operation_e = 0;
pub const pj_ioqueue_operation_e_PJ_IOQUEUE_OP_READ: pj_ioqueue_operation_e = 1;
pub const pj_ioqueue_operation_e_PJ_IOQUEUE_OP_RECV: pj_ioqueue_operation_e = 2;
pub const pj_ioqueue_operation_e_PJ_IOQUEUE_OP_RECV_FROM: pj_ioqueue_operation_e = 4;
pub const pj_ioqueue_operation_e_PJ_IOQUEUE_OP_WRITE: pj_ioqueue_operation_e = 8;
pub const pj_ioqueue_operation_e_PJ_IOQUEUE_OP_SEND: pj_ioqueue_operation_e = 16;
pub const pj_ioqueue_operation_e_PJ_IOQUEUE_OP_SEND_TO: pj_ioqueue_operation_e = 32;
pub const pj_ioqueue_operation_e_PJ_IOQUEUE_OP_ACCEPT: pj_ioqueue_operation_e = 64;
pub const pj_ioqueue_operation_e_PJ_IOQUEUE_OP_CONNECT: pj_ioqueue_operation_e = 128;
pub type pj_ioqueue_operation_e = ::std::os::raw::c_uint;
extern "C" {
    pub fn pj_ioqueue_name() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn pj_ioqueue_create(
        pool: *mut pj_pool_t,
        max_fd: pj_size_t,
        ioqueue: *mut *mut pj_ioqueue_t,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_ioqueue_destroy(ioque: *mut pj_ioqueue_t) -> pj_status_t;
}
extern "C" {
    pub fn pj_ioqueue_set_lock(
        ioque: *mut pj_ioqueue_t,
        lock: *mut pj_lock_t,
        auto_delete: pj_bool_t,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_ioqueue_set_default_concurrency(
        ioqueue: *mut pj_ioqueue_t,
        allow: pj_bool_t,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_ioqueue_register_sock(
        pool: *mut pj_pool_t,
        ioque: *mut pj_ioqueue_t,
        sock: pj_sock_t,
        user_data: *mut ::std::os::raw::c_void,
        cb: *const pj_ioqueue_callback,
        key: *mut *mut pj_ioqueue_key_t,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_ioqueue_register_sock2(
        pool: *mut pj_pool_t,
        ioque: *mut pj_ioqueue_t,
        sock: pj_sock_t,
        grp_lock: *mut pj_grp_lock_t,
        user_data: *mut ::std::os::raw::c_void,
        cb: *const pj_ioqueue_callback,
        key: *mut *mut pj_ioqueue_key_t,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_ioqueue_unregister(key: *mut pj_ioqueue_key_t) -> pj_status_t;
}
extern "C" {
    pub fn pj_ioqueue_get_user_data(key: *mut pj_ioqueue_key_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn pj_ioqueue_set_user_data(
        key: *mut pj_ioqueue_key_t,
        user_data: *mut ::std::os::raw::c_void,
        old_data: *mut *mut ::std::os::raw::c_void,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_ioqueue_set_concurrency(key: *mut pj_ioqueue_key_t, allow: pj_bool_t) -> pj_status_t;
}
extern "C" {
    pub fn pj_ioqueue_lock_key(key: *mut pj_ioqueue_key_t) -> pj_status_t;
}
extern "C" {
    pub fn pj_ioqueue_trylock_key(key: *mut pj_ioqueue_key_t) -> pj_status_t;
}
extern "C" {
    pub fn pj_ioqueue_unlock_key(key: *mut pj_ioqueue_key_t) -> pj_status_t;
}
extern "C" {
    pub fn pj_ioqueue_op_key_init(op_key: *mut pj_ioqueue_op_key_t, size: pj_size_t);
}
extern "C" {
    pub fn pj_ioqueue_is_pending(
        key: *mut pj_ioqueue_key_t,
        op_key: *mut pj_ioqueue_op_key_t,
    ) -> pj_bool_t;
}
extern "C" {
    pub fn pj_ioqueue_post_completion(
        key: *mut pj_ioqueue_key_t,
        op_key: *mut pj_ioqueue_op_key_t,
        bytes_status: pj_ssize_t,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_ioqueue_accept(
        key: *mut pj_ioqueue_key_t,
        op_key: *mut pj_ioqueue_op_key_t,
        new_sock: *mut pj_sock_t,
        local: *mut pj_sockaddr_t,
        remote: *mut pj_sockaddr_t,
        addrlen: *mut ::std::os::raw::c_int,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_ioqueue_connect(
        key: *mut pj_ioqueue_key_t,
        addr: *const pj_sockaddr_t,
        addrlen: ::std::os::raw::c_int,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_ioqueue_poll(
        ioque: *mut pj_ioqueue_t,
        timeout: *const pj_time_val,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pj_ioqueue_recv(
        key: *mut pj_ioqueue_key_t,
        op_key: *mut pj_ioqueue_op_key_t,
        buffer: *mut ::std::os::raw::c_void,
        length: *mut pj_ssize_t,
        flags: pj_uint32_t,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_ioqueue_recvfrom(
        key: *mut pj_ioqueue_key_t,
        op_key: *mut pj_ioqueue_op_key_t,
        buffer: *mut ::std::os::raw::c_void,
        length: *mut pj_ssize_t,
        flags: pj_uint32_t,
        addr: *mut pj_sockaddr_t,
        addrlen: *mut ::std::os::raw::c_int,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_ioqueue_send(
        key: *mut pj_ioqueue_key_t,
        op_key: *mut pj_ioqueue_op_key_t,
        data: *const ::std::os::raw::c_void,
        length: *mut pj_ssize_t,
        flags: pj_uint32_t,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pj_ioqueue_sendto(
        key: *mut pj_ioqueue_key_t,
        op_key: *mut pj_ioqueue_op_key_t,
        data: *const ::std::os::raw::c_void,
        length: *mut pj_ssize_t,
        flags: pj_uint32_t,
        addr: *const pj_sockaddr_t,
        addrlen: ::std::os::raw::c_int,
    ) -> pj_status_t;
}
pub const pjsip_transport_flags_e_PJSIP_TRANSPORT_RELIABLE: pjsip_transport_flags_e = 1;
pub const pjsip_transport_flags_e_PJSIP_TRANSPORT_SECURE: pjsip_transport_flags_e = 2;
pub const pjsip_transport_flags_e_PJSIP_TRANSPORT_DATAGRAM: pjsip_transport_flags_e = 4;
pub type pjsip_transport_flags_e = ::std::os::raw::c_uint;
extern "C" {
    pub fn pjsip_transport_register_type(
        tp_flag: ::std::os::raw::c_uint,
        tp_name: *const ::std::os::raw::c_char,
        def_port: ::std::os::raw::c_int,
        p_tp_type: *mut ::std::os::raw::c_int,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pjsip_transport_get_type_from_name(name: *const pj_str_t) -> pjsip_transport_type_e;
}
extern "C" {
    pub fn pjsip_transport_get_type_from_flag(
        flag: ::std::os::raw::c_uint,
    ) -> pjsip_transport_type_e;
}
extern "C" {
    pub fn pjsip_transport_type_get_af(type_: pjsip_transport_type_e) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pjsip_transport_get_flag_from_type(
        type_: pjsip_transport_type_e,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn pjsip_transport_get_default_port_for_type(
        type_: pjsip_transport_type_e,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pjsip_transport_get_type_name(
        t: pjsip_transport_type_e,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn pjsip_transport_get_type_desc(
        t: pjsip_transport_type_e,
    ) -> *const ::std::os::raw::c_char;
}
pub const pjsip_tpselector_type_PJSIP_TPSELECTOR_NONE: pjsip_tpselector_type = 0;
pub const pjsip_tpselector_type_PJSIP_TPSELECTOR_TRANSPORT: pjsip_tpselector_type = 1;
pub const pjsip_tpselector_type_PJSIP_TPSELECTOR_LISTENER: pjsip_tpselector_type = 2;
pub type pjsip_tpselector_type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pjsip_tpselector {
    pub type_: pjsip_tpselector_type,
    pub disable_connection_reuse: pj_bool_t,
    pub u: pjsip_tpselector__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pjsip_tpselector__bindgen_ty_1 {
    pub transport: *mut pjsip_transport,
    pub listener: *mut pjsip_tpfactory,
    pub ptr: *mut ::std::os::raw::c_void,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_pjsip_tpselector__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_tpselector__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(pjsip_tpselector__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_tpselector__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_tpselector__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_tpselector__bindgen_ty_1>())).transport as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_tpselector__bindgen_ty_1),
            "::",
            stringify!(transport)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_tpselector__bindgen_ty_1>())).listener as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_tpselector__bindgen_ty_1),
            "::",
            stringify!(listener)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_tpselector__bindgen_ty_1>())).ptr as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_tpselector__bindgen_ty_1),
            "::",
            stringify!(ptr)
        )
    );
}
#[test]
fn bindgen_test_layout_pjsip_tpselector() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_tpselector>(),
        16usize,
        concat!("Size of: ", stringify!(pjsip_tpselector))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_tpselector>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_tpselector))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_tpselector>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_tpselector),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_tpselector>())).disable_connection_reuse as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_tpselector),
            "::",
            stringify!(disable_connection_reuse)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_tpselector>())).u as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_tpselector),
            "::",
            stringify!(u)
        )
    );
}
extern "C" {
    pub fn pjsip_tpselector_add_ref(sel: *mut pjsip_tpselector);
}
extern "C" {
    pub fn pjsip_tpselector_dec_ref(sel: *mut pjsip_tpselector);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_rx_data_op_key {
    pub op_key: pj_ioqueue_op_key_t,
    pub rdata: *mut pjsip_rx_data,
}
#[test]
fn bindgen_test_layout_pjsip_rx_data_op_key() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_rx_data_op_key>(),
        280usize,
        concat!("Size of: ", stringify!(pjsip_rx_data_op_key))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_rx_data_op_key>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_rx_data_op_key))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_rx_data_op_key>())).op_key as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data_op_key),
            "::",
            stringify!(op_key)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_rx_data_op_key>())).rdata as *const _ as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data_op_key),
            "::",
            stringify!(rdata)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pjsip_rx_data {
    pub tp_info: pjsip_rx_data__bindgen_ty_1,
    pub pkt_info: pjsip_rx_data__bindgen_ty_2,
    pub msg_info: pjsip_rx_data__bindgen_ty_3,
    pub endpt_info: pjsip_rx_data__bindgen_ty_4,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_rx_data__bindgen_ty_1 {
    pub pool: *mut pj_pool_t,
    pub transport: *mut pjsip_transport,
    pub tp_data: *mut ::std::os::raw::c_void,
    pub op_key: pjsip_rx_data_op_key,
}
#[test]
fn bindgen_test_layout_pjsip_rx_data__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_rx_data__bindgen_ty_1>(),
        304usize,
        concat!("Size of: ", stringify!(pjsip_rx_data__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_rx_data__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_rx_data__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_rx_data__bindgen_ty_1>())).pool as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data__bindgen_ty_1),
            "::",
            stringify!(pool)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_rx_data__bindgen_ty_1>())).transport as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data__bindgen_ty_1),
            "::",
            stringify!(transport)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_rx_data__bindgen_ty_1>())).tp_data as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data__bindgen_ty_1),
            "::",
            stringify!(tp_data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_rx_data__bindgen_ty_1>())).op_key as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data__bindgen_ty_1),
            "::",
            stringify!(op_key)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pjsip_rx_data__bindgen_ty_2 {
    pub timestamp: pj_time_val,
    pub packet: [::std::os::raw::c_char; 4000usize],
    pub zero: pj_uint32_t,
    pub len: pj_ssize_t,
    pub src_addr: pj_sockaddr,
    pub src_addr_len: ::std::os::raw::c_int,
    pub src_name: [::std::os::raw::c_char; 46usize],
    pub src_port: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pjsip_rx_data__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_rx_data__bindgen_ty_2>(),
        4120usize,
        concat!("Size of: ", stringify!(pjsip_rx_data__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_rx_data__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_rx_data__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_rx_data__bindgen_ty_2>())).timestamp as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data__bindgen_ty_2),
            "::",
            stringify!(timestamp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_rx_data__bindgen_ty_2>())).packet as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data__bindgen_ty_2),
            "::",
            stringify!(packet)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_rx_data__bindgen_ty_2>())).zero as *const _ as usize
        },
        4016usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data__bindgen_ty_2),
            "::",
            stringify!(zero)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_rx_data__bindgen_ty_2>())).len as *const _ as usize },
        4024usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data__bindgen_ty_2),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_rx_data__bindgen_ty_2>())).src_addr as *const _ as usize
        },
        4032usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data__bindgen_ty_2),
            "::",
            stringify!(src_addr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_rx_data__bindgen_ty_2>())).src_addr_len as *const _
                as usize
        },
        4060usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data__bindgen_ty_2),
            "::",
            stringify!(src_addr_len)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_rx_data__bindgen_ty_2>())).src_name as *const _ as usize
        },
        4064usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data__bindgen_ty_2),
            "::",
            stringify!(src_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_rx_data__bindgen_ty_2>())).src_port as *const _ as usize
        },
        4112usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data__bindgen_ty_2),
            "::",
            stringify!(src_port)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_rx_data__bindgen_ty_3 {
    pub msg_buf: *mut ::std::os::raw::c_char,
    pub len: ::std::os::raw::c_int,
    pub msg: *mut pjsip_msg,
    pub info: *mut ::std::os::raw::c_char,
    pub cid: *mut pjsip_cid_hdr,
    pub from: *mut pjsip_from_hdr,
    pub to: *mut pjsip_to_hdr,
    pub via: *mut pjsip_via_hdr,
    pub cseq: *mut pjsip_cseq_hdr,
    pub max_fwd: *mut pjsip_max_fwd_hdr,
    pub route: *mut pjsip_route_hdr,
    pub record_route: *mut pjsip_rr_hdr,
    pub ctype: *mut pjsip_ctype_hdr,
    pub clen: *mut pjsip_clen_hdr,
    pub require: *mut pjsip_require_hdr,
    pub supported: *mut pjsip_supported_hdr,
    pub parse_err: pjsip_parser_err_report,
}
#[test]
fn bindgen_test_layout_pjsip_rx_data__bindgen_ty_3() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_rx_data__bindgen_ty_3>(),
        176usize,
        concat!("Size of: ", stringify!(pjsip_rx_data__bindgen_ty_3))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_rx_data__bindgen_ty_3>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_rx_data__bindgen_ty_3))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_rx_data__bindgen_ty_3>())).msg_buf as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data__bindgen_ty_3),
            "::",
            stringify!(msg_buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_rx_data__bindgen_ty_3>())).len as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data__bindgen_ty_3),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_rx_data__bindgen_ty_3>())).msg as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data__bindgen_ty_3),
            "::",
            stringify!(msg)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_rx_data__bindgen_ty_3>())).info as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data__bindgen_ty_3),
            "::",
            stringify!(info)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_rx_data__bindgen_ty_3>())).cid as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data__bindgen_ty_3),
            "::",
            stringify!(cid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_rx_data__bindgen_ty_3>())).from as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data__bindgen_ty_3),
            "::",
            stringify!(from)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_rx_data__bindgen_ty_3>())).to as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data__bindgen_ty_3),
            "::",
            stringify!(to)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_rx_data__bindgen_ty_3>())).via as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data__bindgen_ty_3),
            "::",
            stringify!(via)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_rx_data__bindgen_ty_3>())).cseq as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data__bindgen_ty_3),
            "::",
            stringify!(cseq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_rx_data__bindgen_ty_3>())).max_fwd as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data__bindgen_ty_3),
            "::",
            stringify!(max_fwd)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_rx_data__bindgen_ty_3>())).route as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data__bindgen_ty_3),
            "::",
            stringify!(route)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_rx_data__bindgen_ty_3>())).record_route as *const _
                as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data__bindgen_ty_3),
            "::",
            stringify!(record_route)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_rx_data__bindgen_ty_3>())).ctype as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data__bindgen_ty_3),
            "::",
            stringify!(ctype)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_rx_data__bindgen_ty_3>())).clen as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data__bindgen_ty_3),
            "::",
            stringify!(clen)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_rx_data__bindgen_ty_3>())).require as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data__bindgen_ty_3),
            "::",
            stringify!(require)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_rx_data__bindgen_ty_3>())).supported as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data__bindgen_ty_3),
            "::",
            stringify!(supported)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_rx_data__bindgen_ty_3>())).parse_err as *const _ as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data__bindgen_ty_3),
            "::",
            stringify!(parse_err)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_rx_data__bindgen_ty_4 {
    pub mod_data: [*mut ::std::os::raw::c_void; 32usize],
}
#[test]
fn bindgen_test_layout_pjsip_rx_data__bindgen_ty_4() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_rx_data__bindgen_ty_4>(),
        256usize,
        concat!("Size of: ", stringify!(pjsip_rx_data__bindgen_ty_4))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_rx_data__bindgen_ty_4>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_rx_data__bindgen_ty_4))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_rx_data__bindgen_ty_4>())).mod_data as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data__bindgen_ty_4),
            "::",
            stringify!(mod_data)
        )
    );
}
#[test]
fn bindgen_test_layout_pjsip_rx_data() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_rx_data>(),
        4856usize,
        concat!("Size of: ", stringify!(pjsip_rx_data))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_rx_data>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_rx_data))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_rx_data>())).tp_info as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data),
            "::",
            stringify!(tp_info)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_rx_data>())).pkt_info as *const _ as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data),
            "::",
            stringify!(pkt_info)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_rx_data>())).msg_info as *const _ as usize },
        4424usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data),
            "::",
            stringify!(msg_info)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_rx_data>())).endpt_info as *const _ as usize },
        4600usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_rx_data),
            "::",
            stringify!(endpt_info)
        )
    );
}
extern "C" {
    pub fn pjsip_rx_data_get_info(rdata: *mut pjsip_rx_data) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn pjsip_rx_data_clone(
        src: *const pjsip_rx_data,
        flags: ::std::os::raw::c_uint,
        p_rdata: *mut *mut pjsip_rx_data,
    ) -> pj_status_t;
}
extern "C" {
    pub fn pjsip_rx_data_free_cloned(rdata: *mut pjsip_rx_data) -> pj_status_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pjsip_tx_data_op_key {
    pub key: pj_ioqueue_op_key_t,
    pub tdata: *mut pjsip_tx_data,
    pub token: *mut ::std::os::raw::c_void,
    pub callback: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut pjsip_transport,
            arg2: *mut ::std::os::raw::c_void,
            arg3: pj_ssize_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_pjsip_tx_data_op_key() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_tx_data_op_key>(),
        296usize,
        concat!("Size of: ", stringify!(pjsip_tx_data_op_key))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_tx_data_op_key>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_tx_data_op_key))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_tx_data_op_key>())).key as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_tx_data_op_key),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_tx_data_op_key>())).tdata as *const _ as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_tx_data_op_key),
            "::",
            stringify!(tdata)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_tx_data_op_key>())).token as *const _ as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_tx_data_op_key),
            "::",
            stringify!(token)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pjsip_tx_data_op_key>())).callback as *const _ as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_tx_data_op_key),
            "::",
            stringify!(callback)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pjsip_tx_data {
    pub prev: *mut pjsip_tx_data,
    pub next: *mut pjsip_tx_data,
    pub pool: *mut pj_pool_t,
    pub obj_name: [::std::os::raw::c_char; 32usize],
    pub info: *mut ::std::os::raw::c_char,
    pub rx_timestamp: pj_time_val,
    pub mgr: *mut pjsip_tpmgr,
    pub op_key: pjsip_tx_data_op_key,
    pub lock: *mut pj_lock_t,
    pub msg: *mut pjsip_msg,
    pub saved_strict_route: *mut pjsip_route_hdr,
    pub buf: pjsip_buffer,
    pub ref_cnt: *mut pj_atomic_t,
    pub is_pending: ::std::os::raw::c_int,
    pub token: *mut ::std::os::raw::c_void,
    pub cb: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: *mut pjsip_tx_data,
            arg3: pj_ssize_t,
        ),
    >,
    pub dest_info: pjsip_tx_data__bindgen_ty_1,
    pub tp_info: pjsip_tx_data__bindgen_ty_2,
    pub tp_sel: pjsip_tpselector,
    pub auth_retry: pj_bool_t,
    pub mod_data: [*mut ::std::os::raw::c_void; 32usize],
    pub via_addr: pjsip_host_port,
    pub via_tp: *const ::std::os::raw::c_void,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pjsip_tx_data__bindgen_ty_1 {
    pub name: pj_str_t,
    pub addr: pjsip_server_addresses,
    pub cur_addr: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_pjsip_tx_data__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<pjsip_tx_data__bindgen_ty_1>(),
        728usize,
        concat!("Size of: ", stringify!(pjsip_tx_data__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pjsip_tx_data__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(pjsip_tx_data__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_tx_data__bindgen_ty_1>())).name as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_tx_data__bindgen_ty_1),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_tx_data__bindgen_ty_1>())).addr as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_tx_data__bindgen_ty_1),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pjsip_tx_data__bindgen_ty_1>())).cur_addr as *const _ as usize
        },
        724usize,
        concat!(
            "Offset of field: ",
            stringify!(pjsip_tx_data__bindgen_ty_1),
            "::",
            stringify!(cur_addr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pjsip_tx_data__bindgen_ty_2 {
